{"uid": "599ab3443846f6f49481765d260c0d0ba84d005d", "titulo": "layout_cobranca_400bytes_cnab_itau", "conteudo": "COBRANÇA BANCÁRIA Intercâmbio Eletrônico de Arquivos Layout de Arquivos – CNAB 400 Índice 1. Noções Básicas ................................................................................................................................... 4 1.1 – Apresentação ........................................................................................................................ 4 1.2 – Cobrança Itaú ........................................................................................................................ 4 2. Informações Técnicas ......................................................................................................................... 5 2.1 – Meios de intercâmbio ............................................................................................................ 5 2.2 – Explicações gerais sobre o arquivo ....................................................................................... 5 2.2.1 – Arquivo remessa ................................................................................................................... 6 2.2.2 – Arquivo retorno ..................................................................................................................... 6 3. Layout do Arquivo ............................................................................................................................... 7 3.1 – Arquivo Remessa .................................................................................................................. 7 3.2 – Arquivo Retorno ...................................................................................................................13 4. Notas .................................................................................................................................................18 5. Condições Personalizadas ...............................................................................................................40 6. Testes e Operações ..........................................................................................................................43 8. Anexo A - Boleto/Código de Barras ................................................................................................48 8.1 – Introdução ............................................................................................................................48 8.2 – Características do boleto .....................................................................................................48 8.3 – Layout do Código de Barras ................................................................................................49 8.4 – Representação Numérica do Código de Barras (IPTE) ......................................................50 Anexo 1 – Modelo de Ficha de Compensação de Boleto / cuidados no preenchimento .............52 Anexo 3 – Cálculo do DAC da Representação Numérica .................................................................55 Anexo 4 – Cálculo do DAC do campo “Nosso Número”, em BOLETOS emitidos pelo próprio cliente. .....................................................................................................................................56 Anexo 5 – Carteira 198 - (Nosso Número com 15 posições) Código de Barras e Representação Numérica .................................................................................................................................58 Anexo 6 – Cálculo do Fator de Vencimento .......................................................................................60 Anexo 7 – Boleto de Proposta .............................................................................................................62 9.1 – Introdução ............................................................................................................................62 9.2 – Explicações gerais ...............................................................................................................62 9.3 – Modelo da Ficha de Compensação .....................................................................................63 JANEIRO 2017 Cobrança CNAB 400 2 NOVO CÓDIGO DE RETORNO DE ENTRADA EM COBRANÇA (Jan/2017) Foi incluído um novo código de retorno indicando que o boleto não liquidado no Desconto de Duplicatas foi transferido para Cobrança Simples. Código disponível na Tabela 10 da Nota 20. NOVOS CÓDIGOS DE RETORNO DA NEGATIVAÇÃO EXPRESSA (Fev/2016) Foram disponibilizados novos códigos de retorno que indicam a situação de entrega da notificação via A.R. (Aviso de Recebimento) em localidades que determinem que a entrega ocorra desta forma. Os novos códigos estão disponíveis na Tabela 12 da Nota 20 deste documento. ATENÇÃO Nas situações onde o boleto será utilizado para possibilitar o pagamento decorrente de eventual aceitação de uma oferta de produto e serviços, de uma proposta de contrato civil ou de um convite para associação, deve-se utilizar obrigatoriamente o modelo do boleto de proposta conforme anexo “7. Boleto de Proposta” deste layout. REPASSE DE TARIFA NOS BOLETOS É proibido o repasse de tarifas nos boletos de pagamento conforme determina o contrato de Cobrança e o Código de Defesa do Consumidor (Lei 8.078 de 11/09/1990). TESTE / VALIDAÇÃO DE LAYOUT DE ARQUIVOS Após o desenvolvimento do seu arquivo utilize o Validador de Layout de Arquivos (Resultado da validação On-line). Acesse no Itaú Empresas na internet no menu Transmissão de arquivos > Validação. Nos casos de emissão (impressão) do boleto pela empresa, deve-se obrigatoriamente realizar a prévia validação modelos de boletos junto ao Itaú através de célula especializada. Fale com seu gerente. Para mais detalhes consulte o item 6. Testes e Operações. JANEIRO 2017 Cobrança CNAB 400 3 1. Noções Básicas 1.1 – Apresentação O Itaú Unibanco S.A. adota o Intercâmbio Eletrônico de Arquivos para fornecer maior comodidade, rapidez e segurança no serviço de cobrança de títulos prestado aos seus clientes. Com ele sua empresa encontra diversas vantagens, tais como: confiabilidade, velocidade no processamento, eliminação de controles manuais e redução de custos. Este manual esclarece tecnicamente o Intercâmbio Eletrônico de Arquivos de cobrança e estabelece as condições básicas para sua utilização. 1.2 – Cobrança Itaú O Itaú possui a cobrança adequada à necessidade de sua empresa. Existem várias modalidades de cobrança registrada, cujas características são identificadas pelo código e número da carteira de cobrança. As principais características são:  Boletos de pagamento impressos e entregues pelo Itaú diretamente ao pagador.  Boletos de pagamento impressos e entregues pelo beneficiário direto ao pagador, obedecendo as regras e modelos contidos neste manual. Converse com seu gerente a carteira mais adequada para sua empresa. JANEIRO 2017 Cobrança CNAB 400 4 2. Informações Técnicas 2.1 – Meios de intercâmbio O Itaú Empresas na Internet é o principal meio para troca de arquivos, onde você conta com alta confiabilidade, rapidez e segurança. Para sua utilização basta sua empresa possuir um computador com acesso à internet. O arquivo deve ser do tipo texto, contendo um registro por linha. Não deve ser utilizado nenhum tipo de compactador de arquivos. 2.2 – Explicações gerais sobre o arquivo O layout do arquivo segue padronização estabelecida pelo CNAB (Centro Nacional de Automação Bancária) e órgão técnico da FEBRABAN (Federação Brasileira de Bancos), com algumas adaptações realizadas pelo Itaú para melhor atender sua empresa. O arquivo deve ser do tipo texto, contendo um registro por linha. Não deve ser utilizado nenhum tipo de compactador de arquivos. Cada arquivo é composto dos seguintes registros:  Um registro Header de Arquivo;  Registros de Detalhes;  Um registro Trailer de Arquivo. Representando graficamente, o arquivo é composto da seguinte maneira: Registro Header do Arquivo => { Reg. = 0 } Arquivo | Registro de Detalhe (Obrigatório) => | Registro de Transação (Opcional – Cheque Devolvido) => => | Registro de Detalhe (Opcional) => | Registro de Detalhe (Opcional) { Reg. = 1 } { Reg. = 1 } { Reg. = 4 } { Reg. = 5 } Registro Trailer do Arquivo => { Reg. = 9 } Cada registro é formado por campos que são apresentados em dois formatos:  Alfanumérico (picture X): alinhados à esquerda com brancos à direita. Preferencialmente, todos os caracteres devem ser maiúsculos. Aconselha-se a não utilização de caracteres especiais (ex.: “Ç”, “?”,, etc) e acentuação gráfica (ex.: “Á”, “É”, “Ê”, etc) e os campos não utilizados deverão ser preenchidos com brancos.  Numérico (picture 9): alinhado à direita com zeros à esquerda e os campos não utilizados deverão ser preenchidos com zeros. - Vírgula assumida (picture V): indica a posição da vírgula dentro de um campo numérico. Exemplo: num campo com picture “9(5)V9(2)”, o número “876,54” será representado por “0087654”. JANEIRO 2017 Cobrança CNAB 400 5 2.2.1 – Arquivo remessa É um arquivo enviado pelo cliente ao Itaú para:   Registro dos boletos. Comandar instruções nos boletos já enviados. Podem ser enviados vários arquivos por dia, todos serão tratados. 2.2.2 – Arquivo retorno 2.2.2.1 – Diário É um arquivo enviado pelo Itaú ao cliente para: Informar as liquidações (pagamentos) ocorridas.   Confirmar o recebimento dos registros ou instruções de boletos enviadas.  Informar a execução de comandos previamente agendados (por exemplo, informar a baixa de um boleto quando completa 120 dias em carteira); Informar alegações dos pagadores; Informar erros cometidos no arquivo remessa, rejeitando entradas ou instruções.   O arquivo retorno é gerado sempre que ocorrer qualquer evento que movimente algum registro em nosso sistema. Se nenhum evento ocorrer, o retorno não é gerado. O layout do arquivo retorno obedece à mesma padronização independente da carteira utilizada. 2.2.2.2 – Mensal Adicionalmente, também pode ser gerado, mediante cadastro prévio, um arquivo mensal contendo a posição de todos os títulos em carteira no Itaú. Basta solicitar prévio cadastramento. 2.2.2.3 – Ordenação dos registros no arquivo retorno Os registros estão listados em ordem crescente de agência / conta corrente / carteira de cobrança e código de ocorrência. JANEIRO 2017 Cobrança CNAB 400 6 3. Layout do Arquivo 3.1 – Arquivo Remessa ARQUIVO REMESSA REGISTRO HEADER DE ARQUIVO TAMANHO DO REGISTRO = 400 Bytes NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO HEADER OPERAÇÃO TIPO DE OPERAÇÃO - REMESSA 001 001 9(01) 002 002 9(01) 0 1 LITERAL DE REMESSA IDENTIFICAÇÃO POR EXTENSO DO MOVIMENTO 003 009 X(07) REMESSA CÓDIGO DO SERVIÇO IDENTIFICAÇÃO DO TIPO DE SERVIÇO 010 011 9(02) 01 LITERAL DE SERVIÇO IDENTIFICAÇÃO POR EXTENSO DO TIPO DE SERVIÇO 012 026 X(15) COBRANCA AGÊNCIA ZEROS CONTA DAC BRANCOS AGÊNCIA MANTENEDORA DA CONTA COMPLEMENTO DE REGISTRO NÚMERO DA CONTA CORRENTE DA EMPRESA DÍGITO DE AUTO CONFERÊNCIA AG/CONTA EMPRESA COMPLEMENTO DO REGISTRO NOME DA EMPRESA NOME POR EXTENSO DA \"EMPRESA MÃE\" 00 027 030 031 032 033 037 038 038 9(04) 9(02) 9(05) 9(01) 039 046 X(08) 047 076 X(30) CÓDIGO DO BANCO Nº DO BANCO NA CÂMARA DE COMPENSAÇÃO 077 079 9(03) 341 NOME DO BANCO NOME POR EXTENSO DO BANCO COBRADOR DATA DE GERAÇÃO DATA DE GERAÇÃO DO ARQUIVO 080 094 X(15) BANCO ITAU SA 095 100 9(06) DDMMAA BRANCOS COMPLEMENTO DO REGISTRO 101 394 X(294) NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 395 400 9(06) 000001 X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA JANEIRO 2017 Cobrança CNAB 400 7 ARQUIVO REMESSA REGISTRO DETALHE (OBRIGATÓRIO) TAMANHO DO REGISTRO = 400 Bytes NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO TRANSAÇÃO 001 001 9(01) 1 CÓDIGO DE INSCRIÇÃO TIPO DE INSCRIÇÃO DA EMPRESA 002 003 9(02) NOTA 1 NÚMERO DE INSCRIÇÃO Nº DE INSCRIÇÃO DA EMPRESA (CPF/CNPJ) 004 017 9(14) NOTA 1 AGÊNCIA ZEROS CONTA DAC BRANCOS AGÊNCIA MANTENEDORA DA CONTA 018 021 9(04) COMPLEMENTO DE REGISTRO 022 023 9(02) “00” NÚMERO DA CONTA CORRENTE DA EMPRESA DÍGITO DE AUTO CONFERÊNCIA AG/CONTA EMPRESA COMPLEMENTO DE REGISTRO 024 028 029 029 030 033 9(05) 9(01) X(04) INSTRUÇÃO/ALEGAÇÃO CÓD.INSTRUÇÃO/ALEGAÇÃO A SER CANCELADA 034 037 9(04) NOTA 27 USO DA EMPRESA IDENTIFICAÇÃO DO TÍTULO NA EMPRESA 038 062 X(25) NOTA 2 NOSSO NÚMERO QTDE DE MOEDA Nº DA CARTEIRA USO DO BANCO CARTEIRA IDENTIFICAÇÃO DO TÍTULO NO BANCO 063 070 9(08) NOTA 3 QUANTIDADE DE MOEDA VARIÁVEL 071 083 9(08)V9(5) NOTA 4 NÚMERO DA CARTEIRA NO BANCO 084 086 9(03) NOTA 5 IDENTIFICAÇÃO DA OPERAÇÃO NO BANCO 087 107 X(21) CÓDIGO DA CARTEIRA 108 108 X(01) NOTA 5 CÓD. DE OCORRÊNCIA IDENTIFICAÇÃO DA OCORRÊNCIA 109 110 9(02) NOTA 6 Nº DO DOCUMENTO Nº DO DOCUMENTO DE COBRANÇA (DUPL.,NP ETC.) 111 120 X(10) NOTA 18 VENCIMENTO DATA DE VENCIMENTO DO TÍTULO 121 126 9(06) NOTA 7 VALOR DO TÍTULO VALOR NOMINAL DO TÍTULO 127 139 9(11)V9(2) NOTA 8 CÓDIGO DO BANCO Nº DO BANCO NA CÂMARA DE COMPENSAÇÃO 140 142 9(03) 341 AGÊNCIA COBRADORA AGÊNCIA ONDE O TÍTULO SERÁ COBRADO 143 147 9(05) NOTA 9 ESPÉCIE ACEITE ESPÉCIE DO TÍTULO 148 149 X(02) NOTA 10 IDENTIFICAÇÃO DE TÍTULO ACEITO OU NÃO ACEITO 150 150 X(01) A=ACEITE N=NÃO ACEITE DATA DE EMISSÃO DATA DA EMISSÃO DO TÍTULO 151 156 9(06) NOTA 31 INSTRUÇÃO 1 INSTRUÇÃO 2 JUROS DE 1 DIA DESCONTO ATÉ 1ª INSTRUÇÃO DE COBRANÇA 2ª INSTRUÇÃO DE COBRANÇA 157 158 X(02) NOTA 11 159 160 X(02) NOTA 11 VALOR DE MORA POR DIA DE ATRASO 161 173 9(11)V9(2) NOTA 12 DATA LIMITE PARA CONCESSÃO DE DESCONTO 174 179 9(06) DDMMAA VALOR DO DESCONTO VALOR DO DESCONTO A SER CONCEDIDO 180 192 9(11)V9(2) NOTA 13 VALOR DO I.O.F. ABATIMENTO VALOR DO I.O.F. RECOLHIDO P/ NOTAS SEGURO 193 205 9(11)V((2) NOTA 14 VALOR DO ABATIMENTO A SER CONCEDIDO 206 218 9(11)V9(2) NOTA 13 CÓDIGO DE INSCRIÇÃO IDENTIFICAÇÃO DO TIPO DE INSCRIÇÃO/PAGADOR 219 220 9(02) 01=CPF 02=CNPJ NÚMERO DE INSCRIÇÃO Nº DE INSCRIÇÃO DO PAGADOR (CPF/CNPJ) 221 234 9(14) NOME BRANCOS NOME DO PAGADOR 235 264 X(30) NOTA 15 COMPLEMENTO DE REGISTRO 265 274 X(10) NOTA 15 LOGRADOURO RUA, NÚMERO E COMPLEMENTO DO PAGADOR BAIRRO CEP CIDADE ESTADO BAIRRO DO PAGADOR CEP DO PAGADOR CIDADE DO PAGADOR UF DO PAGADOR 275 314 315 326 327 334 335 349 350 351 X(40) X(12) 9(08) X(15) X(02) SACADOR/AVALISTA NOME DO SACADOR OU AVALISTA 352 381 X(30) NOTA 16 BRANCOS COMPLEMENTO DO REGISTRO 382 385 X(04) DATA DE MORA DATA DE MORA PRAZO BRANCOS QUANTIDADE DE DIAS COMPLEMENTO DO REGISTRO NÚMERO SEQÜENCIAL Nº SEQÜENCIAL DO REGISTRO NO ARQUIVO 386 391 9(06) DDMMAA 392 393 9(02) NOTA 11 (A) 394 394 395 400 X(01) 9(06) X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA JANEIRO 2017 Cobrança CNAB 400 8 ARQUIVO REMESSA REGISTRO DETALHE TAMANHO DO REGISTRO = 400 BYTES (OPCIONAL – COMPLEMENTO DETALHE - MULTA) NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO TRANSAÇÃO 001 001 9(001) 2 COD. MULTA CODIGO DA MULTA DATA DA MULTA DATA DA MULTA 002 002 X(001) NOTA 35 003 010 9(008) NOTA 35 MULTA BRANCOS VALOR/PERCENTUAL A SER APLICADO 011 023 9(013) NOTA 35 COMPLEMENTO DE REGISTRO 024 394 X(370) NUMERO SEQUENCIAL NUMERO SEQUENCIAL DO REGISTRO NO ARQUIVO 395 400 9(006) X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA Importante   Este registro 2 é Opcional e deverá ser enviado apenas quando o beneficiário desejar registrar ou alterar valores/percentuais de multas diferentes para o título. Válido somente para Carteiras com Registro, pode ser utilizado a qualquer momento sem necessidade de cadastro prévio junto ao Itaú. Sempre que o registro 2 for informado, deverá seguir a sequência lógica de registro de cobrança (Ex. Código de Registro tipo “1” – obrigatório e assim por diante);  O registro tipo 2 não será devolvido no arquivo retorno. Qualquer erro sobre o registro tipo 2 será gerado no retorno do registro tipo 1.  Não pode ser enviado mais de um tipo de registro 2 para o mesmo boleto. Se isso ocorrer o cliente receberá o registro tipo 1 com erro - Registro Inválido  Qualquer erro encontrado no registro tipo 2 será retornado para o cliente com erro no registro tipo 1. Registro inválido. JANEIRO 2017 Cobrança CNAB 400 9 ARQUIVO REMESSA REGISTRO DETALHE TAMANHO DO REGISTRO = 400 Bytes (OPCIONAL – RATEIO DE CRÉDITO) NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO CÓDIGO DE INSCRIÇÃO NÚMERO DE INSCRIÇÃO AGÊNCIA ZEROS CONTA DAC IDENTIFICAÇÃO DO REGISTRO TRANSAÇÃO TIPO DE INSCRIÇÃO DA EMPRESA Nº DE INSCRIÇÃO DA EMPRESA (CPF/CNPJ) AGÊNCIA MANTENEDORA DA CONTA COMPLEMENTO DE REGISTRO NÚMERO DA CONTA CORRENTE DA EMPRESA DÍGITO DE AUTO CONFERÊNCIA AG/CONTA EMPRESA Nº DA CARTEIRA NOSSO NÚMERO NÚMERO DA CARTEIRA NO BANCO IDENTIFICAÇÃO DO TÍTULO NO BANCO DAC NOSSO NÚMERO DAC DO NOSSO NÚMERO 001 001 9(01) 4 002 003 004 017 018 021 9(02) 9(14) 9(04) NOTA 1 NOTA 1 022 023 9(02) “00” 024 028 029 029 030 032 9(05) 9(01) 9(03) NOTA 5 033 040 9(08) NOTA 3 NOTA 3 041 041 042 043 044 047 048 054 055 055 9(01) 9(02) 9(04) 9(07) 9(01) SEQÜÊNCIA AGÊNCIA (01) CONTA (01) DAC (01) VALOR (01) AGÊNCIA (02) CONTA (02) DAC (02) VALOR (02) AGÊNCIA (03) CONTA (03) DAC (03) VALOR (03) AGÊNCIA (04) CONTA (04) DAC (04) VALOR (04) AGÊNCIA (05) CONTA (05) DAC (05) VALOR (05) AGÊNCIA (06) CONTA (06) DAC (06) VALOR (06) AGÊNCIA (07) CONTA (07) DAC (07) VALOR (07) AGÊNCIA (08) CONTA (08) DAC (08) VALOR (08) AGÊNCIA (09) CONTA (09) DAC (09) VALOR (09) AGÊNCIA (10) CONTA (10) DAC (10) NÚMERO SEQÜENCIAL DOS REGISTROS TIPO 4 DO TÍTULO NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO VALOR DE CRÉDITO 056 068 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 069 072 073 079 080 080 9(04) 9(07) 9(01) VALOR DE CRÉDITO 081 093 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 094 097 098 104 105 105 9(04) 9(07) 9(01) VALOR DE CRÉDITO 106 118 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 119 122 123 129 130 130 9(04) 9(07) 9(01) VALOR DE CRÉDITO 131 143 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 144 147 148 154 155 155 9(04) 9(07) 9(01) VALOR DE CRÉDITO 156 168 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 169 172 173 179 180 180 9(04) 9(07) 9(01) VALOR DE CRÉDITO 181 193 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 194 197 198 204 205 205 9(04) 9(07) 9(01) VALOR DE CRÉDITO 206 218 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 219 222 223 229 230 230 9(04) 9(07) 9(01) VALOR DE CRÉDITO 231 243 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 244 247 248 254 255 255 9(04) 9(07) 9(01) VALOR DE CRÉDITO 256 268 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 269 272 273 279 280 280 9(04) 9(07) 9(01) JANEIRO 2017 Cobrança CNAB 400 10 VALOR (10) AGÊNCIA (11) CONTA (11) DAC (11) VALOR (11) AGÊNCIA (12) CONTA (12) DAC (12) VALOR (12) AGÊNCIA (13) CONTA (13) DAC (13) VALOR (13) AGÊNCIA (14) CONTA (14) DAC (14) VALOR (14) TIPO DE VALOR VALOR DE CRÉDITO 281 293 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 294 297 298 304 305 305 9(04) 9(07) 9(01) VALOR DE CRÉDITO 306 318 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 319 322 323 329 330 330 9(04) 9(07) 9(01) VALOR DE CRÉDITO 331 343 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 344 347 348 354 355 355 9(04) 9(07) 9(01) VALOR DE CRÉDITO 356 368 9(11)V9(2) NOTA 32 NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO NÚMERO DA CONTA PARA CRÉDITO DIGITO DE AUTO-CONFERÊNCIA AG/CONTA CRÉDITO 369 372 373 379 380 380 9(04) 9(07) 9(01) VALOR DE CRÉDITO TIPO DE VALOR INFORMADO 381 393 9(11)V9(2) NOTA 32 394 394 395 400 9(01) 9(06) NOTA 32 NÚMERO SEQUENCIAL NÚMERO SEQUENCIAL DO REGISTRO NO ARQUIVO X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA IMPORTANTE:  O arquivo pode conter tanto títulos de cobrança normal como títulos de cobrança com rateio de crédito;  Para instruções de protesto, os títulos com rateio de crédito seguem os mesmos procedimentos dos títulos sem rateio;  O rateio de crédito pode ser por percentual ou em valor (vide Nota 32);  Títulos com rateio de crédito – Para cada Registro Detalhe Obrigatório (Tipo de Registro “1”) podem ser utilizados até 3 (três) Registros Tipo “4” para indicação dos detalhes do rateio de crédito (máximo de 30 contas por título). Caso a Agência/Conta/Dac do beneficiário e Nº da Carteira/Nosso Número do título, informados nos registros Tipo “4” não coincidam com os dados do respectivo registro Tipo “1”, a entrada do título é aceita sem rateio de crédito (os registros Tipo “4” são desprezados);  A entrada do título é rejeitada nos casos em que a soma dos valores ou percentuais de rateio (informados nos registros Tipo “4”) ultrapasse o valor nominal do título do registro Tipo “1”;  Caso os registros de rateio (Tipo “4”) não apresentem agências/contas de crédito, os registros Tipo 4 são desprezados e o boleto será tratado como entrada de cobrança normal, sem rateio;  A agência/conta do beneficiário e sua respectiva agência/conta centralizadora de crédito da cobrança, não podem estar entre as agências/contas beneficiárias do rateio de crédito;  Boletos com rateio de crédito não aceitam instruções de Desconto ou de Abatimento e não permitem alteração dos valores nominal e de crédito;  Não haverá incidência de CPMF quando a raiz do CPNJ da conta do beneficiário for igual a da conta de crédito do rateio. JANEIRO 2017 Cobrança CNAB 400 11 NOTA 29 NOTA 30 NOTA 30 NOTA 30 NOTA 30 NOTA 30 NOTA 30 NOTA 30 138 177 X(040) 178 189 X(012) 190 197 9(008) 198 212 X(015) 213 214 X(002) ARQUIVO REMESSA REGISTRO DETALHE TAMANHO DO REGISTRO = 400 BYTES (OPCIONAL – COBRANÇA E-MAIL E/OU DADOS DOSACADOR AVALISTA) NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO TRANSAÇÃO 001 001 9(001) 5 ENDEREÇO DE E-MAIL ENDEREÇO DE E-MAIL DO PAGADOR 002 121 X(120) CÓDIGO DE INSCRIÇÃO IDENT. DO TIPO DE INSCRIÇÃO DO SACADOR/AVALISTA 122 123 9(002) NÚMERO DE INSCRIÇÃO NÚMERO DE INSCRIÇÃO DO SACADOR AVALISTA 124 137 9(014) LOGRADOURO RUA, Nº E COMPLEMENTO DO SACADOR AVALISTA BAIRRO CEP CIDADE ESTADO BRANCOS BAIRRO DO SACADOR AVALISTA CEP DO SACADOR AVALISTA CIDADE DO SACADOR AVALISTA UF (ESTADO) DO SACADOR AVALISTA COMPLEMENTO DE REGISTRO 215 394 X(180) BRANCOS NÚMERO SEQUENCIAL NÚMERO SEQUENCIAL DO REGISTRO NO ARQUIVO 395 400 9(006) X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA IMPORTANTE: Este registro é opcional e deverá ser enviado apenas quando o beneficiário desejar que o boleto de cobrança seja entregue pelo Itaú ao pagador por e-mail ou complemento dos dados referentes ao Sacador/Avalista, quando de sua existência; e     Sempre que for informado, deverá ser na sequência do registro obrigatório de cobrança (Código de Registro ‘1’) a que seus dados se referem; As informações constantes neste registro não são informadas no “arquivo retorno”; Quando as informações referentes ao \"Sacador / Avalista\" tiverem sido indicadas nos registros “1” e “5”, prevalecerá sempre a do registro “5\"; Na fase de testes não é possível o envio do boleto via e-mail, para tanto, este será emitido e consistido fisicamente. ARQUIVO REMESSA REGISTRO TRAILER DE ARQUIVO TAMANHO DO REGISTRO = 400 BYTES NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO TRAILER 001 001 9(01) 9 BRANCOS COMPLEMENTO DO REGISTRO NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 002 394 X(393) 395 400 9(06) X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA JANEIRO 2017 Cobrança CNAB 400 12 3.2 – Arquivo Retorno ARQUIVO RETORNO REGISTRO HEADER DE ARQUIVO TAMANHO DO REGISTRO = 400 BYTES NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO HEADER CÓDIGO DE RETORNO IDENTIFICAÇÃO DO ARQUIVO RETORNO 001 001 9(01) 002 002 9(01) 0 2 LITERAL DE RETORNO IDENTIFICAÇÃO. POR EXTENSO DO TIPO DE MOVIMENTO 003 009 X(07) RETORNO CÓDIGO DO SERVIÇO IDENTIFICAÇÃO DO TIPO DE SERVIÇO 010 011 9(02) 01 LITERAL DE SERVIÇO IDENTIFICAÇÃO POR EXTENSO DO TIPO DE SERVIÇO 012 026 X(15) COBRANCA AGÊNCIA ZEROS CONTA DAC BRANCOS AGÊNCIA MANTENEDORA DA CONTA 027 030 9(04) COMPLEMENTO DE REGISTRO 031 032 9(02) “00” NÚMERO DA CONTA CORRENTE DA EMPRESA DÍGITO DE AUTO CONFERÊNCIA AG/CONTA EMPRESA COMPLEMENTO DO REGISTRO 033 037 038 038 9(05) 9(01) 039 046 X(08) 047 076 X(30) NOME DA EMPRESA NOME POR EXTENSO DA \"EMPRESA MÃE” CÓDIGO DO BANCO NÚMERO DO BANCO NA CÂMARA DE COMPENSAÇÃO 077 079 9(03) 341 NOME DO BANCO NOME POR EXTENSO DO BANCO COBRADOR 080 094 X(15) BANCO ITAU SA DATA DE GERAÇÃO DATA DE GERAÇÃO DO ARQUIVO 095 100 9(06) DDMMAA DENSIDADE UNIDADE DA DENSIDADE 101 105 9(05) UNIDADE DE DENSID. DENSIDADE DE GRAVAÇÃO DO ARQUIVO 106 108 X(03) BPI Nº SEQ. ARQUIVO RET. NÚMERO SEQÜENCIAL DO ARQUIVO RETORNO 109 113 9(05) DATA DE CRÉDITO DATA DE CRÉDITO DOS LANÇAMENTOS 114 119 9(06) DDMMAA BRANCOS COMPLEMENTO DO REGISTRO 120 394 X(275) NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 395 400 9(06) 000001 X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA JANEIRO 2017 Cobrança CNAB 400 13 ARQUIVO RETORNO REGISTRO DETALHE DE ARQUIVO TAMANHO DO REGISTRO = 400 BYTES NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO CÓDIGO DE INSCRIÇÃO NÚMERO DE INSCRIÇÃO AGÊNCIA ZEROS CONTA DAC BRANCOS USO DA EMPRESA NOSSO NÚMERO BRANCOS CARTEIRA IDENTIFICAÇÃO DO REGISTRO TRANSAÇÃO 001 001 9(01) 1 IDENTIFICAÇÃO DO TIPO DE INSCRIÇÃO/EMPRESA NÚMERO DE INSCRIÇÃO DA EMPRESA (CPF/CNPJ) AGÊNCIA MANTENEDORA DA CONTA COMPLEMENTO DE REGISTRO NÚMERO DA CONTA CORRENTE DA EMPRESA DÍGITO DE AUTO CONFERÊNCIA AG/CONTA EMPRESA COMPLEMENTO DE REGISTRO 002 003 004 017 018 021 9(02) 9(14) 9(04) 01=CPF 02=CNPJ 022 023 9(02) “00” 024 028 029 029 030 037 9(05) 9(01) X(08) IDENTIFICAÇÃO DO TÍTULO NA EMPRESA 038 062 X(25) NOTA 2 IDENTIFICAÇÃO DO TÍTULO NO BANCO COMPLEMENTO DO REGISTRO NUMERO DA CARTEIRA 063 070 9(08) 071 082 X(12) 083 085 9(03) NOTA 5 NOSSO NÚMERO IDENTIFICAÇÃO DO TÍTULO NO BANCO 086 093 9(08) NOTA 3 DAC NOSSO NÚMERO DAC DO NOSSO NÚMERO BRANCOS CARTEIRA CÓD. DE OCORRÊNCIA DATA DE OCORRÊNCIA COMPLEMENTO DO REGISTRO CÓDIGO DA CARTEIRA IDENTIFICAÇÃO DA OCORRÊNCIA DATA DE OCORRÊNCIA NO BANCO 094 094 9(01) NOTA 3 095 107 X(13) 108 108 X(01) NOTA 5 109 110 9(02) NOTA 17 111 116 9(06) DDMMAA Nº DO DOCUMENTO Nº DO DOCUMENTO DE COBRANÇA (DUPL, NP ETC) 117 126 X(10) NOTA 18 NOSSO NÚMERO BRANCOS VENCIMENTO VALOR DO TÍTULO CONFIRMAÇÃO DO NÚMERO DO TÍTULO NO BANCO COMPLEMENTO DO REGISTRO DATA DE VENCIMENTO DO TÍTULO VALOR NOMINAL DO TÍTULO 127 134 135 146 9(08) X(12) 147 152 9(06) DDMMAA 153 165 9(11)V9(2) CÓDIGO DO BANCO NÚMERO DO BANCO NA CÂMARA DE COMPENSAÇÃO 166 168 9(03) AGÊNCIA COBRADORA DAC AG. COBRADORA AG. COBRADORA, AG. DE LIQUIDAÇÃO OU BAIXA 169 172 9(04) NOTA 9 DAC DA AGÊNCIA COBRADORA 173 173 9(01) ESPÉCIE ESPÉCIE DO TÍTULO 174 175 9(02) NOTA 10 TARIFA DE COBRANÇA VALOR DA DESPESA DE COBRANÇA COMPLEMENTO DO REGISTRO 176 188 9(11)V9(2) 189 214 X(26) VALOR DO IOF A SER RECOLHIDO (NOTAS SEGURO) 215 227 9(11)V9(2) BRANCOS VALOR DO IOF VALOR ABATIMENTO DESCONTOS VALOR PRINCIPAL BOLETO DDA BRANCOS DATA CRÉDITO VALOR DO ABATIMENTO CONCEDIDO VALOR DO DESCONTO CONCEDIDO VALOR LANÇADO EM CONTA CORRENTE JUROS DE MORA/MULTA VALOR DE MORA E MULTA OUTROS CRÉDITOS VALOR DE OUTROS CRÉDITOS INDICADOR DE BOLETO DDA COMPLEMENTO DO REGISTRO 228 240 9(11)V((2) NOTA 19 241 253 9(11)V9(2) NOTA 19 254 266 9(11)V9(2) 267 279 9(11)V9(2) 280 292 9(11)V9(2) 293 293 X(01) NOTA 34 294 295 X(02) DATA DE CRÉDITO DESTA LIQUIDAÇÃO 296 301 X(06) DDMMAA INSTR.CANCELADA CÓDIGO DA INSTRUÇÃO CANCELADA 302 305 9(04) NOTA 20 BRANCOS ZEROS COMPLEMENTO DE REGISTRO COMPLEMENTO DE REGISTRO NOME DO PAGADOR NOME DO PAGADOR BRANCOS COMPLEMENTO DO REGISTRO 306 311 312 324 325 354 355 377 X(06) 9(13) X(30) X(23) ERROS / MENSAGEM INFORMATIVA REGISTROS REJEITADOS OU ALEGAÇÃO DO PAGADOR OU 378 385 X(08) NOTA 20 REGISTRO DE MENSAGEM INFORMATIVA BRANCOS COMPLEMENTO DO REGISTRO 386 392 X(07) CÓD. DE LIQUIDAÇÃO MEIO PELO QUAL O TÍTULO FOI LIQUIDADO 393 394 X(02) NOTA 28 NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 395 400 9(06) X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA JANEIRO 2017 Cobrança CNAB 400 14 ARQUIVO RETORNO NOME DO CAMPO REGISTRO TRANSAÇÃO OPCIONAL – (CHEQUE DEVOLVIDO / CHEQUE COMPENSADO) TAMANHO DO REGISTRO = 400 Bytes SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO TRANSAÇÃO 001 001 9(01) 1 CÓDIGO DE INSCRIÇÃO IDENTIFICAÇÃO DO TIPO DE INSCRIÇÃO/EMPRESA NÚMERO DE INSCRIÇÃO NÚMERO DE INSCRIÇÃO DA EMPRESA (CPF/CNPJ) AGÊNCIA MANTENEDORA DA CONTA 002 003 004 017 018 021 9(02) 9(14) 9(04) 01=CPF 02=CNPJ AGÊNCIA ZEROS CONTA DAC BRANCOS USO DA EMPRESA NOSSO NÚMERO COMPLEMENTO DE REGISTRO 022 023 9(02) “00” NÚMERO DA CONTA CORRENTE DA EMPRESA DÍGITO DE AUTO CONFERÊNCIA AG/CONTA EMPRESA COMPLEMENTO DE REGISTRO 024 028 029 029 030 037 9(05) 9(01) X(08) IDENTIFICAÇÃO DO TÍTULO NA EMPRESA 038 062 X(25) NOTA 2 IDENTIFICAÇÃO DO TÍTULO NO BANCO 063 070 9(08) AGÊNCIA CONTA DO CHEQUE AGÊNCIA CONTA E DAC DE DÉBITO DO CHEQUE 071 082 X(12) NOTA 33 CARTEIRA NOSSO NÚMERO NUMERO DA CARTEIRA 083 085 9(03) NOTA 5 IDENTIFICAÇÃO DO TÍTULO NO BANCO 086 093 9(08) NOTA 3 DAC NOSSO NÚMERO DAC DO NOSSO NÚMERO 094 094 9(01) NOTA 3 BRANCOS CARTEIRA COMPLEMENTO DO REGISTRO 095 107 X(13) CÓDIGO DA CARTEIRA 108 108 X(01) NOTA 5 CÓD. DE OCORRÊNCIA IDENTIFICAÇÃO DA OCORRÊNCIA 109 110 9(02) NOTA 17 DATA DE OCORRÊNCIA DATA DE OCORRÊNCIA NO BANCO 111 116 9(06) DDMMAA Nº DO DOCUMENTO Nº DO DOCUMENTO DE COBRANÇA (DUPL, NP ETC) 117 126 X(10) NOTA 18 NOSSO NÚMERO CONFIRMAÇÃO DO NÚMERO DO TÍTULO NO BANCO 127 134 9(08) BRANCOS ZEROS COMPLEMENTO DO REGISTRO COMPLEMENTO DO REGISTRO VALOR DO TÍTULO VALOR NOMINAL DO TÍTULO 135 146 X(12) 147 152 9(06) 153 165 9(11)V9(2) CÓDIGO DO BANCO NÚMERO DO BANCO NA CÂMARA DE COMPENSAÇÃO 166 168 9(03) AGÊNCIA COBRADORA AG. COBRADORA, AG. DE LIQUIDAÇÃO OU BAIXA 169 172 9(04) NOTA 9 DAC AG. COBRADORA DAC DA AGÊNCIA COBRADORA BRANCOS ZEROS COMPLEMENTO DO REGISTRO COMPLEMENTO DO REGISTRO VALOR DO CHEQUE VALOR DO CHEQUE ZEROS BRANCOS ZEROS COMPLEMENTO DO REGISTRO COMPLEMENTO DO REGISTRO COMPLEMENTO DO REGISTRO BANDA MAGNÉTICA BANDA MAGNÉTICA DO CHEQUE (CMC-7) BRANCOS MOTIVO BRANCOS COMPLEMENTO DO REGISTRO COMPLEMENTO DO REGISTRO NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 173 173 9(01) 174 175 X(02) 176 253 9(78) 254 266 9(11)V9(2) 267 292 9(26) 293 301 302 324 325 354 355 377 X(09) 9(23) X(30) X(23) 380 394 395 400 X(15) 9(06) MOTIVO DE DEVOLUÇÃO DO CHEQUE 378 379 X(02) NOTA 20 X = ALFANUMÉRICO Observações: 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA Registro opcional que apresenta os dados do cheque devolvido e cheque compensado que foi utilizado no pagamento do boleto. Este registro somente constará do arquivo retorno quando contratado o serviço junto ao Itaú e é exclusivo para informação do cheque devolvido (Código de Ocorrência “69” – Nota 17 e Nota 20 - Tabela 9) e cheque compensado (Código de Ocorrência “76” – Nota 17). JANEIRO 2017 Cobrança CNAB 400 15 ARQUIVO RETORNO REGISTRO DETALHE (OPCIONAL) TAMANHO DO REGISTRO = 400 Bytes NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO TRANSAÇÃO 001 001 9(01) 4 CÓDIGO DE INSCRIÇÃO TIPO DE INSCRIÇÃO DA EMPRESA 002 003 9(02) NOTA 1 NÚMERO DE INSCRIÇÃO Nº DE INSCRIÇÃO DA EMPRESA (CPF/CNPJ) 004 017 9(14) NOTA 1 AGÊNCIA ZEROS CONTA DAC BRANCOS USO DA EMPRESA NOSSO NÚMERO BRANCOS Nº DA CARTEIRA NOSSO NÚMERO AGÊNCIA MANTENEDORA DA CONTA 018 021 9(04) COMPLEMENTO DE REGISTRO 022 023 9(02) “00” NÚMERO DA CONTA CORRENTE DA EMPRESA DÍGITO DE AUTO CONFERÊNCIA AG/CONTA EMPRESA COMPLEMENTO DE REGISTRO 024 028 029 029 9(05) 9(01) 030 037 X(08) IDENTIFICAÇÃO DO TÍTULO NA EMPRESA 038 062 X(25) NOTA 2 IDENTIFICAÇÃO DO TÍTULO NO BANCO COMPLEMENTO DO REGISTRO NÚMERO DA CARTEIRA 063 070 9(08) 071 082 X(12) 083 085 9(03) NOTA 5 IDENTIFICAÇÃO DO TÍTULO NO BANCO 086 093 9(08) NOTA 3 DAC NOSSO NÚMERO DAC DO NOSSO NÚMERO 094 094 9(01) NOTA 3 BRANCOS CARTEIRA COMPLEMENTO DO REGISTRO 095 107 X(13) CÓDIGO DA CARTEIRA 108 108 X(01) NOTA 5 CÓD. DE OCORRÊNCIA IDENTIFICAÇÃO DA OCORRÊNCIA 109 110 9(02) NOTA 17 SEQÜÊNCIA NÚMERO SEQÜENCIAL DOS REGISTROS TIPO 4 DO TÍTULO 111 112 9(02) VALOR DO TITULO VALOR TOTAL RECEBIDO LÍQUIDO 113 125 9(11)V9(2) AGENCIA (01) NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO 126 129 9(04) CONTA (01) NÚMERO DA CONTA DE CRÉDITO DAC (01) DAC DA AGENCIA/CONTA DE CRÉDITO 130 136 137 137 9(07) 9(01) VALOR (01) VALOR DE CRÉDITO 138 150 9(11)V9(2) NOTA 32 VALOR ENCARGOS (01) VALOR ENCARGOS DO RATEADO 151 160 9(08)V9(2) AGENCIA (02) NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO 161 164 9(04) CONTA (02) NÚMERO DA CONTA DE CRÉDITO DAC (02) DAC DA AGENCIA/CONTA DE CRÉDITO 165 171 172 172 9(07) 9(01) VALOR (02) VALOR DE CRÉDITO 173 185 9(11)V9(2) NOTA 32 VALOR ENCARGOS (02) VALOR ENCARGOS DO RATEADO 186 195 9(08)V9(2) AGENCIA (03) NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO 196 199 9(04) CONTA (03) NÚMERO DA CONTA DE CRÉDITO DAC (03) DAC DA AGENCIA/CONTA DE CRÉDITO 200 206 207 207 9(07) 9(01) VALOR (03) VALOR DE CRÉDITO 208 220 9(11)V9(2) NOTA 32 VALOR ENCARGOS (03) VALOR ENCARGOS DO RATEADO 221 230 9(08)V9(2) AGENCIA (04) NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO 231 234 9(04) CONTA (04) NÚMERO DA CONTA DE CRÉDITO DAC (04) DAC DA AGENCIA/CONTA DE CRÉDITO 235 241 242 242 9(07) 9(01) VALOR (04) VALOR DE CRÉDITO 243 255 9(11)V9(2) NOTA 32 VALOR ENCARGOS (04) VALOR ENCARGOS DO RATEADO 256 265 9(08)V9(2) AGENCIA (05) NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO 266 269 9(04) CONTA (05) NÚMERO DA CONTA DE CRÉDITO DAC (05) DAC DA AGENCIA/CONTA DE CRÉDITO 270 276 277 277 9(07) 9(01) VALOR (05) VALOR DE CRÉDITO 278 290 9(11)V9(2) NOTA 32 VALOR ENCARGOS (05) VALOR ENCARGOS DO RATEADO 291 300 9(08)V9(2) JANEIRO 2017 Cobrança CNAB 400 16 AGENCIA (06) NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO CONTA (06) NÚMERO DA CONTA DE CRÉDITO DAC (06) DAC DA AGENCIA/CONTA DE CRÉDITO 301 304 305 311 312 312 9(04) 9(07) 9(01) VALOR (06) VALOR DE CRÉDITO 313 325 9(11)V9(2) NOTA 32 VALOR ENCARGOS (06) VALOR ENCARGOS DO RATEADO 326 335 9(08)V9(2) AGENCIA (07) NÚMERO DA AGÊNCIA DA CONTA DE CRÉDITO CONTA (07) NÚMERO DA CONTA DE CRÉDITO DAC (07) DAC DA AGENCIA/CONTA DE CRÉDITO 336 339 340 346 347 347 9(04) 9(07) 9(01) VALOR (07) VALOR DE CRÉDITO 348 360 9(11)V9(2) NOTA 32 VALOR ENCARGOS (07) VALOR ENCARGOS DO RATEADO BRANCOS COMPLEMENTO DE REGISTRO 361 370 9(08)V9(2) 371 393 X(23) TIPO DE VALOR TIPO DE VALOR DE RATEIO ENVIADO 394 394 X(01) NOTA 32 NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 395 400 9(06) X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA ARQUIVO RETORNO REGISTRO TRAILER TAMANHO DO REGISTRO = 400 Bytes NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO TRAILER CÓDIGO DE RETORNO IDENTIFICAÇÃO DE ARQUIVO RETORNO 001 001 9(01) 002 002 9(01) 9 2 CÓDIGO DE SERVIÇO IDENTIFICAÇÃO DO TIPO DE SERVIÇO 003 004 9(02) 01 CÓDIGO DO BANCO IDENTIFICAÇÃO DO BANCO NA COMPENSAÇÃO 005 007 9(03) 341 BRANCOS COMPLEMENTO DE REGISTRO 008 017 X(10) QTDE. DE TÍTULOS QTDE. DE TÍTULOS EM COBR. SIMPLES 018 025 9(08) NOTA 21 VALOR TOTAL AVISO BANCÁRIO BRANCOS QTDE. DE TÍTULOS VALOR TOTAL AVISO BANCÁRIO BRANCOS QTDE. DE TÍTULOS VALOR TOTAL AVISO BANCÁRIO VR TOTAL DOS TÍTULOS EM COBRANÇA SIMPLES 026 039 9(12)V9(2) NOTA 21 REFERÊNCIA DO AVISO BANCÁRIO 040 047 X(08) NOTA 22 COMPLEMENTO DO REGISTRO 048 057 X(10) QTDE DE TÍTULOS EM COBRANÇA/VINCULADA 058 065 9(08) NOTA 21 VR TOTAL DOS TÍTULOS EM COBRANÇA/VINCULADA 066 079 9(12)V9(2) NOTA 21 REFERÊNCIA DO AVISO BANCÁRIO COMPLEMENTO DO REGISTRO 080 087 X(08) NOTA 22 088 177 X(90) QTDE. DE TÍTULOS EM COBR. DIRETA./ESCRITURAL 178 185 9(08) NOTA 21 VR TOTAL DOS TÍTULOS EM COBR. DIRETA/ESCRIT. 186 199 9(12)V9(2) NOTA 21 REFERÊNCIA DO AVISO BANCÁRIO 200 207 X(08) NOTA 22 CONTROLE DO ARQUIVO NÚMERO SEQÜENCIAL DO ARQUIVO RETORNO 208 212 9(05) QTDE DE DETALHES QUANTIDADE DE REGISTROS DE TRANSAÇÃO 213 220 9(08) VLR TOTAL INFORMADO VALOR DOS TÍTULOS INFORMADOS NO ARQUIVO 221 234 9(12)V9(2) BRANCOS COMPLEMENTO DO REGISTRO 235 394 X(160) NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 395 400 9(06) X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA JANEIRO 2017 Cobrança CNAB 400 17 4. Notas (1) TIPO/Nº DE INSCRIÇÃO DA EMPRESA/SACADOR TIPO INSCRIÇÃO 01 02 03 04 NÚMERO DE INSCRIÇÃO Nº DO CPF DO BENEFICIÁRIO Nº DO CNPJ DO BENEFICIÁRIO CPF DO SACADOR CNPJ DO SACADOR Normalmente definem o tipo (CPF/CNPJ) e o número de inscrição do beneficiário. Se o título for negociado, deverão ser utilizados para indicar o CNPJ/CPF do sacador (beneficiário original), uma vez que os cartórios exigem essa informação para efetivação dos protestos. Para este fim, também poderá ser utilizado o registro tipo “5”. (2) USO DA EMPRESA Campo não obrigatório, de livre utilização pela empresa, cuja informação não é consistida pelo Itaú, e não sai no aviso de cobrança, retornando ao beneficiário no arquivo retorno em qualquer movimento do título (baixa, liquidação, confirmação de protesto, etc.) com o mesmo conteúdo da entrada. (3) NOSSO NÚMERO Para carteiras com registro:  Escriturais: é enviado zerado pela empresa e retornado pelo Itaú na confirmação do registro, com exceção da carteira 115 cuja faixa de Nosso Número é de livre utilização pelo beneficiário;  Diretas: é de livre utilização pelo beneficiário, não podendo ser repetida se o número ainda estiver registrado no Itaú ou se transcorridos menos de 45 dias de sua baixa / liquidação. Dependendo da carteira de cobrança utilizada a faixa de Nosso Número pode ser definida pelo Banco.  Para todas as movimentações envolvendo o boleto o “Nosso Número” deve ser informado. (4) QUANTIDADE DE MOEDA VARIÁVEL Este campo deverá ser preenchido com zeros caso a moeda seja o Real. (5) CARTEIRAS DE COBRANÇA OBS CÓD. TIPO(*) CARTEIRAS DESCRIÇÃO D,E E E D F I I I U I 1 I I E I I D D D D D E E E E E 108 DIRETA ELETRÔNICA EMISSÃO INTEGRAL – CARNÊ 180 121 150 109 191 104 188 147 112 115 DIRETA ELETRÔNICA EMISSÃO INTEGRAL – SIMPLES DIRETA ELETRÔNICA EMISSÃO PARCIAL – SIMPLES DIRETA ELETRÔNICA SEM EMISSÃO – DÓLAR DIRETA ELETRÔNICA SEM EMISSÃO – SIMPLES DUPLICATAS - TRANSFERÊNCIA DE DESCONTO ESCRITURAL ELETRÔNICA – CARNÊ ESCRITURAL ELETRÔNICA - COBRANÇA INTELIGENTE (B2B) ESCRITURAL ELETRÔNICA – DÓLAR ESCRITURAL ELETRÔNICA – SIMPLES ESCRITURAL ELETRÔNICA – SIMPLES – FAIXA NOSSO NÚMERO LIVRE (*) A coluna 'TIPO' define a modalidade das carteiras: E – Escritural / D – Direta. (A) No arquivo retorno é informado somente: agência, conta corrente, carteira, nosso número, data do pagamento, multa, desconto/abatimento, tarifa, valor líquido. (B) No arquivo retorno é informado somente: agência, conta corrente, carteira, nosso número, data do pagamento, multa, desconto/abatimento, tarifa, valor líquido e seu número. (C) Para carteiras com impressão de carnês pelo Itaú, o arquivo remessa deverá ser ordenado por PAGADOR e vencimento. A cada alteração no nome do pagador será emitido um carnê (limitado a 99 parcelas), obedecendo a ordem do arquivo remessa. Quando a quantidade de parcelas de um carnê for superior a “99”, é necessária a emissão de mais de um carnê. (D) Somente utilizar nosso número dentro de faixa numérica definida pelo Itaú. (F) Carteiras com retenção de IOF e uso exclusivo de seguradoras. JANEIRO 2017 Cobrança CNAB 400 18 (6) CÓDIGO DE OCORRÊNCIA (ARQUIVO REMESSA) OBS CÓD. OCORRÊNCIA 01 02 04 05 06 07 REMESSA PEDIDO DE BAIXA CONCESSÃO DE ABATIMENTO (INDICADOR 12.5) CANCELAMENTO DE ABATIMENTO ALTERAÇÃO DO VENCIMENTO ALTERAÇÃO DO USO DA EMPRESA 08 ALTERAÇÃO DO SEU NÚMERO 09 10 11 18 30 31 PROTESTAR NÃO PROTESTAR PROTESTO PARA FINS FALIMENTARES SUSTAR O PROTESTO EXCLUSÃO DE SACADOR AVALISTA ALTERAÇÃO DE OUTROS DADOS A A,D A,D A,D A,D A,D A,C A,D A,C A,F B,D B,D A 34 BAIXA POR TER SIDO PAGO DIRETAMENTE AO BENEFICIÁRIO CANCELAMENTO DE INSTRUÇÃO ALTERAÇÃO DO VENCIMENTO E SUSTAR PROTESTO CAMPOS NECESSÁRIOS TODOS OS CAMPOS VALOR DO ABATIMENTO VALOR DO ABATIMENTO VENCIMENTO USO DA EMPRESA SEU NÚMERO CAMPOS A ALTERAR CÓDIGO DA INSTRUÇÃO VENCIMENTO B,G A A,E A,D B,D B,C B,D B,F B H 35 37 38 47 49 66 67 68 69 93 BENEFICIÁRIO NÃO CONCORDA COM ALEGAÇÃO DO PAGADOR CÓDIGO DA ALEGAÇÃO BENEFICIÁRIO SOLICITA DISPENSA DE JUROS ALTERAÇÃO DE DADOS EXTRAS (REGISTRO DE MULTA) ENTRADA EM NEGATIVAÇÃO EXPRESSA NÃO NEGATIVAR (INIBE A ENTRADA EM NEGATIVAÇÃO EXPRESSA) EXCLUIR NEGATIVAÇÃO EXPRESSA (ATÉ 15 DIAS CORRIDOS APÓS A ENTRADA EM NEGATIVAÇÃO EXPRESSA) CANCELAR NEGATIVAÇÃO EXPRESSA (APÓS TÍTULO TER SIDO NEGATIVADO) DESCONTAR TÍTULOS ENCAMINHADOS NO DIA (A) São obrigatórios os seguintes campos, além dos indicados na tabela:  Tipo de Registro  Agência/Conta/Dac da Empresa  Nosso Número  Número da Carteira  Código da Carteira  Valor do Título Os demais campos devem ser preenchidos com zeros ou brancos, obedecendo a sua picture. (B) São obrigatórios os seguintes campos, além dos indicados na tabela:  Tipo de Registro  Agência/Conta/Dac da Empresa  Nosso Número  Número da Carteira  Código da Carteira Os campos sem alteração devem ser preenchidos com zeros ou brancos, obedecendo a sua picture. A alteração do valor do boleto deverá ser feita isoladamente, sem nenhuma outra alteração no mesmo registro. (C) Utilizada para agendar uma negativação ou protesto futuro sendo que o prazo de início de protesto deverá ser indicado nas posições 392 à 393, a partir do vencimento. Caso seja informado '00' no campo prazo, o processo de protesto será acionado 02 dias (corridos) após o vencimento. No caso da ocorrência “11”, o beneficiário passa a ter prioridade no recebimento quando o pagador estiver com falência decretada. (D) Somente são aceitas antes de iniciar o processo de negativação ou protesto. Se a negativação ou o protesto já estiver em andamento, deve-se primeiro excluir a entrada em negativação expressa ou sustar o protesto e em seguida comandar a instrução desejada (a exclusão, a sustação e a instrução podem constar no mesmo arquivo). A instrução de baixa envia a exclusão ou cancelamento da negativação expressa ou susta automaticamente o protesto e o título é baixado. (E) O código da alegação do pagador deverá ser informado nas posições 34 a 37 do registro de transação conforme nota 20, tabela 6, campo CÓD. (F) Deve ser utilizada também quando se deseja cancelar uma instrução de negativação expressa ou protesto comandada no registro de entrada, mesmo que o título ainda não tenha sido protestado. JANEIRO 2017 Cobrança CNAB 400 19 (G) O código da instrução a ser cancelada (1156 – Não Protestar ou 2261 – Dispensar juros/comissão de permanência) deverá ser informado nas posições 34 a 37 do registro de transação. (H) Utilizada para indicar títulos encaminhados no dia e que passarão pelo qualificador de crédito e que dependendo da qualificação, poderão ser descontados no próprio dia da remessa do arquivo. (7) VENCIMENTO Conforme determinado pelo Banco Central do Brasil na circular 3.656 e 02/04/2013, todo boleto deve possuir vencimento, não sendo permitido vencimento “à vista” ou “na apresentação”. Não é mais permitido vencimento “9999999”, onde era até então impresso “À VISTA”. (8) VALOR DO BOLETO O boleto deverá ter seu valor expresso em reais na data de entrada, mesmo quando cobrado em moeda variável. ATENÇÃO: Conforme determinado pelo Banco Central do Brasil na circular 3.656 e 02/04/2013, todo boleto deve possuir o valor expresso, não sendo permitido valor em branco ou zerado. (9) AGÊNCIA COBRADORA No arquivo remessa, preencher com zeros. O Itaú define a agência cobradora pelo CEP do pagador. No arquivo retorno, poderá conter: AGÊNCIA SIGNIFICADO 7744 PEDIDO DE BAIXA EFETUADO PELO BENEFICIÁRIO 7788 7777 9999 BAIXA AUTOMÁTICA DECORRENTE DE: INSTRUÇÃO CADASTRADA A NÍVEL CONTA CORRENTE, INSTRUÇÃO COMANDADA NO REGISTRO DE ENTRADA OU PELO PADRÃO DO ITAÚ (120 DIAS APÓS O VENCIMENTO DO TÍTULO) BAIXA SOLICITADA VIA BANKLINE OU PELA AGÊNCIA VIA ESTAÇÃO ADMINISTRATIVA O ITAÚ NÃO POSSUI AGÊNCIA PARA O CEP INDICADO OUTROS Nº DA AGÊNCIA / ÓRGÃO QUE EFETUARÁ A COBRANÇA OU QUE EXECUTOU A BAIXA / LIQUIDAÇÃO (10) ESPÉCIE COD. ESPÉCIE COD. ESPÉCIE 01 02 03 04 05 06 07 08 DUPLICATA MERCANTIL NOTA PROMISSÓRIA NOTA DE SEGURO MENSALIDADE ESCOLAR RECIBO CONTRATO COSSEGUROS DUPLICATA DE SERVIÇO 09 13 15 16 17 18 99 LETRA DE CÂMBIO NOTA DE DÉBITOS DOCUMENTO DE DÍVIDA ENCARGOS CONDOMINIAIS CONTA DE PRESTAÇÃO DE SERVIÇOS BOLETO DE PROPOSTA* DIVERSOS * O Boleto de Proposta é uma modalidade de boleto utilizada para possibilitar o pagamento decorrente da eventual aceitação de uma oferta de produto ou serviço, de uma proposta de contrato civil ou de um convite para associação. Esta modalidade possui layout especifico para desenvolvimento, que deve ser solicitado ao banco. (11) INSTRUÇÕES DE COBRANÇA OBS IMPRESSÃO NO BOLETO CÓD. INSTRUÇÃO SIM SIM SIM SIM SIM SIM A NÃO 02 03 05 06 07 08 09 DEVOLVER APÓS 05 DIAS DO VENCIMENTO DEVOLVER APÓS 30 DIAS DO VENCIMENTO RECEBER CONFORME INSTRUÇÕES NO PRÓPRIO TÍTULO DEVOLVER APÓS 10 DIAS DO VENCIMENTO DEVOLVER APÓS 15 DIAS DO VENCIMENTO DEVOLVER APÓS 20 DIAS DO VENCIMENTO PROTESTAR JANEIRO 2017 Cobrança CNAB 400 20 G NÃO SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM NÃO SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM E I A, H A, H A A F A 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 37 38 39 40 42 43 44 45 46 47 51 52 53 54 56 57 58 59 61 62 66 NÃO PROTESTAR (inibe protesto, quando houver instrução permanente na conta corrente) DEVOLVER APÓS 25 DIAS DO VENCIMENTO DEVOLVER APÓS 35 DIAS DO VENCIMENTO DEVOLVER APÓS 40 DIAS DO VENCIMENTO DEVOLVER APÓS 45 DIAS DO VENCIMENTO DEVOLVER APÓS 50 DIAS DO VENCIMENTO DEVOLVER APÓS 55 DIAS DO VENCIMENTO DEVOLVER APÓS 60 DIAS DO VENCIMENTO DEVOLVER APÓS 90 DIAS DO VENCIMENTO NÃO RECEBER APÓS 05 DIAS DO VENCIMENTO NÃO RECEBER APÓS 10 DIAS DO VENCIMENTO NÃO RECEBER APÓS 15 DIAS DO VENCIMENTO NÃO RECEBER APÓS 20 DIAS DO VENCIMENTO NÃO RECEBER APÓS 25 DIAS DO VENCIMENTO NÃO RECEBER APÓS 30 DIAS DO VENCIMENTO NÃO RECEBER APÓS 35 DIAS DO VENCIMENTO NÃO RECEBER APÓS 40 DIAS DO VENCIMENTO NÃO RECEBER APÓS 45 DIAS DO VENCIMENTO NÃO RECEBER APÓS 50 DIAS DO VENCIMENTO NÃO RECEBER APÓS 55 DIAS DO VENCIMENTO IMPORTÂNCIA DE DESCONTO POR DIA NÃO RECEBER APÓS 60 DIAS DO VENCIMENTO NÃO RECEBER APÓS 90 DIAS DO VENCIMENTO CONCEDER ABATIMENTO REF. À PIS-PASEP/COFIN/CSSL, MESMO APÓS VENCIMENTO PROTESTAR APÓS XX DIAS CORRIDOS DO VENCIMENTO PROTESTAR APÓS XX DIAS ÚTEIS DO VENCIMENTO RECEBER ATÉ O ÚLTIMO DIA DO MÊS DE VENCIMENTO CONCEDER DESCONTO MESMO APÓS VENCIMENTO NÃO RECEBER APÓS O VENCIMENTO CONCEDER DESCONTO CONFORME NOTA DE CRÉDITO PROTESTO PARA FINS FALIMENTARES SUJEITO A PROTESTO SE NÃO FOR PAGO NO VENCIMENTO IMPORTÂNCIA POR DIA DE ATRASO A PARTIR DE DDMMAA TEM DIA DA GRAÇA USO DO BANCO DISPENSAR JUROS/COMISSÃO DE PERMANÊNCIA RECEBER SOMENTE COM A PARCELA ANTERIOR QUITADA EFETUAR O PAGAMENTO SOMENTE ATRAVÉS DESTE BOLETO E NA REDE BANCÁRIA USO DO BANCO APÓS VENCIMENTO PAGÁVEL SOMENTE NA EMPRESA USO DO BANCO SOMAR VALOR DO TÍTULO AO VALOR DO CAMPO MORA/MULTA CASO EXISTA DEVOLVER APÓS 365 DIAS DE VENCIDO COBRANÇA NEGOCIADA. PAGÁVEL SOMENTE POR ESTE BOLETO NA REDE BANCÁRIA TÍTULO ENTREGUE EM PENHOR EM FAVOR DO BENEFICIÁRIO ACIMA TÍTULO TRANSFERIDO A FAVOR DO BENEFICIÁRIO ENTRADA EM NEGATIVAÇÃO EXPRESSA (IMPRIME: SUJEITO A NEGATIVAÇÃO APÓS O VENCIMENTO) A,G NÃO 67 NÃO NEGATIVAR (INIBE A ENTRADA EM NEGATIVAÇÃO EXPRESSA) SIM SIM SIM SIM 70 A 75 USO DO BANCO 78 79 80 VALOR DA IDA ENGLOBA MULTA DE 10% PRO RATA COBRAR JUROS APÓS 15 DIAS DA EMISSÃO (para títulos com vencimento à vista) PAGAMENTO EM CHEQUE: SOMENTE RECEBER COM CHEQUE DE EMISSÃO DO PAGADOR JANEIRO 2017 Cobrança CNAB 400 21 SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM SIM 83 84 86 87 88 89 90 91 92 93 94 OPERAÇÃO REF A VENDOR APÓS VENCIMENTO CONSULTAR A AGÊNCIA BENEFICIÁRIO ANTES DO VENCIMENTO OU APÓS 15 DIAS, PAGÁVEL SOMENTE EM NOSSA SEDE USO DO BANCO NÃO RECEBER ANTES DO VENCIMENTO USO DO BANCO NO VENCIMENTO PAGÁVEL EM QUALQUER AGÊNCIA BANCÁRIA NÃO RECEBER APÓS XX DIAS DO VENCIMENTO DEVOLVER APÓS XX DIAS DO VENCIMENTO MENSAGENS NOS BOLETOS COM 30 POSIÇÕES MENSAGENS NOS BOLETOS COM 40 POSIÇÕES 95 A 97 USO DO BANCO LER OBS D 98 DUPLICATA / FATURA Nº A A B C D (A) Informar a quantidade de dias nas posições 392 a 393. No caso da instrução “42”, o beneficiário passa a ter prioridade no recebimento quando o pagador estiver com falência decretada. A quantidade de dias será utilizada para as instruções de negativação expressa e protesto, não sendo possível informar no arquivo remessa de entrada as instruções de negativação e protesto, simultaneamente para o mesmo título. Se forem enviadas as duas instruções, a única a ser considerada será a instrução da negativação. Na negativação, caso o campo quantidade de dias seja informado com zeros, será considerado o prazo de 2 (dois) dias corridos após o vencimento. No caso da instrução “39”, se informar “00” será impresso no boleto a literal “NÃO RECEBER APÓS O VENCIMENTO”. (B) Informar a mensagem nas posições 352 a 381; o conteúdo da mensagem será informado na primeira linha disponível no campo de “instruções” do boleto. Caso todas as linhas deste campo estejam ocupadas, a mensagem será impressa acima do campo “Sacador / Avalista”. Utilizando-se deste campo para instrução “93”, para indicação do nome e dados do sacador / avalista, deve-se utilizar-se do registro tipo “1” ou do registro tipo “5”. (C) Informar a mensagem nas posições 352 a 391; o conteúdo da mensagem será informado na primeira linha disponível no campo de “instruções” do boleto. Caso todas as linhas deste campo estejam ocupadas, a mensagem será impressa nos campos “Sacador / Avalista” e “data da mora”. Utilizando- se deste campo para instrução “94”, para indicação do nome e dados do sacador / avalista, deve-se utilizar-se do registro tipo “1” ou do registro tipo “5”. (D) Informar o número da Duplicata/Fatura nas posições 087 a 106. Se este campo estiver com brancos ou zeros, a mensagem não será impressa. (E) Informar o valor do desconto por dia nas posições 180 a 192. (F) Informar o valor por dia de atraso nas posições 161 a 173 e a data nas posições 386 a 391. (G) Pode ser cancelada pela agência, Itaú Empresas na Internet ou através de arquivo, Código de Ocorrência 35, Nota 6, (utilizando a instrução 2196). Depois de cancelada, comandar a instrução de protesto novamente. (H) É impressa mensagem no boleto informando prazo de protesto. (I) Informar o VALOR do abatimento (nunca em percentual) referente a PIS-PASEP/COFIN/CSSL nas posições 206 a 218. A instrução será impressa no boleto com a literal: “ABATIMENTO DE XXXX.XXX,XX REF. PIS-PASEP/COFIN/CSSL, MESMO APOS VCTO”. (12) JUROS DE 1 DIA Se o cliente optar pelo padrão do Itaú ou solicitar o cadastramento permanente na conta corrente, não haverá a necessidade de informar esse valor no arquivo. Caso seja expresso em moeda variável, deverá ser preenchido com cinco casas decimais. (13) VALOR DO DESCONTO / ABATIMENTO O sistema limita o desconto concedido a 90% do valor de entrada do boleto. Para um mesmo boleto podem ser concedidos mais dois descontos (Nota 16). (14) VALOR DO IOF Indica o valor do IOF a ser retido pelo Itaú e repassado à SRF, de uso exclusivo por seguradoras. JANEIRO 2017 Cobrança CNAB 400 22 Quando o título for expresso em moeda variável, esse campo também deverá ser expresso em quantidades dessa moeda, com cinco casas decimais. (15) NOME DO PAGADOR/BRANCOS Os dois campos podem ser agrupados para registrar o nome do pagador. Se agrupados, o sistema do Itaú tentará abreviar o nome para 30 posições (ex.: Companhia = Cia), truncando o restante. (16) SACADOR/AVALISTA Normalmente deve ser preenchido com o nome do sacador/avalista. Alternativamente este campo poderá ter dois outros usos: (02) 2º e 3º descontos: para se operar com mais de um desconto (depende de cadastramento prévio do indicador 19.0 pelo Itaú, conforme Item 5), deve-se respeitar a seguinte disposição:  Posição 352 a 353 : Brancos  Posição 354 a 359 : Data do 2º desconto (DDMMAA)  Posição 360 a 372 : Valor do 2º desconto  Posição 373 a 378 : Data do 3º desconto (DDMMAA)  Posição 379 a 391 : Valor do 3º desconto  Posição 392 a 394 : Brancos b) Mensagens ao pagador: se utilizados as instruções 93 ou 94 (Nota 11), transcrever a mensagem desejada. É proibido o repasse e mensagens de tarifa no boleto ao pagador. (17) CÓDIGO DE OCORRÊNCIA (ARQUIVO RETORNO) CÓD. OCORRÊNCIAS 02 ENTRADA CONFIRMADA COM POSSIBILIDADE DE MENSAGEM (NOTA 20 – TABELA 10) 03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21 23 24 25 26 27 28 ENTRADA REJEITADA (NOTA 20 – TABELA 1) ALTERAÇÃO DE DADOS – NOVA ENTRADA OU ALTERAÇÃO/EXCLUSÃO DE DADOS ACATADA ALTERAÇÃO DE DADOS – BAIXA LIQUIDAÇÃO NORMAL LIQUIDAÇÃO PARCIAL – COBRANÇA INTELIGENTE (B2B) LIQUIDAÇÃO EM CARTÓRIO BAIXA SIMPLES BAIXA POR TER SIDO LIQUIDADO EM SER (SÓ NO RETORNO MENSAL) ABATIMENTO CONCEDIDO ABATIMENTO CANCELADO VENCIMENTO ALTERADO BAIXAS REJEITADAS (NOTA 20 – TABELA 4) INSTRUÇÕES REJEITADAS (NOTA 20 – TABELA 3) ALTERAÇÃO/EXCLUSÃO DE DADOS REJEITADOS (NOTA 20 – TABELA 2) COBRANÇA CONTRATUAL – INSTRUÇÕES/ALTERAÇÕES REJEITADAS/PENDENTES (NOTA 20 – TABELA 5) CONFIRMA RECEBIMENTO DE INSTRUÇÃO DE PROTESTO CONFIRMA RECEBIMENTO DE INSTRUÇÃO DE SUSTAÇÃO DE PROTESTO /TARIFA CONFIRMA RECEBIMENTO DE INSTRUÇÃO DE NÃO PROTESTAR TÍTULO ENVIADO A CARTÓRIO/TARIFA INSTRUÇÃO DE PROTESTO REJEITADA / SUSTADA / PENDENTE (NOTA 20 – TABELA 7) ALEGAÇÕES DO PAGADOR (NOTA 20 – TABELA 6) TARIFA DE AVISO DE COBRANÇA TARIFA DE EXTRATO POSIÇÃO (B40X) TARIFA DE RELAÇÃO DAS LIQUIDAÇÕES JANEIRO 2017 Cobrança CNAB 400 23 29 30 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 51 52 53 54 55 56 57 59 60 61 62 63 64 65 69 71 72 73 74 75 76 77 78 79 80 82 83 85 86 87 88 89 TARIFA DE MANUTENÇÃO DE TÍTULOS VENCIDOS DÉBITO MENSAL DE TARIFAS (PARA ENTRADAS E BAIXAS) BAIXA POR TER SIDO PROTESTADO CUSTAS DE PROTESTO CUSTAS DE SUSTAÇÃO CUSTAS DE CARTÓRIO DISTRIBUIDOR CUSTAS DE EDITAL TARIFA DE EMISSÃO DE BOLETO/TARIFA DE ENVIO DE DUPLICATA TARIFA DE INSTRUÇÃO TARIFA DE OCORRÊNCIAS TARIFA MENSAL DE EMISSÃO DE BOLETO/TARIFA MENSAL DE ENVIO DE DUPLICATA DÉBITO MENSAL DE TARIFAS – EXTRATO DE POSIÇÃO (B4EP/B4OX) DÉBITO MENSAL DE TARIFAS – OUTRAS INSTRUÇÕES DÉBITO MENSAL DE TARIFAS – MANUTENÇÃO DE TÍTULOS VENCIDOS DÉBITO MENSAL DE TARIFAS – OUTRAS OCORRÊNCIAS DÉBITO MENSAL DE TARIFAS – PROTESTO DÉBITO MENSAL DE TARIFAS – SUSTAÇÃO DE PROTESTO BAIXA COM TRANSFERÊNCIA PARA DESCONTO CUSTAS DE SUSTAÇÃO JUDICIAL TARIFA MENSAL REF A ENTRADAS BANCOS CORRESPONDENTES NA CARTEIRA TARIFA MENSAL BAIXAS NA CARTEIRA TARIFA MENSAL BAIXAS EM BANCOS CORRESPONDENTES NA CARTEIRA TARIFA MENSAL DE LIQUIDAÇÕES NA CARTEIRA TARIFA MENSAL DE LIQUIDAÇÕES EM BANCOS CORRESPONDENTES NA CARTEIRA CUSTAS DE IRREGULARIDADE INSTRUÇÃO CANCELADA (NOTA 20 – TABELA 8) BAIXA POR CRÉDITO EM C/C ATRAVÉS DO SISPAG ENTRADA REJEITADA CARNÊ (NOTA 20 – TABELA 1) TARIFA EMISSÃO AVISO DE MOVIMENTAÇÃO DE TÍTULOS (2154) DÉBITO MENSAL DE TARIFA – AVISO DE MOVIMENTAÇÃO DE TÍTULOS (2154) TÍTULO SUSTADO JUDICIALMENTE ENTRADA CONFIRMADA COM RATEIO DE CRÉDITO PAGAMENTO COM CHEQUE – AGUARDANDO COMPENSAÇÃO CHEQUE DEVOLVIDO (NOTA 20 – TABELA 9) ENTRADA REGISTRADA, AGUARDANDO AVALIAÇÃO BAIXA POR CRÉDITO EM C/C ATRAVÉS DO SISPAG SEM TÍTULO CORRESPONDENTE CONFIRMAÇÃO DE ENTRADA NA COBRANÇA SIMPLES – ENTRADA NÃO ACEITA NA COBRANÇA CONTRATUAL INSTRUÇÃO DE NEGATIVAÇÃO EXPRESSA REJEITADA (NOTA 20 – TABELA 11) CONFIRMAÇÃO DE RECEBIMENTO DE INSTRUÇÃO DE ENTRADA EM NEGATIVAÇÃO EXPRESSA CHEQUE COMPENSADO CONFIRMAÇÃO DE RECEBIMENTO DE INSTRUÇÃO DE EXCLUSÃO DE ENTRADA EM NEGATIVAÇÃO EXPRESSA CONFIRMAÇÃO DE RECEBIMENTO DE INSTRUÇÃO DE CANCELAMENTO DE NEGATIVAÇÃO EXPRESSA NEGATIVAÇÃO EXPRESSA INFORMACIONAL (NOTA 20 – TABELA 12) CONFIRMAÇÃO DE ENTRADA EM NEGATIVAÇÃO EXPRESSA – TARIFA CONFIRMAÇÃO DO CANCELAMENTO DE NEGATIVAÇÃO EXPRESSA – TARIFA CONFIRMAÇÃO DE EXCLUSÃO DE ENTRADA EM NEGATIVAÇÃO EXPRESSA POR LIQUIDAÇÃO – TARIFA TARIFA POR BOLETO (ATÉ 03 ENVIOS) COBRANÇA ATIVA ELETRÔNICA TARIFA EMAIL COBRANÇA ATIVA ELETRÔNICA TARIFA SMS COBRANÇA ATIVA ELETRÔNICA TARIFA MENSAL POR BOLETO (ATÉ 03 ENVIOS) COBRANÇA ATIVA ELETRÔNICA TARIFA MENSAL EMAIL COBRANÇA ATIVA ELETRÔNICA JANEIRO 2017 Cobrança CNAB 400 24 90 91 92 93 TARIFA MENSAL SMS COBRANÇA ATIVA ELETRÔNICA TARIFA MENSAL DE EXCLUSÃO DE ENTRADA DE NEGATIVAÇÃO EXPRESSA TARIFA MENSAL DE CANCELAMENTO DE NEGATIVAÇÃO EXPRESSA TARIFA MENSAL DE EXCLUSÃO DE NEGATIVAÇÃO EXPRESSA POR LIQUIDAÇÃO (18) Nº DO DOCUMENTO No arquivo remessa, sugerimos o preenchimento com o nº do documento que originou a cobrança (nº duplicata, Nota fiscal, etc.). No arquivo retorno, devolveremos o mesmo conteúdo enviado no arquivo remessa. Exemplo: considerando-se os seguintes dados  nº da agência : 0057  nº da conta corrente sem o DAC : 72192  nº da subcarteira : 198  nosso número : 98712345 seu número : 1108954  1º - Cálculo do DAC do \"Nosso Número\": conforme Nota 23 o DAC é 1. 2º - Montagem do campo \"Seu Número\" e multiplicação: 1 1 0 8 9 5 4 x 2 1 2 1 2 1 2 ---------------------------- = 2 1 0 8 18 5 8 3º - Soma dos dígitos dos produtos (cada dígito é somado individualmente), como segue: 2+1+0 +8+1+8 +5+8 = 33 4º - Dividir o resultado da conta por 10: 10 (módulo) – 3 (resto da divisão) = 7 33 10 3 3 Resto da divisão Portanto:  a impressão do campo nosso número no boleto deve ser \"198/98712345-1\"  a impressão do campo seu número no boleto deve ser \"1108954-7\" (19) DESCONTO/ABATIMENTO Se o desconto ou abatimento é concedido na entrada do boleto estes campos são retornados zerados (apesar de corretamente registrados no Itaú). Se concedidos após a entrada, retornam com os valores do desconto ou abatimento. Na liquidação, desconto e abatimento retornam somados no campo desconto; opcionalmente, mediante cadastro prévio em nosso sistema, estes valores poderão retornar separados, conforme mostra o indicador 36.4 do Item 5 - Condições Personalizadas. JANEIRO 2017 Cobrança CNAB 400 25 (20) ERROS / CANCELAMENTO DE INSTRUÇÕES / ALEGAÇÕES DO PAGADOR / MOTIVO DE DEVOLUÇÃO DO CHEQUE Para as confirmações de entrada (código de ocorrência 02), em determinadas situações, pode-se ler nas posições 378 a 385, mensagem informativa referente ao título em questão, conforme tabela 10. Para os registros rejeitados (códigos de ocorrência 03, 15, 16, 17 e 18) pode-se ler nas posições 378 a 385 até quatro códigos de erro que explicam o motivo da rejeição. O indicador 38.0 (vide capítulo 5 - Condições Personalizadas) define quais desses registros serão gerados pelo Itaú. Para cancelamento de instruções (Ocorrência 57) é retornado na posição 302 a 305, o código da instrução cancelada, conforme tabela 8. Para as alegações do pagador (Ocorrência 25) e para ordem de protesto sustada (ocorrência 24), são retornados os seguintes campos adicionais, conforme tabelas 6 e 7 respectivamente:  Posição 302 a 305: código complementar da ocorrência  Posição 306 a 311: data complementar da ocorrência do pagador  Posição 312 a 324: valor complementar da ocorrência do pagador TABELA 1 - Entradas Rejeitadas (código da ocorrência = 03 na Posição 109 a 110) CÓD. CAMPO COM ERRO DESCRIÇÃO DO ERRO 03 04 05 07 08 09 10 11 12 13 14 15 18 19 21 22 26 27 29 30 31 35 36 37 42 52 53 54 55 AG. COBRADORA CEP SEM ATENDIMENTO DE PROTESTO NO MOMENTO ESTADO SIGLA DO ESTADO INVÁLIDA DATA VENCIMENTO PRAZO DA OPERAÇÃO MENOR QUE PRAZO MÍNIMO OU MAIOR QUE O MÁXIMO VALOR DO TÍTULO VALOR DO TÍTULO MAIOR QUE 10.000.000,00 NOME DO PAGADOR NÃO INFORMADO OU DESLOCADO AGENCIA/CONTA AGÊNCIA ENCERRADA LOGRADOURO NÃO INFORMADO OU DESLOCADO CEP CEP NÃO NUMÉRICO OU CEP INVÁLIDO SACADOR / AVALISTA NOME NÃO INFORMADO OU DESLOCADO (BANCOS CORRESPONDENTES) ESTADO/CEP CEP INCOMPATÍVEL COM A SIGLA DO ESTADO NOSSO NÚMERO NOSSO NÚMERO JÁ REGISTRADO NO CADASTRO DO BANCO OU FORA DA FAIXA NOSSO NÚMERO NOSSO NÚMERO EM DUPLICIDADE NO MESMO MOVIMENTO DATA DE ENTRADA DATA DE ENTRADA INVÁLIDA PARA OPERAR COM ESTA CARTEIRA OCORRÊNCIA OCORRÊNCIA INVÁLIDA AG. COBRADORA CARTEIRA NÃO ACEITA DEPOSITÁRIA CORRESPONDENTE ESTADO DA AGÊNCIA DIFERENTE DO ESTADO DO PAGADOR AG. COBRADORA NÃO CONSTA NO CADASTRO OU ENCERRANDO CARTEIRA CARTEIRA NÃO PERMITIDA (NECESSÁRIO CADASTRAR FAIXA LIVRE) AGÊNCIA/CONTA AGÊNCIA/CONTA NÃO LIBERADA PARA OPERAR COM COBRANÇA CNPJ INAPTO CNPJ DO BENEFICIÁRIO INAPTO DEVOLUÇÃO DE TÍTULO EM GARANTIA CÓDIGO EMPRESA CATEGORIA DA CONTA INVÁLIDA ENTRADA BLOQUEADA ENTRADAS BLOQUEADAS, CONTA SUSPENSA EM COBRANÇA AGÊNCIA/CONTA CONTA NÃO TEM PERMISSÃO PARA PROTESTAR (CONTATE SEU GERENTE) VALOR DO IOF IOF MAIOR QUE 5% QTDADE DE MOEDA QUANTIDADE DE MOEDA INCOMPATÍVEL COM VALOR DO TÍTULO CNPJ/CPF DO PAGADOR NÃO NUMÉRICO OU IGUAL A ZEROS NOSSO NÚMERO NOSSO NÚMERO FORA DE FAIXA AG. COBRADORA EMPRESA NÃO ACEITA BANCO CORRESPONDENTE AG. COBRADORA EMPRESA NÃO ACEITA BANCO CORRESPONDENTE - COBRANÇA MENSAGEM DATA DE VENCTO BANCO CORRESPONDENTE - TÍTULO COM VENCIMENTO INFERIOR A 15 DIAS DEP/BCO CORRESP CEP NÃO PERTENCE À DEPOSITÁRIA INFORMADA JANEIRO 2017 Cobrança CNAB 400 26 56 57 60 61 62 63 64 65 66 67 68 69 70 78 80 81 82 83 84 85 86 87 90 97 98 99 DT VENCTO/BCO CORRESP VENCTO SUPERIOR A 180 DIAS DA DATA DE ENTRADA DATA DE VENCTO CEP SÓ DEPOSITÁRIA BCO DO BRASIL COM VENCTO INFERIOR A 8 DIAS ABATIMENTO VALOR DO ABATIMENTO INVÁLIDO JUROS DE MORA JUROS DE MORA MAIOR QUE O PERMITIDO DESCONTO VALOR DO DESCONTO MAIOR QUE VALOR DO TÍTULO DESCONTO DE ANTECIPAÇÃO VALOR DA IMPORTÂNCIA POR DIA DE DESCONTO (IDD) NÃO PERMITIDO DATA DE EMISSÃO DATA DE EMISSÃO DO TÍTULO INVÁLIDA TAXA FINANCTO TAXA INVÁLIDA (VENDOR) DATA DE VENCTO INVALIDA/FORA DE PRAZO DE OPERAÇÃO (MÍNIMO OU MÁXIMO) VALOR/QTIDADE VALOR DO TÍTULO/QUANTIDADE DE MOEDA INVÁLIDO CARTEIRA CARTEIRA CARTEIRA INVÁLIDA OU NÃO CADASTRADA NO INTERCÂMBIO DA COBRANÇA CARTEIRA INVÁLIDA PARA TÍTULOS COM RATEIO DE CRÉDITO AGÊNCIA/CONTA BENEFICIÁRIO NÃO CADASTRADO PARA FAZER RATEIO DE CRÉDITO AGÊNCIA/CONTA DUPLICIDADE DE AGÊNCIA/CONTA BENEFICIÁRIA DO RATEIO DE CRÉDITO AGÊNCIA/CONTA QUANTIDADE DE CONTAS BENEFICIÁRIAS DO RATEIO MAIOR DO QUE O PERMITIDO (MÁXIMO DE 30 CONTAS POR TÍTULO) AGÊNCIA/CONTA CONTA PARA RATEIO DE CRÉDITO INVÁLIDA / NÃO PERTENCE AO ITAÚ DESCONTO/ABATI-MENTO DESCONTO/ABATIMENTO NÃO PERMITIDO PARA TÍTULOS COM RATEIO DE CRÉDITO VALOR DO TÍTULO VALOR DO TÍTULO MENOR QUE A SOMA DOS VALORES ESTIPULADOS PARA RATEIO AGÊNCIA/CONTA AGÊNCIA/CONTA BENEFICIÁRIA DO RATEIO É A CENTRALIZADORA DE CRÉDITO DO BENEFICIÁRIO AGÊNCIA/CONTA AGÊNCIA/CONTA DO BENEFICIÁRIO É CONTRATUAL / RATEIO DE CRÉDITO NÃO PERMITIDO TIPO DE VALOR CÓDIGO DO TIPO DE VALOR INVÁLIDO / NÃO PREVISTO PARA TÍTULOS COM RATEIO DE CRÉDITO AGÊNCIA/CONTA REGISTRO TIPO 4 SEM INFORMAÇÃO DE AGÊNCIAS/CONTAS BENEFICIÁRIAS DO RATEIO NRO DA LINHA SEM MENSAGEM FLASH INVÁLIDO FLASH INVÁLIDO COBRANÇA MENSAGEM - NÚMERO DA LINHA DA MENSAGEM INVÁLIDO OU QUANTIDADE DE LINHAS EXCEDIDAS COBRANÇA MENSAGEM SEM MENSAGEM (SÓ DE CAMPOS FIXOS), PORÉM COM REGISTRO DO TIPO 7 OU 8 REGISTRO MENSAGEM SEM FLASH CADASTRADO OU FLASH INFORMADO DIFERENTE DO CADASTRADO CONTA DE COBRANÇA COM FLASH CADASTRADO E SEM REGISTRO DE MENSAGEM CORRESPONDENTE TABELA 2 – Alteração de dados rejeitada (código da ocorrência = 17 na Posição 109 a 110) CÓD. CAMPO COM ERRO 02 04 05 06 08 09 11 12 AGÊNCIA COBRADORA INVÁLIDA OU COM O MESMO CONTEÚDO SIGLA DO ESTADO INVÁLIDA DATA DE VENCIMENTO INVÁLIDA OU COM O MESMO CONTEÚDO VALOR DO TÍTULO COM OUTRA ALTERAÇÃO SIMULTÂNEA NOME DO PAGADOR COM O MESMO CONTEÚDO AGÊNCIA/CONTA INCORRETA CEP INVÁLIDO NÚMERO INSCRIÇÃO INVÁLIDO DO SACADOR AVALISTA 13 SEU NÚMERO COM O MESMO CONTEÚDO 16 20 ABATIMENTO/ALTERAÇÃO DO VALOR DO TÍTULO OU SOLICITAÇÃO DE BAIXA BLOQUEADA ESPÉCIE INVÁLIDA 21 AGÊNCIA COBRADORA NÃO CONSTA NO CADASTRO DE DEPOSITÁRIA OU EM ENCERRAMENTO 23 41 42 43 53 54 55 DATA DE EMISSÃO DO TÍTULO INVÁLIDA OU COM MESMO CONTEÚDO CAMPO ACEITE INVÁLIDO OU COM MESMO CONTEÚDO ALTERAÇÃO INVÁLIDA PARA TÍTULO VENCIDO ALTERAÇÃO BLOQUEADA – VENCIMENTO JÁ ALTERADO INSTRUÇÃO COM O MESMO CONTEÚDO DATA VENCIMENTO PARA BANCOS CORRESPONDENTES INFERIOR AO ACEITO PELO BANCO ALTERAÇÕES IGUAIS PARA O MESMO CONTROLE (AGÊNCIA/CONTA/CARTEIRA/NOSSO NÚMERO) JANEIRO 2017 Cobrança CNAB 400 27 56 57 60 CNPJ/CPF INVÁLIDO NÃO NUMÉRICO OU ZERADO PRAZO DE VENCIMENTO INFERIOR A 15 DIAS VALOR DE IOF – ALTERAÇÃO NÃO PERMITIDA PARA CARTEIRAS DE N.S. – MOEDA VARIÁVEL 61 TÍTULO JÁ BAIXADO OU LIQUIDADO OU NÃO EXISTE TÍTULO CORRESPONDENTE NO SISTEMA 66 ALTERAÇÃO NÃO PERMITIDA PARA CARTEIRAS DE NOTAS DE SEGUROS – MOEDA VARIÁVEL 67 72 73 74 75 76 81 87 NOME INVÁLIDO DO SACADOR AVALISTA ENDEREÇO INVÁLIDO – SACADOR AVALISTA BAIRRO INVÁLIDO – SACADOR AVALISTA CIDADE INVÁLIDA – SACADOR AVALISTA SIGLA ESTADO INVÁLIDO – SACADOR AVALISTA CEP INVÁLIDO – SACADOR AVALISTA ALTERAÇÃO BLOQUEADA – TÍTULO COM NEGATIVAÇÃO EXPRESSA / PROTESTO ALTERAÇÃO BLOQUEADA – TÍTULO COM RATEIO DE CRÉDITO TABELA 3 – Instruções rejeitadas (código da ocorrência = 16 na posição 109 a 110) CÓD. 01 03 06 CAMPO COM ERRO INSTRUÇÃO/OCORRÊNCIA NÃO EXISTENTE CONTA NÃO TEM PERMISSÃO PARA PROTESTAR (CONTATE SEU GERENTE) NOSSO NÚMERO IGUAL A ZEROS 09 CNPJ/CPF DO SACADOR/AVALISTA INVÁLIDO 10 11 14 15 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 40 41 42 VALOR DO ABATIMENTO IGUAL OU MAIOR QUE O VALOR DO TÍTULO SEGUNDA INSTRUÇÃO/OCORRÊNCIA NÃO EXISTENTE REGISTRO EM DUPLICIDADE CNPJ/CPF INFORMADO SEM NOME DO SACADOR/AVALISTA VALOR DO ABATIMENTO MAIOR QUE 90% DO VALOR DO TÍTULO EXISTE SUSTACAO DE PROTESTO PENDENTE PARA O TITULO TÍTULO NÃO REGISTRADO NO SISTEMA TÍTULO BAIXADO OU LIQUIDADO INSTRUÇÃO NÃO ACEITA INSTRUÇÃO INCOMPATÍVEL – EXISTE INSTRUÇÃO DE PROTESTO PARA O TÍTULO INSTRUÇÃO INCOMPATÍVEL – NÃO EXISTE INSTRUÇÃO DE PROTESTO PARA O TÍTULO INSTRUÇÃO NÃO ACEITA POR JÁ TER SIDO EMITIDA A ORDEM DE PROTESTO AO CARTÓRIO INSTRUÇÃO NÃO ACEITA POR NÃO TER SIDO EMITIDA A ORDEM DE PROTESTO AO CARTÓRIO JÁ EXISTE UMA MESMA INSTRUÇÃO CADASTRADA ANTERIORMENTE PARA O TÍTULO VALOR LÍQUIDO + VALOR DO ABATIMENTO DIFERENTE DO VALOR DO TÍTULO REGISTRADO EXISTE UMA INSTRUÇÃO DE NÃO PROTESTAR ATIVA PARA O TÍTULO EXISTE UMA OCORRÊNCIA DO PAGADOR QUE BLOQUEIA A INSTRUÇÃO DEPOSITÁRIA DO TÍTULO = 9999 OU CARTEIRA NÃO ACEITA PROTESTO ALTERAÇÃO DE VENCIMENTO IGUAL À REGISTRADA NO SISTEMA OU QUE TORNA O TÍTULO VENCIDO INSTRUÇÃO DE EMISSÃO DE AVISO DE COBRANÇA PARA TÍTULO VENCIDO ANTES DO VENCIMENTO SOLICITAÇÃO DE CANCELAMENTO DE INSTRUÇÃO INEXISTENTE TÍTULO SOFRENDO ALTERAÇÃO DE CONTROLE (AGÊNCIA/CONTA/CARTEIRA/NOSSO NÚMERO) INSTRUÇÃO NÃO PERMITIDA PARA A CARTEIRA INSTRUÇÃO NÃO PERMITIDA PARA TÍTULO COM RATEIO DE CRÉDITO INSTRUÇÃO INCOMPATÍVEL – NÃO EXISTE INSTRUÇÃO DE NEGATIVAÇÃO EXPRESSA PARA O TÍTULO INSTRUÇÃO NÃO PERMITIDA – TÍTULO COM ENTRADA EM NEGATIVAÇÃO EXPRESSA INSTRUÇÃO NÃO PERMITIDA – TÍTULO COM NEGATIVAÇÃO EXPRESSA CONCLUÍDA JANEIRO 2017 Cobrança CNAB 400 28 43 45 47 48 49 50 51 PRAZO INVÁLIDO PARA NEGATIVAÇÃO EXPRESSA – MÍNIMO: 02 DIAS CORRIDOS APÓS O VENCIMENTO INSTRUÇÃO INCOMPATÍVEL PARA O MESMO TÍTULO NESTA DATA INSTRUÇÃO NÃO PERMITIDA – ESPÉCIE INVÁLIDA DADOS DO PAGADOR INVÁLIDOS ( CPF / CNPJ / NOME ) DADOS DO ENDEREÇO DO PAGADOR INVÁLIDOS DATA DE EMISSÃO DO TÍTULO INVÁLIDA INSTRUÇÃO NÃO PERMITIDA – TÍTULO COM NEGATIVAÇÃO EXPRESSA AGENDADA TABELA 4 – Baixas rejeitadas (código da ocorrência = 15 na Posição 109 a 110) CÓD. CAMPO COM ERRO 01 04 05 06 07 08 10 11 CARTEIRA/Nº NÚMERO NÃO NUMÉRICO NOSSO NÚMERO EM DUPLICIDADE NO MESMO MOVIMENTO SOLICITAÇÃO DE BAIXA PARA TÍTULO JÁ BAIXADO OU LIQUIDADO SOLICITAÇÃO DE BAIXA PARA TÍTULO NÃO REGISTRADO NO SISTEMA COBRANÇA PRAZO CURTO – SOLICITAÇÃO DE BAIXA P/ TÍTULO NÃO REGISTRADO NO SISTEMA SOLICITAÇÃO DE BAIXA PARA TÍTULO EM FLOATING VALOR DO TITULO FAZ PARTE DE GARANTIA DE EMPRESTIMO PAGO ATRAVÉS DO SISPAG POR CRÉDITO EM C/C E NÃO BAIXADO TABELA 5 – Alteração dados cobrança contratual rejeitada/pendente (código da ocorrência = 18 na Posição 109 a 110) OBS CÓD. CAMPO COM ERRO 16 ABATIMENTO/ALTERAÇÃO DO VALOR DO TÍTULO OU SOLICITAÇÃO DE BAIXA BLOQUEADOS A A A 40 41 42 NÃO APROVADA DEVIDO AO IMPACTO NA ELEGIBILIDADE DE GARANTIAS AUTOMATICAMENTE REJEITADA CONFIRMA RECEBIMENTO DE INSTRUÇÃO – PENDENTE DE ANÁLISE (0) Códigos opcionais, podem retornar desde que acordado sua utilização junto ao Banco. TABELA 6 – Alegações do PAGADOR (código ocorrência = 25 na Posição 109 a 110) COMPLEMENTO CÓD. DATA VALOR CAMPO COM ERRO 1313 1321 1339 1347 1354 1362 1370 1388 1396 1404 1412 1420 1438 1446 1453 DATA 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 SOLICITA A PRORROGAÇÃO DO VENCIMENTO PARA: SOLICITA A DISPENSA DOS JUROS DE MORA NÃO RECEBEU A MERCADORIA A MERCADORIA CHEGOU ATRASADA A MERCADORIA CHEGOU AVARIADA A MERCADORIA CHEGOU INCOMPLETA A MERCADORIA NÃO CONFERE COM O PEDIDO A MERCADORIA ESTÁ À DISPOSIÇÃO DEVOLVEU A MERCADORIA NÃO RECEBEU A FATURA A FATURA ESTÁ EM DESACORDO COM A NOTA FISCAL O PEDIDO DE COMPRA FOI CANCELADO A DUPLICATA FOI CANCELADA QUE NADA DEVE OU COMPROU QUE MANTÉM ENTENDIMENTOS COM O SACADOR JANEIRO 2017 Cobrança CNAB 400 29 1461 1479 1487 1495 1503 1719 1727 1735 1750 1768 1776 1784 1792 1800 1818 1826 1834 1842 DATA DATA DATA DATA 0 0 0 0 QUE PAGARÁ O TÍTULO EM: QUE PAGOU O TÍTULO DIRETAMENTE AO BENEFICIÁRIO EM: QUE PAGARÁ O TÍTULO DIRETAMENTE AO BENEFICIÁRIO EM: QUE O VENCIMENTO CORRETO É: 0 VALOR QUE TEM DESCONTO OU ABATIMENTO DE: 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 PAGADOR NÃO FOI LOCALIZADO; CONFIRMAR ENDEREÇO PAGADOR ESTÁ EM REGIME DE CONCORDATA PAGADOR ESTÁ EM REGIME DE FALÊNCIA PAGADOR SE RECUSA A PAGAR JUROS BANCÁRIOS PAGADOR SE RECUSA A PAGAR COMISSÃO DE PERMANÊNCIA NÃO FOI POSSÍVEL A ENTREGA DO BOLETO AO PAGADOR BOLETO NÃO ENTREGUE, MUDOU-SE / DESCONHECIDO BOLETO NÃO ENTREGUE, CEP ERRADO / INCOMPLETO BOLETO NÃO ENTREGUE, NÚMERO NÃO EXISTE/ENDEREÇO INCOMPLETO BOLETO NÃO RETIRADO PELO PAGADOR. REENVIADO PELO CORREIO PARA CARTEIRAS COM EMISSÃO PELO BANCO ENDEREÇO DE E-MAIL INVÁLIDO/COBRANÇA MENSAGEM. BOLETO ENVIADO PELO CORREIO BOLETO DDA, DIVIDA RECONHECIDA PELO PAGADOR BOLETO DDA, DIVIDA NÃO RECONHECIDA PELO PAGADOR TABELA 7 – Ordem de protesto sustada, motivo (código de ocorrência = 24 na Posição 109 a 110) COMPLEMENTO CÓD. DATA VALOR SIGNIFICADO 1610 3103 3111 3129 3137 3145 3152 3160 3178 3186 3194 3202 3210 3228 3236 3244 3251 3269 3277 3285 3293 3301 3319 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 DOCUMENTAÇÃO SOLICITADA AO BENEFICIÁRIO INSUFICIENCIA DE DADOS NO MODELO 4006 SUSTAÇÃO SOLICITADA AG. BENEFICIÁRIO TITULO NAO ENVIADO A CARTORIO AGUARDAR UM DIA UTIL APOS O VENCTO PARA PROTESTAR DM/DMI SEM COMPROVANTE AUTENTICADO OU DECLARACAO FALTA CONTRATO DE SERV(AG.CED:ENVIAR) NOME DO PAGADOR INCOMPLETO/INCORRETO NOME DO BENEFICIÁRIO INCOMPLETO/INCORRETO NOME DO SACADOR INCOMPLETO/INCORRETO TIT ACEITO: IDENTIF ASSINANTE DO CHEQ TIT ACEITO: RASURADO OU RASGADO TIT ACEITO: FALTA TIT.(AG.CED:ENVIAR) ATOS DA CORREGEDORIA ESTADUAL NAO FOI POSSIVEL EFETUAR O PROTESTO PROTESTO SUSTADO / BENEFICIÁRIO NÃO ENTREGOU A DOCUMENTAÇÃO DOCUMENTACAO IRREGULAR DATA DE EMISSÃO DO TÍTULO INVÁLIDA / IRREGULAR ESPECIE INVALIDA PARA PROTESTO PRAÇA NÃO ATENDIDA PELA REDE BANCÁRIA CENTRALIZADORA DE PROTESTO NAO RECEBEU A DOCUMENTACAO CNPJ/CPF DO PAGADOR INVÁLIDO / INCORRETO SACADOR/AVALISTA E PESSOA FÍSICA JANEIRO 2017 Cobrança CNAB 400 30 3327 3335 3343 3350 3368 3376 3384 3392 3400 3418 3426 3434 3442 3459 3467 3475 3483 3491 3509 3517 3525 3533 3541 3558 3566 3574 3582 3590 3608 3616 3624 3632 3640 3657 3665 3673 3681 3699 3707 3715 3723 3731 3749 3756 3764 3772 3780 3798 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 CEP DO PAGADOR INCORRETO DEPOSITÁRIA INCOMPATÍVEL COM CEP DO PAGADOR CNPJ/CPF SACADOR INVALIDO / INCORRETO ENDEREÇO DO PAGADOR INSUFICIENTE PRAÇA PAGTO INCOMPATÍVEL COM ENDEREÇO FALTA NÚMERO/ESPÉCIE DO TÍTULO TÍTULO ACEITO S/ ASSINATURA DO SACADOR TÍTULO ACEITO S/ ENDOSSO BENEFICIÁRIO OU IRREGULAR TÍTULO SEM LOCAL OU DATA DE EMISSÃO TÍTULO ACEITO COM VALOR EXTENSO DIFERENTE DO NUMÉRICO TÍTULO ACEITO DEFINIR ESPÉCIE DA DUPLICATA DATA EMISSÃO POSTERIOR AO VENCIMENTO TÍTULO ACEITO DOCUMENTO NÃO PROTESTÁVEL TÍTULO ACEITO EXTENSO VENCIMENTO IRREGULAR TÍTULO ACEITO FALTA NOME FAVORECIDO TÍTULO ACEITO FALTA PRAÇA DE PAGAMENTO TÍTULO ACEITO FALTA CPF ASSINANTE CHEQUE FALTA NÚMERO DO TÍTULO (SEU NÚMERO) CARTÓRIO DA PRAÇA COM ATIVIDADE SUSPENSA DATA APRESENTACAO MENOR QUE A DATA VENCIMENTO FALTA COMPROVANTE DA PRESTACAO DE SERVICO CNPJ/CPF PAGADOR INCOMPATIVEL C/ TIPO DE DOCUMENTO CNPJ/CPF SACADOR INCOMPATIVEL C/ ESPECIE TIT ACEITO: S/ ASSINATURA DO PAGADOR FALTA DATA DE EMISSAO DO TITULO SALDO MAIOR QUE O VALOR DO TITULO TIPO DE ENDOSSO INVALIDO DEVOLVIDO POR ORDEM JUDICIAL DADOS DO TITULO NAO CONFEREM COM DISQUETE PAGADOR E SACADOR AVALISTA SÃO A MESMA PESSOA COMPROVANTE ILEGIVEL PARA CONFERENCIA E MICROFILMAGEM CONFIRMAR SE SAO DOIS EMITENTES ENDERECO DO PAGADOR IGUAL AO DO SACADOR OU DO PORTADOR ENDERECO DO BENEFICIÁRIO INCOMPLETO OU NAO INFORMADO ENDERECO DO EMITENTE NO CHEQUE IGUAL AO DO BANCO PAGADOR FALTA MOTIVO DA DEVOLUCAO NO CHEQUE OU ILEGIVEL TITULO COM DIREITO DE REGRESSO VENCIDO TITULO APRESENTADO EM DUPLICIDADE LC EMITIDA MANUALMENTE (TITULO DO BANCO/CA) NAO PROTESTAR LC (TITULO DO BANCO/CA) ELIMINAR O PROTESTO DA LC (TITULO DO BANCO/CA) TITULO JA PROTESTADO TITULO – FALTA TRADUCAO POR TRADUTOR PUBLICO FALTA DECLARACAO DE SALDO ASSINADA NO TITULO CONTRATO DE CAMBIO – FALTA CONTA GRAFICA PAGADOR FALECIDO ESPECIE DE TITULO QUE O BANCO NAO PROTESTA AUSENCIA DO DOCUMENTO FISICO JANEIRO 2017 Cobrança CNAB 400 31 3806 3814 3822 3830 3848 3855 3863 3871 3889 3897 3905 3913 3921 3939 3947 3954 3962 3970 3988 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 ORDEM DE PROTESTO SUSTADA, MOTIVO PAGADOR APRESENTOU QUITAÇÃO DO TÍTULO PAGADOR IRÁ NEGOCIAR COM BENEFICIÁRIO CPF INCOMPATÍVEL COM A ESPÉCIE DO TÍTULO TÍTULO DE OUTRA JURISDIÇÃO TERRITORIAL TÍTULO COM EMISSÃO ANTERIOR A CONCORDATA DO PAGADOR PAGADOR CONSTA NA LISTA DE FALÊNCIA APRESENTANTE NÃO ACEITA PUBLICAÇÃO DE EDITAL CARTÓRIO COM PROBLEMAS OPERACIONAIS ENVIO DE TITULOS PARA PROTESTO TEMPORARIAMENTE PARALISADO BENEFICIÁRIO COM CONTA EM COBRANCA SUSPENSA CEP DO PAGADOR E UMA CAIXA POSTAL ESPÉCIE NÃO PROTESTÁVEL NO ESTADO FALTA ENDEREÇO OU DOCUMENTO DO SACADOR AVALISTA CORRIGIR A ESPECIE DO TITULO ERRO DE PREENCHIMENTO DO TITULO VALOR DIVERGENTE ENTRE TITULO E COMPROVANTE CONDOMINIO NAO PODE SER PROTESTADO P/ FINS FALIMENTARES VEDADA INTIMACAO POR EDITAL PARA PROTESTO FALIMENTAR TABELA 8 – Instrução cancelada (código de ocorrência = 57 na Posição 109 a 110) CÓD. OCORRÊNCIAS 1156 NÃO PROTESTAR 2261 DISPENSAR JUROS/COMISSÃO DE PERMANÊNCIA TABELA 9 – Motivo de devolução do cheque devolvido utilizado para pagamento do boleto (código de ocorrência = 69 na Posição 109 a 110) MOT DESCRIÇÃO PASSÍVEL DE REAPRESENTAÇÃO 11 12 13 14 20 21 22 23 24 25 28 29 30 31 CHEQUE SEM FUNDOS – PRIMEIRA APRESENTAÇÃO. CHEQUE SEM FUNDOS – SEGUNDA APRESENTAÇÃO. CONTA ENCERRADA. PRÁTICA ESPÚRIA. FOLHA DE CHEQUE CANCELADA POR SOLICITAÇÃO DO CORRENTISTA. CONTRA-ORDEM (OU REVOGAÇÃO) OU OPOSIÇÃO (OU SUSTAÇÃO) AO PAGAMENTO PELO EMITENTE OU PELO PORTADOR. DIVERGÊNCIA OU INSUFICIÊNCIA DE ASSINATURA. CHEQUES EMITIDOS POR ENTIDADES E ÓRGÃOS DA ADMINISTRAÇÃO PÚBLICA FEDERAL DIRETA E INDIRETA, EM DESACORDO COM OS REQUISITOS CONSTANTES DO ARTIGO 74, § 2º, DO DECRETO-LEI Nº 200, DE 25.02.1967. BLOQUEIO JUDICIAL OU DETERMINAÇÃO DO BANCO CENTRAL DO BRASIL. CANCELAMENTO DE TALONÁRIO PELO BANCO PAGADOR. CONTRA-ORDEM (OU REVOGAÇÃO) OU OPOSIÇÃO (OU SUSTAÇÃO) AO PAGAMENTO OCASIONADA POR FURTO OU ROUBO. CHEQUE BLOQUEADO POR FALTA DE CONFIRMAÇÃO DO RECEBIMENTO DO TALONÁRIO PELO CORRENTISTA. FURTO OU ROUBO DE MALOTES. ERRO FORMAL (SEM DATA DE EMISSÃO, COM O MÊS GRAFADO NUMERICAMENTE, AUSÊNCIA DE ASSINATURA, NÃO-REGISTRO DO VALOR POR EXTENSO). SIM NÃO NÃO NÃO NÃO SIM SIM SIM SIM NÃO NÃO SIM NÃO SIM JANEIRO 2017 Cobrança CNAB 400 32 32 33 34 35 36 40 41 42 43 44 45 48 49 AUSÊNCIA OU IRREGULARIDADE NA APLICAÇÃO DO CARIMBO DE COMPENSAÇÃO. DIVERGÊNCIA DE ENDOSSO. CHEQUE APRESENTADO POR ESTABELECIMENTO BANCÁRIO QUE NÃO O INDICADO NO CRUZAMENTO EM PRETO, SEM O ENDOSSO-MANDATO. CHEQUE FRAUDADO, EMITIDO SEM PRÉVIO CONTROLE OU RESPONSABILIDADE DO ESTABELECIMENTO BANCÁRIO (“CHEQUE UNIVERSAL”), OU AINDA COM ADULTERAÇÃO DA PRAÇA SACADA. CHEQUE EMITIDO COM MAIS DE UM ENDOSSO. MOEDA INVÁLIDA. CHEQUE APRESENTADO A BANCO QUE NÃO O PAGADOR. CHEQUE NÃO-COMPENSÁVEL NA SESSÃO OU SISTEMA DE COMPENSAÇÃO EM QUE FOI APRESENTADO. CHEQUE, DEVOLVIDO ANTERIORMENTE PELOS MOTIVOS 21, 22, 23, 24, 31 OU 34, NÃO-PASSÍVEL DE REAPRESENTAÇÃO EM VIRTUDE DE PERSISTIR O MOTIVO DA DEVOLUÇÃO. CHEQUE PRESCRITO. CHEQUE EMITIDO POR ENTIDADE OBRIGADA A REALIZAR MOVIMENTAÇÃO E UTILIZAÇÃO DE RECURSOS FINANCEIROS DO TESOURO NACIONAL MEDIANTE ORDEM BANCÁRIA. CHEQUE DE VALOR SUPERIOR AO ESTABELECIDO, EMITIDO SEM A IDENTIFICAÇÃO DO BENEFICIÁRIO, DEVENDO SER DEVOLVIDO A QUALQUER TEMPO. REMESSA NULA, CARACTERIZADA PELA REAPRESENTAÇÃO DE CHEQUE DEVOLVIDO PELOS MOTIVOS 12, 13, 14, 20, 25, 28, 30, 35, 43, 44 E 45, PODENDO A SUA DEVOLUÇÃO OCORRER A QUALQUER TEMPO. SIM SIM SIM NÃO SIM NÃO SIM SIM NÃO NÃO NÃO SIM NÃO OBS.: Eventualmente, por determinação do Banco Central do Brasil, os motivos de devolução de cheques podem sofrer atualizações. Caso seja apresentado motivo de devolução não listado nesta tabela, a respectiva descrição pode ser obtida junto ao gerente da sua conta. TABELA 10 – Mensagem Informativa (código de ocorrência = 02 na Posição 109 a 110) CÓD. MENSAGEM INFORMATIVA 01 CEP SEM ATENDIMENTO DE PROTESTO NO MOMENTO 02 ESTADO COM DETERMINAÇÃO LEGAL QU EIMPEDE A INSCRIÇÃO DE INADIMPLENTES NOS CADASTROS DE PROTEÇÃO AO CRÉDITO NO PRAZO SOLICITADO – PRAZO SUPERIOR AO SOLICITADO 03 BOLETO NÃO LIQUIDADO NO DESCONTO DE DUPLICATAS E TRANSFERIDO PARA COBRANÇA SIMPLES TABELA 11 – Instrução de Negativação Expressa rejeitada (código de ocorrência = 74 na Posição 109 a 110) CÓD. OCORRÊNCIA 6007 INCLUSÃO BLOQUEADA FACE A DETERMINAÇÃO JUDICIAL 6015 INCONSISTÊNCIAS NAS INFORMAÇÕES DE ENDEREÇO 6023 TÍTULO JÁ DECURSADO 6031 INCLUSÃO CONDICIONADA A APRESENTAÇÃO DE DOCUMENTO DE DÍVIDA 6163 EXCLUSÃO NÃO PERMITIDA, REGISTRO SUSPENSO 6171 EXCLUSÃO PARA REGISTRO INEXISTENTE 6379 REJEIÇÃO POR DADO(S) INCONSISTENTE(S) TABELA 12 – Negativação Expressa informacional (código de ocorrência = 79 na Posição 109 a 110) CÓD. OCORRÊNCIA 6049 INFORMAÇÃO DOS CORREIOS – MUDOU-SE 6056 INFORMAÇÃO DOS CORREIOS – DEVOLVIDO POR INFORMAÇÃO PRESTADA PELO SINDICO OU PORTEIRO 6064 INFORMAÇÃO DOS CORREIOS – DEVOLVIDO POR INCONSISTÊNCIA NO ENDEREÇO 6072 INFORMAÇÃO DOS CORREIOS – DESCONHECIDO 6080 INFORMAÇÃO DOS CORREIOS – RECUSADO JANEIRO 2017 Cobrança CNAB 400 33 6098 INFORMAÇÃO DOS CORREIOS – AUSENTE 6106 INFORMAÇÃO DOS CORREIOS – NÃO PROCURADO 6114 INFORMAÇÃO DOS CORREIOS – FALECIDO 6122 INFORMAÇÃO DOS CORREIOS – NÃO ESPECIFICADO 6130 INFORMAÇÃO DOS CORREIOS – CAIXA POSTAL INEXISTENTE 6148 INFORMAÇÃO DOS CORREIOS – DEVOLUÇÃO DO COMUNICADO DO CORREIO 6155 INFORMAÇÃO DOS CORREIOS – OUTROS MOTIVOS 6478 AR - ENTREGUE COM SUCESSO 6486 INCLUSAO PARA REGISTRO JA EXISTENTE/RECUSADO 6494 AR - CARTA EXTRAVIADA E NÃO ENTREGUE 6502 AR - CARTA ROUBADA E NÃO ENTREGUE 6510 AR - AUSENTE - ENCAMINHADO PARA ENTREGA INTERNA 6528 AR INUTILIZADO - NÃO RETIRADO NOS CORREIOS APÓS 3 TENTATIVAS 6536 AR - ENDERECO INCORRETO 6544 AR - NAO PROCURADO – DEVOLVIDO AO REMETENTE 6551 AR - NÃO ENTREGUE POR FALTA DE APRESENTAR DOCUMENTO COM FOTO 6569 AR - MUDOU-SE 6577 AR - DESCONHECIDO 6585 AR - RECUSADO 6593 AR - ENDERECO INSUFICIENTE 6601 AR - NAO EXISTE O NUMERO INDICADO 6618 AR – AUSENTE 6627 AR - CARTA NAO PROCURADA NA UNIDADE DOS CORREIOS 6635 AR – FALECIDO 6643 AR - DEVIDO A DEVOLUCAO DO COMUNICADO DO CORREIO (21) QUANTIDADE E VALOR TOTAL DE BOLETOS Esses campos referem-se às quantidades e valores dos boletos à vencer registrados no Itaú, nas diversas modalidades de cobrança. (22) AVISO BANCÁRIO Refere-se ao código do extrato de Movimentação de Títulos (MT) associado a esse movimento. (23) NÚMERO DO BOLETO/USO DO ITAÚ (ANEXO 1) Para efetuar corretamente o recebimento de um título, o Itaú necessita que o campo \"Nosso Número\" do boleto de cobrança esteja preenchido com o número da carteira de cobrança, o número do boleto e seu DAC - Dígito de Auto Conferência (formato: CCC/NNNNNNNN-D). O próprio Banco se encarrega do cálculo do DAC e sua impressão, quando se tratar de cobrança com registro ou fornecer boletos parcialmente preenchidos. Para todas as carteiras de cobrança do Itaú o DAC do \"Nosso Número\" é calculado a partir dos campos : Agência, Conta do BENEFICIÁRIO (sem DAC), Número da carteira e \"Nosso Número\", exceto as carteiras escriturais e na modalidade direta as carteiras 126, 131, 145, 150 e 168, cujo DAC do \"Nosso Número\" e composto apenas dos campos : Carteira e Nosso Número, mas todos calculados através do Módulo 10, cuja explicação vem a seguir. Multiplica-se cada algarismo do número formado pela composição dos campos acima pela sequência de multiplicadores 2, 1, 2, 1, 2, 1, 2 (posicionados da direita para a esquerda). A seguir, somam-se os JANEIRO 2017 Cobrança CNAB 400 34 algarismos dos produtos e o total obtido é dividido por 10. O DAC é a diferença entre o divisor (10) e o resto da divisão: 10 - (RESTO DA DIVISÃO) = DAC. Se o resto da divisão for zero, o DAC será zero. Exemplo, considerando-se os seguintes dados:  nº da agência: 0057  nº da subcarteira: 109  nº da conta corrente, sem o DAC: 72192  nosso número: 98712345 1º - Montagem do campo e multiplicação: Agência C/C Cart. Nosso Número 0 0 5 7 / 7 2 1 9 2 / 1 0 9 / 9 8 7 1 2 3 4 5 x 1 2 1 2 1 2 1 2 1 2 1 2 1 2 1 2 1 2 1 2 ------------------------------------------------------------------------------- = 0 0 5 14 7 4 1 18 2 2 0 18 9 16 7 2 2 6 4 10 2º - Soma dos dígitos dos produtos (cada dígito é somado individualmente), como segue: 0 + 0 + 5 + 1 + 4 + 7 + 4 + 1 + 1 + 8 + 2 + 2 + 0 + 1 + 8 + 9 + 1 + 6 + 7 + 2 + 2 + 6 + 4 + 1 + 0 = 82 3º - Divisão e resultado: 82 | 10 2 8 ===========> 10 - 2 = 8 (DAC) Portanto a impressão do campo Nosso Número no boleto deve ser \"109/98712345-8\" (24) LITERAL DE MOEDA (ANEXO 1) Literal da moeda a ser impressa no boleto identificando a espécie da moeda. Se o valor vier expresso em Reais, a informação será ignorada e será impresso R$ no boleto. (25) LOCAL DE PAGAMENTO / AGÊNCIA COBRADORA (ANEXO 1) O campo “agência cobradora” deve ser preenchido com brancos. O Itaú definirá o código desta agência mediante o CEP do PAGADOR. Na área do boleto reservada para indicar o LOCAL DE PAGAMENTO, colocar:  Para boletos COM REGISTRO (conforme item (5) da nota 4) ATÉ O VENCIMENTO, PAGUE EM QUALQUER BANCO OU CORRESPONDENTE NÃO BANCÁRIO. APÓS O VENCIMENTO, ACESSE ITAU.COM.BR/BOLETOS E PAGUE EM QUALQUER BANCO OU CORRESPONDENTE NÃO BANCÁRIO.  Para boletos SEM REGISTRO (conforme item (5) da nota 4) ATÉ O VENCIMENTO, PAGUE EM QUALQUER BANCO OU CORRESPONDENTE NÃO BANCÁRIO. APÓS O VENCIMENTO PAGUE NO ITAÚ (26) INSTRUÇÕES (ANEXO 1) JANEIRO 2017 Cobrança CNAB 400 35 Área do boleto reservada para instruções, formada por nove linhas de 69 caracteres. Essa área será de livre utilização pela Empresa, que informará o conteúdo de cada linha a ser impressa através dos registros com códigos de layout \"2 e 3\". Caso não haja nenhuma instrução, não são necessários os registros com códigos de layout \"2 e 3\". Caso existam até cinco linhas de instruções, não é necessário o registro com código de layout \"3\". É proibido o repasse e mensagens de tarifa no boleto ao pagador. (27) INSTRUÇÃO/ALEGAÇÃO CANCELADA Deve ser preenchido na remessa somente quando utilizados, na posição 109-110, os códigos de ocorrência 35 – Cancelamento de Instrução e 38 – beneficiário não concorda com alegação do pagador. Para os demais códigos de ocorrência este campo deverá ser preenchido com zeros. Obs.: No arquivo retorno será informado o mesmo código da instrução cancelada, e para o cancelamento de alegação de pagador não há retorno da informação. (28) CÓDIGO DE LIQUIDAÇÃO Indica o canal utilizado pelo pagador para pagamento do boleto e, para clientes que possuem o crédito das liquidações separado em função do recurso utilizado no pagamento, indica se o crédito do valor correspondente estará “disponível” ou “a compensar” na data do lançamento em conta corrente. CÓD AA AC CAIXA ELETRÔNICO ITAÚ PAGAMENTO EM CARTÓRIO AUTOMATIZADO DESCRIÇÃO AO ACERTO ONLINE BC BF BL B0 B1 B2 B3 B4 B5 B6 B7 BANCOS CORRESPONDENTES ITAÚ BANKFONE ITAÚ BANKLINE OUTROS BANCOS – RECEBIMENTO OFF-LINE OUTROS BANCOS – PELO CÓDIGO DE BARRAS OUTROS BANCOS – PELA LINHA DIGITÁVEL OUTROS BANCOS – PELO AUTO ATENDIMENTO OUTROS BANCOS – RECEBIMENTO EM CASA LOTÉRICA OUTROS BANCOS – CORRESPONDENTE OUTROS BANCOS – TELEFONE OUTROS BANCOS – ARQUIVO ELETRÔNICO (Pagamento Efetuado por meio de troca de arquivos) CC AGÊNCIA ITAÚ – COM CHEQUE DE OUTRO BANCO ou (CHEQUE ITAÚ)* CI CK CP CORRESPONDENTE ITAÚ SISPAG – SISTEMA DE CONTAS A PAGAR ITAÚ AGÊNCIA ITAÚ – POR DÉBITO EM CONTA CORRENTE, CHEQUE ITAÚ* OU DINHEIRO DG AGÊNCIA ITAÚ – CAPTURADO EM OFF-LINE LC EA Q0 RA ST PAGAMENTO EM CARTÓRIO DE PROTESTO COM CHEQUE TERMINAL DE CAIXA AGENDAMENTO – PAGAMENTO AGENDADO VIA BANKLINE OU OUTRO CANAL ELETRÔNICO E LIQUIDADO NA DATA INDICADA DIGITAÇÃO – REALIMENTAÇÃO AUTOMÁTICA PAGAMENTO VIA SELTEC** * Se utiliza BLOQUEIO DE CHEQUE o retorno de CHEQUE ITAÚ será devolvido como CC. ** Sistema Eletrônico de Liquidação de Títulos em Cartório RECURSO DISPONÍVEL A COMPENSAR DISPONÍVEL DISPONÍVEL DISPONÍVEL DISPONÍVEL A COMPENSAR A COMPENSAR A COMPENSAR A COMPENSAR A COMPENSAR A COMPENSAR A COMPENSAR A COMPENSAR A COMPENSAR DISPONÍVEL DISPONÍVEL DISPONÍVEL DISPONÍVEL A COMPENSAR DISPONÍVEL DISPONÍVEL DISPONÍVEL DISPONÍVEL JANEIRO 2017 Cobrança CNAB 400 36 (29) ENDEREÇO DE E-MAIL Para as carteiras de cobrança escriturais, onde o Itaú mantém o registro da cobrança e se encarrega de imprimir e postar os boletos (carteiras identificadas na nota ‘5’), tendo sido acertado previamente entre o beneficiário e o pagador, o boleto poderá ser remetido ao pagador por e-mail, destinando-o ao endereço especificado neste campo. Se o endereço de e-mail informado for inválido, o boleto será impresso e enviado pelos meios tradicionais. Neste caso o beneficiário será informado no arquivo retorno pela ocorrência ‘25’ e motivo ‘1826’ (conforme nota ‘20’ e tabela ‘6’). Se o pagador não acessar o boleto até 5 dias úteis antes do vencimento, desde que já tenham se passado 2 dias úteis do envio do e-mail, o boleto será impresso e enviado pelos meios tradicionais. Neste caso, o beneficiário será informado no arquivo retorno pela ocorrência ‘25’ e motivo ‘1818’ (conforme nota ‘20’ e tabela ‘6’). 30) SACADOR/AVALISTA Existindo a figura do Sacador/Avalista, é imprescindível informar corretamente todos os dados a ele relacionados, conforme lei federal 12.039, que exige os dados completos para facilitar o contato entre pagador e o emissor e, caso venha a ser solicitado o protesto da dívida, é facultado aos Cartórios de Protestos de Títulos exigirem tais dados com exatidão. CÓD DE INSCRIÇÃO NÚMERO DE INSCRIÇÃO OBSERVAÇÃO 00 01 02 PREENCHER COM ZEROS NÃO HÁ SACADOR/AVALISTA. NÚMERO DO CPF NÚMERO DO CNPJ INFORMAR O CPF DO SACADOR/AVALISTA. INFORMAR O CNPJ DO SACADOR/AVALISTA. Obs.: Verificar o preenchimento do registro detalhe 02 nas posições 002-003 o preenchimento correspondente ao tipo de inscrição do Sacador Avalista. (31) DATA DE EMISSÃO (DDMMAA) A data informada neste campo deve ser a mesma data de emissão do título de crédito (Duplicata de Serviço / Duplicata Mercantil / Nota Fiscal, etc), que deu origem a esta Cobrança. Existindo divergência, na existência de protesto, a documentação poderá não ser aceita pelo Cartório. (32) TIPO DE VALOR ARQUIVO REMESSA: O campo Tipo de Valor (posição 394 do registro Tipo 4) define se o rateio de crédito deve ser feito por percentual (%) ou em valor (R$): CONTEÚDO DESCRIÇÃO 1 2 3 4 RATEIO DE CRÉDITO POR PERCENTUAL (%) – VALOR NOMINAL DO TÍTULO (*) RATEIO DE CRÉDITO EM VALOR (R$) – VALOR NOMINAL DO TÍTULO (*) RATEIO DE CRÉDITO POR PERCENTUAL (%) – VALOR LÍQUIDO RECEBIDO (**) RATEIO DE CRÉDITO EM VALOR (R$) – VALOR LÍQUIDO RECEBIDO, RATEADO PROPORCIONALMENTE AOS VALORES DE RATEIO INFORMADOS NA REMESSA (**) (*) Para os Tipos de Valor “1” e “2”, o rateio é feito sobre o valor nominal do título e eventuais diferenças de pagamentos a maior (juros) ou a menor (desconto) são contabilizadas na conta de crédito do beneficiário. (**) Para os Tipos de Valor “3” e “4”, o rateio é feito sobre o valor liquido recebido em pagamento. O valor líquido recebido corresponde ao: Valor Nominal – Desconto + Juros. Portanto, os campos VALOR de cada conta de crédito devem obedecer aos seguintes formatos: - Rateio por PERCENTUAL: formato “9(10)V9(3)”; - Rateio em VALOR: formato “9(11)V9(2)”. ARQUIVO RETORNO: JANEIRO 2017 Cobrança CNAB 400 37 Nas confirmações das entradas, os campos VALOR são informados com o mesmo formato (percentual ou valor) definido no arquivo remessa; Na ocorrência de liquidação, os campos VALOR apresentam o valor efetivamente creditado na conta de crédito. (33) AGÊNCIA CONTA DO CHEQUE Este campo será preenchido da seguinte forma: AAAA00CCCCCD Onde: AAAA - Número da agência de débito do cheque; 00 - Dois zeros; CCCCC - Número da conta de débito do cheque; D - Dac da agência/conta de débito do cheque. (34) BOLETO DDA Este serviço requer cadastramento prévio junto ao Banco. Para as ocorrência de confirmação de entrada (código de ocorrência “02”, nas posições 109 e 110 do registro de transação) o arquivo retorno de Cobrança passará a apresentar neste campo a indicação de Boleto DDA, conforme segue: CÓDIGO DESCRIÇÃO 0 1 (35) - MULTA NÃO É BOLETO DDA (PAGADOR NÃO ADERIU AO DDA ATÉ O MOMENTO) BOLETO DDA (PAGADOR ADERIU AO DDA EM AO MENOS UM BANCO DE RELACIONAMENTO) O código da Multa irá determinar como o sistema irá atribuir o valor da multa. CÓDIGO DESCRIÇÃO 0 1 2 NÃO REGISTRA A MULTA VALOR EM REAIS (FIXO) VALOR EM PERCENTUAL COM DUAS CASAS DECIMAIS CONFORME ESTRUTURA DO CAMPO • Qualquer informação enviada diferente das opções informadas no domínio acima, o cliente receberá erro de registro inválido no tipo 1. • Caso seja informado o domínio '0', o cliente não irá enviar a multa, mas poderá utilizar alguma outra função que esteja disponível para o registro tipo 2 no futuro. DATA DA MULTA Data da Multa, data que passa incidir a cobrança da Multa. Campo deve ser formatado como DDMMAAAA. A data informada deve ser Maior ou igual a data de vencimento do título. MULTA O Campo Valor / Percentual define se a multa será informada em Valor nominal ou percentual * O campo valor deve obedecer ao seguinte formato: - Percentual: Formato “9(11)V9(2)” - Valor: Formato “9(11)V9(2) •* O percentual será aplicado sobre o Valor Nominal do título JANEIRO 2017 Cobrança CNAB 400 38 • Não poderá ser enviado valor da multa igual ou maior que o valor do próprio título , considerado o valor Nominal registrado • Não poderá ser enviado percentual da multa igual ou maior que 100% • Caso o cliente comande uma instrução de Alteração do valor nominal do título, se houver registro / instrução de Multa o sistema irá: - Recalcular o valor da multa se no registro o cliente informou % de Multa - Manter o valor da Multa se no registro o cliente informou a Multa em Valor JANEIRO 2017 Cobrança CNAB 400 39 5. Condições Personalizadas Para garantir um nível de operação mais personificado, considerando-se particularidades de cada cliente, várias características dos arquivos podem ser cadastradas de acordo com suas necessidades. Essas características são denominadas Indicadores. O cadastramento dos indicadores é feito pelo Itaú conforme solicitado pelo cliente. A seguir, relacionamos os indicadores mais utilizados. Aqueles marcados com (*) são o valor default (assumidos pelo Banco) caso não haja nenhum cadastramento. 04.2 - HEADER/TRAILER (*) 0 - Por Arquivo 1 - Por Conta 12.5 - CONCESSÃO DE ABATIMENTO Indica se, na concessão de abatimento, o cliente deseja que seja alterado o valor do título ou apenas seja emitido um aviso ao PAGADOR. 0 - Altera valor (*) 1 - Emite aviso 13.3 - BANCOS CORRESPONDENTES Indica se o cliente aceita ou não, bancos correspondentes como depositário dos títulos. (*) 0 - Aceita para Escritural, e Direta. 1 - Não aceita para Escritural e aceita para Direta 3 - Não aceita para nenhuma modalidade 4 - Aceita para Escritural e não aceita para Direta 16.6 - MOEDA VARIÁVEL Indica se o cliente deseja enviar quantidade de moeda no campo valor do título (*) 0 - Não envia 2 - Envia 19.0 - DESCONTO NO ARQUIVO REMESSA Indica se o cliente envia mais de um desconto no arquivo (o 2º e 3º desconto enviado no campo \"Sacador/Avalista\"). (*) 0 - Somente um desconto 1 - Mais de um desconto 22.4 - RELATÓRIO DO MOVIMENTO (*) 0 - Não tem 1 - Tem JANEIRO 2017 Cobrança CNAB 400 40 23.2 - INFORMAÇÃO DA LIQUIDAÇÃO NO ARQUIVO RETORNO Indica em que momento a liquidação é informada na fita retorno. (*) 0 - No crédito (2154) 1 - No processamento (dia seguinte ao pagamento - B4EP) 2 - Informa duas vezes, no crédito e no processamento. A identificação se dá pela posição 107 do registro de transação do Arquivo Retorno, que contém os seguintes códigos: I - Informativo (Processamento) C - Contábil (No crédito) 25.7 - TIPOS DE REGISTROS NA FITA RETORNO (*) 0 - Todos os registros 1 - Só os registros de liquidações 2 - Todos os registros; exceto as confirmações de entrada. 36.4 - SEPARAÇÃO DE DESCONTO E ABATIMENTO Indica se na liquidação do título o valor do desconto deverá ser separado do valor do abatimento. (*) 0 - Não separa 1 - Separa Descontos/Abatimento 2 - Separa Juros/Correção Monetária 3 - Separa Desconto/Abatimento e Juros/Correção Monetária 37.2 - RETORNO DE INSTRUÇÕES/OCORRÊNCIAS Indica se o cliente deseja receber confirmação das instruções comandadas para os seus títulos. 0 - Não retorna 1 - Retorna só instrução do beneficiário 2 - Retorna só ocorrências do pagador (*) 3 - Retorna instruções do beneficiário e ocorrências do pagador 38.0 - RETORNO DE REGISTROS REJEITADOS Indica se o cliente deseja receber os registros recusados pelo sistema de cobrança do Banco. 0 - Não retorna 1 - Retorna somente as rejeições de entrada (*) 2 - Retorna todas as rejeições JANEIRO 2017 Cobrança CNAB 400 41 40.6 - DATA DE CRÉDITO Indica se o cliente deseja receber a data do crédito. 0 - Data do crédito no registro Header 1 - Data do crédito no registro de Transação (*) 2 - Data do crédito no registro Header e Transação 3 - Não recebe informação da Data do Crédito 41.4 - BOLETO ELETRÔNICO DDA Indica se o cliente deseja receber a informação de Boleto DDA. (*) 0 - Não retorna 1 - Retorna 42.2 - ALEGAÇÃO DO PAGADOR - BOLETO ELETRÔNICO DDA Indica se o cliente deseja receber a informação de alegação do pagador de Boletos DDA. (*) 0 - Não retorna 1 - Retorna 47.1 - RETORNO DE TARIFAS 0 - Não retorna (*) 1 – Retorna JANEIRO 2017 Cobrança CNAB 400 42 6. Testes e Operações Para se assegurar o perfeito funcionamento do sistema, devem ser transmitidos ao banco, arquivos de teste com dados simulados nas cobranças que possuam Arquivos Remessa, formatados conforme layout descrito neste manual e contendo no máximo 30 registros. Com base nesse arquivo, o Itaú providenciará um Arquivo Retorno contendo a confirmação e /ou rejeição das entradas para que o cliente teste o seu sistema e no caso da cobrança com emissão do boleto de cobrança pelo Itaú, estes serão impressos e encaminhados a agência do cliente limitados a 30 Boletos por agência / conta. Consideram-se concluída a fase de teste após terem sido esclarecidas todas as dúvidas e irregularidades, cabendo ao cliente a decisão de passar para a fase de produção. É possível fazer teste mesmo estando em produção. Validador de Layout de Arquivos O Validador de Arquivos de layout possibilita à você agilizar os processos de validação de layout de cobrança no momento que sua empresa envia o arquivo, por meio do Itaú Empresas na Internet. Ao enviar o arquivo, você conseguirá visualizar imediatamente o relatório de erros de estrutura no layout, antecipando sua correção antes da validação em ambiente de Teste. Principais Benefícios:  Agilidade no envio de arquivos de cobrança;  Redução de tempo e custo de desenvolvimento de seus sistemas;  Conveniência, com a disponibilização do relatório de erros de forma on-line;  Disponibilidade, sem limites de utilização. Mais uma Acesse agora o menu Transmissão de Arquivo > Validação > Layout de Arquivo. inovação a serviço da conveniência, que o Itaú oferece a sua empresa. Registro Header do Arquivo Arquivo | Registro de Detalhe Registro Trailer do Arquivo => => => => => => { Reg. = 0 } { Reg. = 6 / layout = 1 obrigatório} { Reg. = 6 / layout = 2 opcional } { Reg. = 6 / layout = 3 opcional } { Reg. = 6 / layout = 4 opcional } { Reg. = 9 } JANEIRO 2017 Cobrança CNAB 400 43 ARQUIVO REMESSA REGISTRO HEADER DE ARQUIVO TAMANHO DO REGISTRO = 400 BYTES NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO HEADER 001 001 9(01) OPERAÇÃO TIPO DE OPERAÇÃO - REMESSA LITERAL DE REMESSA IDENTIFICAÇÃO POR EXTENSO DO MOVIMENTO CÓDIGO DO SERVIÇO IDENTIFICAÇÃO DO TIPO DE SERVIÇO LITERAL DE SERVIÇO IDENTIFICAÇÃO POR EXTENSO DO TIPO DE SERVIÇO AGÊNCIA ZEROS CONTA DAC AGÊNCIA MANTENEDORA DA CONTA COMPLEMENTO DE REGISTRO NÚMERO DA CONTA CORRENTE DA EMPRESA DÍGITO DE AUTO CONFERÊNCIA AG/CONTA EMPRESA 002 002 003 009 010 011 012 026 027 030 031 032 033 037 038 038 9(01) X(07) 9(02) X(15) 9(04) 9(02) 9(05) 9(01) 0 1 REMESSA 01 COBRANCA “00” BRANCOS COMPLEMENTO DO REGISTRO 039 046 X(08) NOME DA EMPRESA NOME POR EXTENSO DA \"EMPRESA MÃE\" 047 076 X(30) CÓDIGO DO BANCO Nº DO BANCO NA CÂMARA DE COMPENSAÇÃO 077 079 9(03) 341 NOME DO BANCO NOME POR EXTENSO DO BANCO COBRADOR 080 094 X(15) BANCO ITAU SA DATA DE GERAÇÃO DATA DE GERAÇÃO DO ARQUIVO 095 100 9(06) DDMMAA BRANCOS COMPLEMENTO DO REGISTRO 101 394 X(294) NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 395 400 9(06) 000001 X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA JANEIRO 2017 Cobrança CNAB 400 44 ARQUIVO REMESSA REGISTRO EMISSÃO DE BOLETO TAMANHO DO REGISTRO = 400 BYTES NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO TRANSAÇÃO CÓDIGO DE LAYOUT IDENTIFICAÇÃO DO LAYOUT PARA O REGISTRO AGÊNCIA ZEROS CONTA DAC AGÊNCIA MANTENEDORA DA CONTA COMPLEMENTO DE REGISTRO NÚMERO DA CONTA CORRENTE DA EMPRESA DÍGITO DE AUTO CONFERÊNCIA AG/CONTA EMPRESA Nº DA CARTEIRA Nº DA CARTEIRA NO BANCO NOSSO NÚMERO IDENTIFICAÇÃO DO TÍTULO NO BANCO DAC DAC DO NOSSO NÚMERO 001 001 002 002 003 006 007 008 009 013 014 014 015 017 018 025 026 026 027 027 9(01) 9(01) 9(04) 9(02) 9(05) 9(01) 9(03) 9(08) 9(01) 9(01) 6 1 “00” NOTA 23 0 = R$ 1 = VARIÁVEL CÓDIGO DA MOEDA LITERAL DE MOEDA INDICA SE O VALOR DO TÍTULO ESTÁ SENDO INFORMADO EM REAL OU EM MOEDA VARIÁVEL IDENTIF. DA MOEDA A SER IMPRESSA NO BOLETO (PARA MOEDA VARIÁVEL) 028 031 X(04) NOTA 24 VALOR DO TÍTULO VALOR DO TÍTULO 032 044 9(11)V9(2) (*) SEU NÚMERO VENCIMENTO ESPÉCIE NÚMERO DO DOCUMENTO NA EMPRESA DATA DE VENCIMENTO DO TÍTULO ESPÉCIE DO TÍTULO 045 054 055 060 061 062 X(10) 9(06) X(02) ACEITE IDENTIFICAÇÃO DE TÍTULO ACEITO OU NÃO ACEITO 063 063 X(01) DATA DE EMISSÃO DATA DE EMISSÃO DO TÍTULO 064 069 9(06) CÓD. DE INSCRIÇÃO IDENTIFICAÇÃO DO TIPO DE INSCRIÇÃO DO PAGADOR 070 071 9(02) Nº DE INSCRIÇÃO NÚMERO DE INSCRIÇÃO DO PAGADOR NOME BRANCOS NOME DO PAGADOR COMPLEMENTO DO REGISTRO LOGRADOURO RUA, NÚMERO E COMPLEMENTO DO PAGADOR BAIRRO CEP CIDADE ESTADO BAIRRO DO PAGADOR CÓDIGO DE ENDEREÇAMENTO POSTAL DO PAGADOR CIDADE DO PAGADOR ESTADO (UF - UNIDADE DA FEDERAÇÃO) DO PAGADOR SACADOR/AVALISTA NOME DO SACADOR/AVALISTA BRANCOS COMPLEMENTO DE REGISTRO LOCAL DE PGTO 1 LOCAL PARA PAGAMENTO DO TÍTULO - LINHA 1 LOCAL DE PGTO 2 LOCAL PARA PAGAMENTO DO TÍTULO - LINHA 2 072 086 087 116 117 125 126 165 166 177 178 185 186 200 201 202 203 232 233 236 237 291 292 346 9(15) X(30) X(09) X(40) X(12) 9(08) X(15) X(02) X(30) X(04) X(55) X(55) CÓD. DE INSCRIÇÃO. IDENTIF. TIPO DE INSCRIÇÃO DO SACADOR/AVALISTA 347 348 9(02) Nº DE INSCRIÇÃO NÚMERO DE INSCRIÇÃO DO SACADOR/AVALISTA BRANCOS COMPLEMENTO DO REGISTRO NÚM. SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 349 363 364 394 395 400 9(15) X(31) 9(06) NOTA 18 DDMMAA NOTA 10 A=SIM N=NÃO DDMMAA 01=CPF 02=CNPJ CPF OU CNPJ NOTA 25 NOTA 25 01=CPF 02=CNPJ X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA (*) Para títulos em moeda variável o valor deverá ser informado na picture 9(08)V9(05). JANEIRO 2017 Cobrança CNAB 400 45 LINHA 1 LINHA 2 LINHA 3 LINHA 4 LINHA 5 LINHA 6 LINHA 7 LINHA 8 LINHA 9 ARQUIVO REMESSA REGISTRO EMISSÃO DE BOLETO TAMANHO DO REGISTRO = 400 BYTES NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DO REGISTRO IDENTIFICAÇÃO DO REGISTRO CÓDIGO DO LAYOUT IDENTIFICAÇÃO DO LAYOUT PARA O REGISTRO 001 001 002 002 003 071 9(01) 9(01) X(69) 6 2 NOTA 26 CONTEÚDO DA 1ª LINHA DE IMPRESSÃO DA ÁREA \"INSTRUÇÕES” DO BOLETO CONTEÚDO DA 2ª LINHA DE IMPRESSÃO DA ÁREA \"INSTRUÇÕES\" DO BOLETO 072 140 X(69) NOTA 26 CONTEÚDO DA 3ª LINHA DE IMPRESSÃO DA ÁREA \"INSTRUÇÕES\" DO BOLETO 141 209 X(69) NOTA 26 CONTEÚDO DA 4ª LINHA DE IMPRESSÃO DA ÁREA \"INSTRUÇÕES\" DO BOLETO 210 278 X(69) NOTA 26 CONTEÚDO DA 5ª LINHA DE IMPRESSÃO DA ÁREA \"INSTRUÇÕES\" DO BOLETO 279 347 X(69) NOTA 26 BRANCOS COMPLEMENTO DO REGISTRO 348 394 X(47) NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 395 400 9(06) X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA ARQUIVO REMESSA REGISTRO EMISSÃO DE BOLETO TAMANHO DO REGISTRO = 400 BYTES NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DO REGISTRO IDENTIFICAÇÃO DO REGISTRO CÓDIGO DO LAYOUT IDENTIFICAÇÃO DO LAYOUT PARA O REGISTRO 001 001 9(01) 002 002 003 071 9(01) X(69) 6 3 NOTA 26 CONTEÚDO DA 6ª LINHA DE IMPRESSÃO DA ÁREA \"INSTRUÇÕES\" DO BOLETO CONTEÚDO DA 7ª LINHA DE IMPRESSÃO DA ÁREA \"INSTRUÇÕES\" DO BOLETO 072 140 X(69) NOTA 26 CONTEÚDO DA 8ª LINHA DE IMPRESSÃO DA ÁREA \"INSTRUÇÕES\" DO BOLETO 141 209 X(69) NOTA 26 CONTEÚDO DA 9ª LINHA DE IMPRESSÃO DA ÁREA \"INSTRUÇÕES\" DO BOLETO 210 278 X(69) NOTA 26 BRANCOS COMPLEMENTO DO REGISTRO 279 394 X(116) NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 395 400 9(06) X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA ARQUIVO REMESSA REGISTRO EMISSÃO DE BOLETO TAMANHO DO REGISTRO = 400 BYTES NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DO REGISTRO IDENTIFICAÇÃO DO REGISTRO CÓDIGO DO LAYOUT IDENTIFICAÇÃO DO LAYOUT PARA O REGISTRO 001 001 002 002 9(01) 9(01) 6 4 CÓDIGO DE INSCRIÇÃO IDENTIFICAÇÃO DO TIPO DE INSCRIÇÃO DO SACADOR/AVALISTA 003 004 9(002) 01 – CPF 02 - CNPJ NÚMERO DE INSCRIÇÃO NÚMERO DE INSCRIÇÃO DO SACADOR / AVALISTA 005 018 9(014) LOGRADOURO RUA, NÚMERO E COMPLEMENTO DO SACADOR / AVALISTA 019 058 X(040) BAIRRO CEP CIDADE ESTADO BRANCOS BAIRRO DO SACADOR/AVALISTA 059 070 X(012) CÓDIGO DE ENDEREÇAMENTO POSTAL DO SACADOR/AVALISTA 071 078 CIDADE DO SACADOR/AVALISTA 079 093 ESTADO (UF-UNIDADE DA FEDERAÇÃO) DO SACADOR/AVALISTA 094 095 COMPLEMENTAÇÃO DO REGISTRO 9(008) X(015) X(002) X(299) 9(006) 096 394 395 400 NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA JANEIRO 2017 Cobrança CNAB 400 46 ARQUIVO REMESSA REGISTRO TRAILER DE ARQUIVO TAMANHO DO REGISTRO = 400 BYTES NOME DO CAMPO SIGNIFICADO POSIÇÃO PICTURE CONTEÚDO TIPO DE REGISTRO IDENTIFICAÇÃO DO REGISTRO TRAILER BRANCOS COMPLEMENTO DO REGISTRO NÚMERO SEQÜENCIAL NÚMERO SEQÜENCIAL DO REGISTRO NO ARQUIVO 001 001 9(01) 9 002 394 395 400 X(393) 9(06) X = ALFANUMÉRICO 9 = NUMÉRICO V = VÍRGULA DECIMAL ASSUMIDA JANEIRO 2017 Cobrança CNAB 400 47 7. Anexo A - Boleto/Código de Barras 7.1 – Introdução Aos clientes que desejarem efetuar a emissão (impressão) dos boletos na empresa, descreveremos a seguir todas as informações técnicas necessárias para a correta confecção do boleto de pagamento e do código de barras conforme determinado pelo Banco Central do Brasil. Características  Para sistemas de grande porte - deverá dispor de fontes e programas específicos para conversão do registro desejado em código de barras;  Sistemas diversos - deverá obter no mercado ou desenvolver rotinas para impressão de código de barras e boleto. Nota: Não é permitida a utilização de impressora matricial, devido ao elevado índice de rejeição na leitura do código de barras, ocasionado pela má qualidade de impressão. Após concluído o desenvolvimento de seu sistema, obrigatoriamente, deverá ser encaminhada uma amostragem dos boletos ao Itaú, para análise e aprovação. 7.2 – Características do boleto 7.2.1 – Especificações Gerais  Vias e dimensões  Ficha de Compensação – 95 a 108 mm de altura por 170 a 216mm de comprimento;  Recibo do PAGADOR - a critério do Banco/BENEFICIÁRIO.  Disposição das vias:  Formulário contínuo auto-copiativo - a primeira via deverá ser a Ficha de Compensação, ficando a critério do Banco a disposição das demais vias;  Papel A-4 - para se evitar rasuras no código de barras ao ser destacada, a ficha de compensação deve ser impressa no rodapé. Recomenda-se a utilização de microserrilhas entre as vias para evitar danos às informações quando do destacamento.  Gramatura do papel e cor da impressão  Gramatura Ideal 75 g/m2, mínima: 50 g/m2;  Fundo branco com impressão azul ou preta, não se permitindo campos hachurados. 7.2.2 – Especificações das Vias 7.2.2.1 – Ficha de Compensação:       Parte superior esquerda: o nome do banco, podendo conter o seu logotipo e, à direita do nome do banco, número-código/DAC de compensação do banco destinatário, em negrito; Obs. O número/DAC do Itaú é 341-7 e deve ser impresso com caracter de 5 mm e traços ou fios de 1,2 mm; Parte superior direita: deverá haver representação numérica do conteúdo do Código de Barras, conforme especificação adiante; Quadro de impressão: deverá apresentar grade/denominação dos campos conforme modelo constante do anexo 1 deste manual; O tamanho de cada campo (número de posições) poderá variar, desde que obedecidas a mesma disposição do modelo e as dimensões mínimas do formulário; Os campos não utilizados poderão ficar sem indicação; Na parte inferior, abaixo do quadro de impressão: na extremidade direita deverá ser deixado espaço para autenticação mecânica; na extremidade esquerda, o campo é destinado à indicação obrigatória do código de barras, conforme mostra o anexo A deste manual; JANEIRO 2017 Cobrança CNAB 400 48  Na parte inferior, do lado direito da identificação do campo “Autenticação Mecânica”, identificação da ficha (Ficha de Compensação), com dimensão máxima de 2 mm e traços com fios de 0.3mm. 7.2.2.2 Recibo de PAGADOR:    Na parte superior, acima do quadro de impressão deverá ser impressa a identificação Recibo do pagador; Alterações na via Recibo do pagador podem ser admitidas, mas somente com prévia aprovação do Itaú Unibanco S/A Deve conter informações do beneficiário e/ou do Sacador Avalista¹: nome, endereço e número de inscrição no Cadastro de Pessoas Físicas – CPF ou no Cadastro Nacional de Pessoa Jurídica – CNPJ do fornecedor do produto ou serviço. ¹ Sacador Avalista – nos casos que se aplica 7.3 – Layout do Código de Barras 7.3.1 – Tipo Deve ser utilizado o tipo 2 de 5 Intercalado, que tem as seguintes características:  Cinco barras definem um caracter, sendo duas delas, barras largas.  Intercalado significa que os espaços entre as barras também tem significado de maneira análoga às barras.  Definem apenas caracteres numéricos. Todo código 2 de 5 Intercalado deve possuir um conjunto de barras e espaços para definir um pseudo caracter de Start e outro para um pseudo caracter de Stop. Por causa da intercalação os campos codificados em 2 de 5 Intercalado devem possuir número par de caracteres. 7.3.2 – Conteúdo Deve conter 44 (quarenta e quatro) posições, sendo: POSIÇÃO TAMANHO PICTURE CONTEÚDO 01 a 03 04 a 04 05 a 05 06 a 09 10 a 19 20 a 22 23 a 30 31 a 31 32 a 35 36 a 40 41 a 41 42 a 44 03 01 01 04 10 03 08 01 04 05 01 03 9(03) 9(01) 9(01) 9(04) Código do Banco na Câmara de Compensação = '341' Código da Moeda = '9' DAC código de Barras (Anexo 2) Fator de Vencimento (Anexo 6) 9(08)V(2) Valor 9(03) 9(08) 9(01) 9(04) 9(05) 9(01) 9(03) Carteira Nosso Número DAC [Agência /Conta/Carteira/Nosso Número] (Anexo 4) N.º da Agência BENEFICIÁRIO N.º da Conta Corrente DAC [Agência/Conta Corrente] (Anexo 3) Zeros JANEIRO 2017 Cobrança CNAB 400 49 7.3.3 – Dimensões do Código de Barras: Comprimento total igual a 103 (Cento e três) mm e altura total igual a 13 (treze) mm. 7.3.4 – Local de Impressão na Ficha de Compensação: Na parte inferior do documento, abaixo do quadro de impressão na extremidade esquerda, respeitando-se:   Espaço mínimo de 5 (cinco) mm (zona de silêncio) entre a margem esquerda do formulário e o início da impressão do código; Distância mínima de 12 (doze) mm desde a margem inferior da ficha até o centro do código de barras. OBS: todas as especificações devem ser atendidas, no sentido de preservar a leitura do código. 7.4 – Representação Numérica do Código de Barras (IPTE) 8.4.1 – Conteúdo A representação numérica do código de barras é distribuída em cinco campos, sendo os três primeiros consistidos por DAC (Dígito de Autocontrole - Módulo 10) e, entre cada campo, espaço equivalente a uma posição; no quarto campo, indicado, isoladamente, o DAC (Módulo 11) do Código de Barras: AAABC.CCDDX DDDDD.DEFFFY FGGGG.GGHHHZ K UUUUVVVVVVVVVV Campo 1 Campo 2 Campo 3 4 Campo 5 Campo 1 (AAABC.CCDDX) AAA = Código do Banco na Câmara de Compensação (Itaú=341) B = Código da moeda = \"9\" (*) CCC = Código da carteira de cobrança DD = Dois primeiros dígitos do Nosso Número X = DAC que amarra o campo 1 (Anexo3) (*) Este dígito será sempre “9”, porque independente do índice ou moeda utilizada, estes deverão ser convertidos no recebimento para a moeda (R$). Campo 2 (DDDDD.DEFFFY) DDDDDD= Restante do Nosso Número E = DAC do campo [Agência/Conta/Carteira/ Nosso Número] FFF = Três primeiros números que identificam a Agência Y = DAC que amarra o campo 2 (Anexo 3) Campo 3 (FGGGG.GGHHHZ) F = Restante do número que identifica a agência GGGGGG = Número da conta corrente + DAC HHH = Zeros ( Não utilizado ) Z = DAC que amarra o campo 3 (Anexo 3) JANEIRO 2017 Cobrança CNAB 400 50 Campo 4 (K) K = DAC do Código de Barras (Anexo 2) Campo 5 (UUUUVVVVVVVVVV) UUUU= Fator de vencimento VVVVVVVVVV= Valor do Título (*) (*) Sem edição (sem ponto e vírgula), com tamanho fixo (10). Em casos de cobrança com valor em aberto (o valor a ser pago é preenchido pelo próprio PAGADOR) ou cobrança em moeda variável, deve ser preenchido com zeros. Obs. 1: Apesar de constar o DAC do código de Barras (campo 4) é necessária a existência dos DAC's específicos para os campos 1, 2 e 3 (estes dígitos não são representados no código de barras). Obs. 2: Deve ser inserido um ponto (\".\") após os cinco dígitos iniciais dos campos 1, 2 e 3. Este ponto facilita a digitação (cinco dígitos é o número ideal para memorização do digitador). O campo 5 não é separado por ponto (\".\"), pois representa a data de vencimento e o valor do título. Obs. 3: Os dados da representação numérica não se apresentam na mesma ordem do código de barras. 8.4.2 – Dimensões e Localização A representação numérica do código de barras deverá ser impressa em caracteres de 3,5 a 4,5 mm e traços ou fios de 0,3 mm na parte superior direita, iniciando-se logo após o número Código/DAC do Banco, conforme mostrado no Anexo 1. JANEIRO 2017 Cobrança CNAB 400 51 Anexo 1 – Modelo de Ficha de Compensação de Boleto / cuidados no preenchimento Ficha de compensação: seguir obrigatoriamente o modelo acima com dimensões de 95 a 108 mm de altura por 170 a 216 mm de comprimento; Recibo do pagador: observar preferencialmente o modelo acima, devendo conter no mínimo as informações deste modelo. 1 – NOME DO BANCO DESTINATÁRIO JANEIRO 2017 Cobrança CNAB 400 52 Deve ser obrigatoriamente indicado na margem superior esquerda da Ficha de Compensação (Banco Itaú SA), devendo conter também o logotipo do banco. 2 – CÓDIGO DO BANCO DESTINATÁRIO Deve ser impresso na margem superior esquerda do BOLETO (341-7), à direita do nome do banco, com o seu respectivo DV (Dígito Verificador) 3 – LINHA DIGITÁVEL - Representação numérica do código de barras do boleto de pagamento conforme especificação do Item 8 Anexo A. 4 – LOCAL DE PAGAMENTO Deverá apresentar o seguinte conteúdo:  Para boletos COM REGISTRO (conforme item (5) da nota 4) ATÉ O VENCIMENTO, PAGUE EM QUALQUER BANCO OU CORRESPONDENTE NÃO BANCÁRIO. APÓS O VENCIMENTO, ACESSE ITAU.COM.BR/BOLETOS E PAGUE EM QUALQUER BANCO OU CORRESPONDENTE NÃO BANCÁRIO. 5 – DATA DE VENCIMENTO: Deve ser obrigatoriamente informado o vencimento no boleto, não podendo ser apresentado o campo em branco ou com as literais “À VISTA” e “CONTRA APRESENTAÇÃO” 6 – NOME DO BENEFICIÁRIO/CNPJ/CPF/ENDEREÇO: Razão social ou nome fantasia (conforme cadastrado junto ao banco), CNPJ/CPF e endereço do beneficiário. 7 – AGÊNCIA/CÓDIGO DO BENEFICIÁRIO: Agência e número da conta de relacionamento junto ao Itaú para emissão e crédito dos boletos. 8 – DATA DO DOCUMENTO: Data de emissão do documento (nota fiscal, fatura, duplicata, contrato, etc.) que originou o boleto de pagamento. 9 – NÚMERO DO DOCUMENTO: Número do documento/título estabelecido pelo beneficiário quando da emissão da fatura/duplicata, contrato de prestação de serviço, entre outros. 10 – ESPÉCIE DOCUMENTO: Tipo de documento que originou o boleto de pagamento (Exemplo: DM-Duplicata Mercantil, DS-Duplicata de Prestação de Serviço, NP-Nota Promissória). 11 – DATA DO PROCESSAMENTO: Data correspondente a da emissão do boleto de pagamento. 12 – NOSSO-NÚMERO: Código de controle que permite ao banco e ao beneficiário a identificação dos dados da cobrança que deu origem ao boleto de pagamento. Deve ser formado por formado pela carteira e nosso número. 13 – CARTEIRA: Identificação da modalidade de cobrança. 14 – ESPÉCIE DA MOEDA: Essencial para identificação da moeda em que a operação foi efetuada. “R$” se em Real. 15 – VALOR DO DOCUMENTO: Correspondente ao valor da Fatura/Duplicata/Contrato. Não é permitido campo com valor em branco ou zerado. 16 – INFORMAÇÕES DE RESPONSABILIDADE DO BENEFICIÁRIO: Mensagens ao pagador de responsabilidade ao Beneficiário, sendo proibido a inclusão de juros de mora e multa, ou a indicação de Protesto ou Negativação Expressa.  Deverá apresentar na frente da sua identificação a literal “Instruções de responsabilidade do BENEFICIÁRIO. Qualquer dúvida sobre este Boleto, contate o BENEFICIÁRIO.” JANEIRO 2017 Cobrança CNAB 400 53  Deverá ser utilizado exclusivamente para indicação das condições de recebimento do título na forma mais objetiva possível.  Para evitar comprometimento de cálculos e erros no recebimento, as condições devem ser expressas em valores, ao invés de percentuais e os prazos devem ser estipulados em datas, nunca em quantidade de dias.  Não utilizar instruções desnecessárias, em duplicidade, incompatíveis às demais ou que firam as normas de defesa do consumidor (entre elas o repasse da \"Tarifa Bancária” que é negociada entre o Banco e o beneficiário e não entre o Banco e o pagador);  Após DD/MM/AAAA, cobra R$(valor) por dia de atraso;  Após DD/MM/AAAA cobrar multa de R$ (valor);  Até DD/MM/AAAA conceder desconto de R$ (valor);  Até DD/MM/AAAA conceder desconto de R$ (valor) por dia de antecipação;  Dispensar juros de mora até DD/MM/AAAA  Banco autorizado a receber até DD/MM/AAAA 17 – DESCONTO/ABATIMENTO: Campo destinado ao preenchimento, no momento do pagamento, de acordo com as condições indicadas no campo de informações de responsabilidade do beneficiário e contidas no registro junto ao banco. 18 – JUROS/MULTA: Campo destinado ao preenchimento, no momento do pagamento, de acordo com as condições indicadas no campo de informações de responsabilidade do beneficiário e contidas no registro junto ao banco. 19 – VALOR PAGO: Campo destinado ao preenchimento, no momento do pagamento, que corresponderá à somatória dos valores preenchidos nos campos valor do documento, desconto/abatimento. 20 – NOME DO PAGADOR / CNPJ / CPF / ENDEREÇO: Pagador: Nome, CNPJ/CPF, endereço, cidade, UF e CEP do pagador. Sacador avalista: Nome e CNPJ/CPF do emitente da fatura/duplicata, contrato de prestação de serviço, entre outros, que foi negociado com (ou cedido a) outro beneficiário para emissão de boleto de pagamento 21 – SACADOR AVALISTA: Nome e CPNJ/CPF do emitente da fatura/duplicata, contrato de prestação de serviço, entre outros, que foi negociado/cedido com outro beneficiário para emissão do boleto de cobrança. 22 – CÓDIGO DE BARRAS: Representação gráfica da linha digitável para pagamento. Anexo 2 – Cálculo do DAC do Código de Barras Método (Módulo 11) Por definição da FEBRABAN e do Banco Central do Brasil, na 5ª posição do Código de Barras, deve ser indicado obrigatoriamente o “dígito verificador” (DAC), calculado através do módulo 11, conforme demonstramos a seguir: a) Tomando-se os 43 algarismos que compõem o Código de Barras (sem considerar a 5ª posição), multiplique-os, iniciando-se da direita para a esquerda, pela sequência numérica de 2 a 9 ( 2, 3, 4, 5, 6, 7, 8, 9, 2, 3, 4... e assim por diante); b) Some o resultado de cada produto efetuado e determine o total como (N); c) Divida o total (N) por 11 e determine o resto obtido da divisão como Mod 11(N); d) Calcule o dígito verificador (DAC) através da expressão: DAC = 11 - Mod 11(N) OBS.: Se o resultado desta for igual a 0, 1, 10 ou 11, considere DAC = 1. JANEIRO 2017 Cobrança CNAB 400 54 Exemplo: Considerando o seguinte conteúdo do Código de Barras: 3419?166700000123451101234567880057123457000 onde: 341 = Código do Banco 9 = Código da Moeda ? = DAC do Código de Barras 1667 Fator de Vencimento 0000012345 = Valor do Título (01/05/2002) (123,45) 110123456788 = Carteira / Nosso Número/DAC (110/12345678-8) 0057123457 = Agência / Conta Corrente/DAC (0057/12345-7) 000 = Posições Livres (zeros) Temos: a) Multiplica-se a sequência do código de barras pelo módulo 11: 3419166700000123451101234567880057123457000 X 4329876543298765432987654329876543298765432 b) Soma-se o resultado dos produtos obtidos no item “a” acima: 12 + 12 + 2 + 81 + 8 + 42 + 36 + 35 + 0 + 0 + 0 + 0 + 0 + 7 + 12 + 15 + 16 + 15 + 2 + 9 + 0 + 7 + 12 + 15 + 16 + 15 + 12 + 63 + 64 + 56 + 0 + 0 + 20 + 21 + 2 + 18 + 24 + 28 + 30 + 35 + 0 + 0 + 0 = 742 c) Determina-se o resto da Divisão: 742 11 = 67, resto 5 d) Calcula-se o DAC: DAC = 11 – 5  DAC = 6 Portanto, a sequência correta do código de barras será: 34196166700000123451101234567880057123457000  (DAC) Anexo 3 – Cálculo do DAC da Representação Numérica Método (Módulo 10) Conforme demonstrado no item “4” deste manual, a representação numérica do código de barras é composta, por cinco campos: 1, 2, 3, 4 e 5, sendo os três primeiros amarrados por DAC's, calculados pelo módulo 10, conforme mostramos abaixo: a) Multiplica-se cada algarismo do campo pela sequência de multiplicadores 2, 1, 2, 1, 2, 1..., posicionados da direita para a esquerda; b) Some individualmente, os algarismos dos resultados dos produtos, obtendo-se o total (N); c) Divida o total encontrado (N) por 10, e determine o resto da divisão como MOD 10 (N); d) Encontre o DAC através da seguinte expressão: DAC = 10 – Mod 10 (N) OBS.: Se o resultado da etapa d for 10, considere o DAC = 0. Exemplo: JANEIRO 2017 Cobrança CNAB 400 55 Considerando-se a seguinte representação numérica do código de barras: 34191.1012? 34567.88005? 71234.57000?  Campo 1  Campo 2  Campo 3 Temos: a) Multiplicando a sequência dos campos pelo módulo 10: 6  Campo 4 16670000012345  Campo 5 Campo 1 341911012 Campo 2 3456788005 Campo 3 7123457000 X 212121212 X 1212121212 X 1212121212 Observação: Os campos 4 e 5 não tem DAC b) Some, individualmente, os algarismos dos resultados do produtos: Campo 1  6 + 4 + 2 + 9 + 2 + 1 + 0 + 1 + 4 = 29 Campo 2  3 + 8 + 5 + 1 + 2 + 7 + 1 + 6 + 8 + 0 + 0 + 1 + 0 = 42 Campo 3  7 + 2 + 2 + 6 + 4 + 1 + 0 + 7 + 0 + 0 + 0 = 29 c) Divida o total encontrado por 10, a fim de determinar o resto da divisão: Campo 1  29  10 = 2, resto 9 Campo 2  42  10 = 4, resto 2 Campo 3  29  10 = 2, resto 9 d) Calculando o DAC: Campo 1  DAC = 10 - 9  DAC = 1 Campo 2  DAC = 10 - 2  DAC = 8 Campo 3  DAC = 10 - 9  DAC = 1 Portanto, a sequência correta da linha digitável será: 34191.10121 34567.880058 71234.570001 6 16670000012345    Anexo 4 – Cálculo do DAC do campo “Nosso Número”, em BOLETOS emitidos pelo próprio cliente. Para a grande maioria das carteiras, são considerados para a obtenção do DAC, os dados “AGÊNCIA / CONTA (sem DAC) / CARTEIRA / NOSSO NÚMERO”, calculado pelo critério do Módulo 10 (conforme Anexo 3). À exceção, estão as carteiras 126 - 131 - 146 - 150 e 168 cuja obtenção está baseada apenas nos dados “CARTEIRA/NOSSO NÚMERO” da operação. 1 – Exemplo: AG / CONTA = 0057 / 12345-7 CART / Nosso Número = 110 / 12345678-? Sequência para Cálculo 0 0 5 7 1 2 3 4 5 1 1 0 1 2 3 4 5 6 7 8 Módulo 10 - 1 2 1 2 1 2 1 2 1 2 1 2 1 2 1 2 1 2 1 2 | | | | | | | | | | | | | | | | | | | | JANEIRO 2017 Cobrança CNAB 400 8 x 2 = 16 (1+6) 56 ‘ | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | = Total 72 7 x 1 = 7 6 x 2 = 12 (1+2) 5 x 1 = 5 4 x 2 = 8 3 x 1 = 3 2 x 2 = 4 1 x 1 = 1 0 x 2 = 0 1 x 1 = 1 1 x 2 = 2 5 x 1 = 5 4 x 2 = 8 3 x 1 = 3 2 x 2 = 4 1 x 1 = 1 7 x 2 = 14 (1+4) 5 x 1 = 5 0 x 2 = 0 0 x 1 = 0 Dividir o resultado da soma por 10 => 72 | 02 10 7  resto da divisão DAC = 10 - 2 = 8 Portanto DAC =8 JANEIRO 2017 Cobrança CNAB 400 57 Anexo 5 – Carteira 198 - (Nosso Número com 15 posições) Código de Barras e Representação Numérica As carteiras 107, 122, 142, 143 e 196, são carteiras especiais, na qual são utilizadas 15 posições numéricas para identificação do título (8 do Nosso Número e 7 do Seu Número) Em função disto, a constituição do código de barras e sua representação numérica também são diferentes, conforme especificado adiante. 1 - Código de Barras POSIÇÃO TAMANHO PICTURE CONTEÚDO 01 a 03 04 a 04 05 a 05 06 a 09 10 a 19 20 a 22 23 a 30 31 a 37 38 a 42 43 a 43 44 a 44 03 01 01 04 10 03 08 07 05 01 01 9(3) 9(1) 9(1) Código do Banco na Câmara de Compensação = ‘341’ Código da Moeda = '9' DAC do Código de Barras (Anexo 2) módulo 11 (posição 01 a 44 exceto a 5 posição, que é o DAC a ser encontrado) 9(04) Fator de Vencimento (Anexo 6) 9(08) V(2) Valor 9(3) 9(8) 9(7) 9(5) 9(1) Carteira Nosso Número Seu Número (Número do Documento) Código do Cliente (fornecido pelo Banco) DAC dos campos acima (posições 20 a 42 veja anexo 3) módulo 10 (encontrar primeiro o DAC antes de submeter ao módulo 11, anexo 2) 9(1) Zero 2 - Representação Numérica Campo 1 (AAABC.CCDDX): AAA= Código do Banco na Câmara de Compensação “341” B= Código da moeda \"9\" (*) CCC= Código da carteira de cobrança DD= Os 2 primeiros dígitos do Nosso Número X= DAC que amarra o campo 1 (Anexo 3) (*) Este dígito será sempre “9”, porque independente do índice ou moeda utilizada, estes deverão ser convertidos no recebimento para a moeda corrente (R$). Campo 2 (DDDDD.DEEEEY) DDDDDD = O restante do Nosso Número (sem o DAC) EEEE = Os 4 primeiros números do campo Seu Número (N.º Doc.) Y= DAC que amarra o campo 2 (Anexo 3) Campo 3 (EEEFF.FFFGHZ) EEE = 3 últimos dígitos do campo Seu Número (N.ºDoc.) FFFFF = Código do Cliente (fornecido pelo Banco) G= DAC (Carteira/Nosso Número (sem o DAC) / Seu Número (sem o DAC) / Código do Cliente) H= Zero JANEIRO 2017 Cobrança CNAB 400 58 Campo 4 (K) Z= DAC que amarra o campo 3 (Anexo 3) K= DAC do Código de Barras (Anexo 2) Campo 5 (UUUUVVVVVVVVVV) UUUU = Fator de Vencimento VVVVVVVVVV = Valor do Título (*) (*) Sem edição (sem ponto e vírgula), com tamanho fixo (10). Em casos de cobrança com valor em aberto (o valor a ser pago é preenchido pelo próprio PAGADOR) ou cobrança em moeda variável, deve ser preenchido com zeros. JANEIRO 2017 Cobrança CNAB 400 59 Anexo 6 – Cálculo do Fator de Vencimento Para garantir maior eficiência no processo de recebimento, recomenda-se a indicação do Fator de Vencimento no Código de Barras. A partir de 02/04/2001, o Banco acolhedor/recebedor não será mais responsável por eventuais diferenças de recebimento de boletos fora do prazo, ou sem a indicação do fator de vencimento. Formas para obtenção do Fator de Vencimento: Utilizar-se de uma tabela de correlação DATA x FATOR, iniciando-se pelo fator “1000” correspondente à data de vencimento 03.07.2000, adicionando-se “1” a cada dia subsequente a este fator. Quando o fator atinge o valor “9999” considera-se como próximo valor “1000”. Somente serão considerados válidos para pagamento os boletos com 3.000 fatores de vencimento anteriores e 5.500 fatores futuros, ambos em relação a data atual. Boletos fora deste controle não serão considerados validos para pagamento na rede bancária. FATOR VENCIMENTO 1000 1001 1002 1003 1004 : : 1667 4789 9999 1000 1001 03/07/2000 04/07/2000 05/07/2000 06/07/2000 07/07/2000 : : 01/05/2002 17/11/2010 21/02/2025 22/02/2025 23/02/2025 A partir de 22/02/2025, o fator retorna para “1000” adicionando-se “1” a cada dia subsequente a este fator, em 23.02.2025 o fator será 1001; em 24.02.2025 será 1002, em 26.02.2025 será 1004 e assim sucessivamente Exemplo: Hoje é 13/03/2014 (fator 6.001) Limite para emissão ou pagamento de boletos vencido: 24/12/2005 (fator 3.000) Limite para emissão ou pagamento de boletos à vencer: 03/04/2029 (fator 2.501) Importante: 1) Boletos com vencimento “contra apresentação” ou “à vista” É obrigatório o preenchimento da informação de vencimento, sendo proibido o campo vencimento em branco ou com as informações “À VISTA” ou “CONTRA APRESENTAÇÃO”. 2) Valor superior a 10 posições Boletos com valores superiores a R$ 99.999.999,99 (dez posições) deverão avançar sobre o fator de vencimento eliminando-o do código de barras. JANEIRO 2017 Cobrança CNAB 400 60 Atenção: Somente serão aceitos títulos que possuam o range anterior a 3000 e superior a 5500, range calculado a partir da date de vencimento do boleto. Caso o título esteja fora do range especificado será rejeitado Caso ocorra divergência entre a data impressa no campo “data de vencimento” e a constante no código de barras, o recebimento se dará da seguinte forma:  Quando pago por sistemas eletrônicos (Autoatendimento, Internet, SISPAG, telefone, etc.), prevalecerá à representada no “código de barras”;  Quando quitado na rede de agências, diretamente no caixa, será considerada a data impressa no campo “vencimento” do boleto. JANEIRO 2017 Cobrança CNAB 400 61 Anexo 7 – Boleto de Proposta 7.1 – Introdução O Boleto de Proposta é uma modalidade de boleto de pagamento, utilizada para possibilitar o pagamento decorrente da eventual aceitação de uma oferta de produto ou serviço, de uma proposta de contrato civil ou de um convite para associação. A emissão e a apresentação do boleto de proposta estão condicionadas à manifestação prévia, pelo pagador, de sua vontade em receber aquele boleto. Conforme previsto no contrato de Cobrança é obrigatória a apresentação do documento comprobatório da aceitação do pagador em receber o Boleto de Proposta no prazo máximo de 48 (quarenta e oito) horas, a partir da solicitação do Itaú Unibanco. O pagamento do boleto proposta é facultativo e o não pagamento não dará causa a protesto, a cobranças judiciais ou extrajudiciais ou a inclusão do nome do pagador em cadastros de restrição ao crédito. O pagamento do boleto significa a aceitação da correspondente obrigação, e a data de vencimento significa, para todos os efeitos legais, o termo final do prazo para sua aceitação. 7.2 – Explicações gerais A utilização do Boleto de Proposta está disponível para todas as carteiras de cobrança, através do banco ou de envio de arquivo pelo próprio cliente. Na situação de emissão do Boleto de Proposta pelo cliente, é obrigatória a elaboração do boleto conforme condições contidas neste anexo e no layout de cobrança, além da prévia validação pelo banco. 1. Conforme item (10) da nota 4, o cliente deve utilizar a espécie BDP – Boleto de Proposta. Para todos os casos, conforme determina o BACEN, em função do pagamento facultativo, devem ser observadas as seguintes regras:  Proibido juros de mora  Proibido multa  Proibido Protesto  Proibido Negativação Expressa  Proibido Cobrança Ativa Eletrônica  Proibido o comando de Instruções - Boletos com instruções serão rejeitados pelo código 47 INSTRUÇÃO NÃO PERMITIDA – ESPÉCIE INVÁLIDA JANEIRO 2017 Cobrança CNAB 400 62 7.3 – Modelo da Ficha de Compensação O recibo do pagador segue o mesmo modelo do Boleto de Cobrança conforme nota 8 do “Layout de Arquivos - CNAB400 – Cobrança Bancária. JANEIRO 2017 Cobrança CNAB 400 63 1 – NOME DO BANCO DESTINATÁRIO Deve ser obrigatoriamente indicado na margem superior esquerda da Ficha de Compensação (Banco Itaú SA), devendo conter também o logotipo do banco. 2 – CÓDIGO DO BANCO DESTINATÁRIO Deve ser impresso na margem superior esquerda do BOLETO (341-7), à direita do nome do banco, com o seu respectivo DV (Dígito Verificador) 3 – LINHA DIGITÁVEL - Representação numérica do código de barras do boleto de pagamento conforme especificação do Item 8 Anexo B. 4 – INFORMAÇÃO FIXA DE ACORDO COM O ARTIGO 4°, Parágrafo 5°, da Circular n° 3.598, de 6 de junho de 2012, com a redação pela Circular n° 3.565, de 2 de Abril de 2013. Deve ser utilizado obrigatoriamente o seguinte texto: BOLETO DE PROPOSTA ESTE BOLETO SE REFERE A UMA PROPOSTA JÁ FEITA A VOCÊ E O SEU PAGAMENTO NÃO É OBRIGATÓRIO. Deixar de pagá-lo não dará causa a proposta, a cobrança judicial ou extrajudicial, nem inserção de seu nome em cadastro de restrição ao crédito. Pagar até o vencimento significa aceitar a proposta. Informações adicionais sobre a proposta e sobre o respectivo contrato poderão ser solicitadas a qualquer momento ao beneficiário, por meio de seus canais de atendimento. 5 – LOCAL DE PAGAMENTO: Deverá apresentar as literais: ATÉ O VENCIMENTO, PAGUE EM QUALQUER BANCO OU CORRESPONDENTE NÃO BANCÁRIO. 6 – DATA DE VENCIMENTO: Deve ser obrigatoriamente informado o vencimento no boleto, não podendo ser apresentado o campo em branco ou com as literais “À VISTA” e “CONTRA APRESENTAÇÃO”. O vencimento significa, para todos os efeitos legais, o termo final do prazo para sua aceitação. 7 – NOME DO BENEFICIÁRIO/ENDEREÇO/CNPJ/CPF: Razão social ou nome fantasia (conforme cadastrado junto ao banco), endereço e o CNPJ/CPF do beneficiário. 8 – AGÊNCIA/CÓDIGO DO BENEFICIÁRIO: Agência e número da conta de relacionamento junto ao Itaú para emissão e crédito dos boletos. 9 – DATA DO DOCUMENTO: Data de emissão do documento (nota fiscal, fatura, duplicata, contrato, etc.) que originou o boleto de pagamento. 10 – NÚMERO DO DOCUMENTO: Número do documento/título estabelecido pelo beneficiário quando da emissão da fatura/duplicata, contrato de prestação de serviço, entre outros. 11 – DATA DE PROCESSAMENTO: Data correspondente a da emissão do boleto de pagamento. 12 – NOSSO-NÚMERO: Código de controle que permite ao banco e ao beneficiário a identificação dos dados da cobrança que deu origem ao boleto de pagamento. 13 – CARTEIRA: Identificação da modalidade de cobrança.. 14 – ESPÉCIE DA MOEDA: Essencial para identificação da moeda em que a operação foi efetuada. JANEIRO 2017 Cobrança CNAB 400 64 “R$” se em Real 15 – VALOR DO DOCUMENTO: Correspondente ao valor da proposta ou oferta. Não é permitido campo com valor em branco ou zerado. 16 – INFORMAÇÕES DE RESPONSABILIDADE DO BENEFICIÁRIO: Mensagens ao pagador de responsabilidade ao Beneficiário, sendo proibido a inclusão de juros de mora e multa, ou a indicação de Protesto ou Negativação Expressa.  Deverá apresentar na frente da sua identificação a literal “Instruções de responsabilidade do BENEFICIÁRIO. Qualquer dúvida sobre este Boleto, contate o BENEFICIÁRIO.”  Para evitar comprometimento de cálculos e erros de recebimento, as condições de desconto quando houver devem ser expressas em valores ao invés de percentuais, e os prazos devem ser estipulados em datas, nunca em quantidade de dias. 17 – DESCONTO/ABATIMENTO: Campo destinado ao preenchimento, no momento do pagamento, de acordo com as condições indicadas no campo de informações de responsabilidade do beneficiário. 18 – VALOR COBRADO: Campo destinado ao preenchimento, no momento do pagamento, que corresponderá à somatória dos valores preenchidos nos campos valor do documento, desconto/abatimento. 19 – NOME DO PAGADOR / CNPJ / CPF / ENDEREÇO / SACADOR AVALISTA: Pagador: Nome, CNPJ/CPF, endereço, cidade, UF e CEP do pagador. Sacador avalista: Nome e CNPJ/CPF do emitente da fatura/duplicata, contrato de prestação de serviço, entre outros, que foi negociado com (ou cedido a) outro beneficiário para emissão de boleto de pagamento. 20 - CÓDIGO DE BARRAS Código de barras do boleto de pagamento conforme especificação do Item 8 Anexo A. JANEIRO 2017 Cobrança CNAB 400 65", "embedding": [-0.02984650433063507, 0.01654191128909588, 0.0006361957639455795, -0.02550376020371914, -0.011100320145487785, 0.013725707307457924, 0.001835796982049942, -0.044190723448991776, -0.02797780930995941, -0.004573042504489422, 0.012547902762889862, 0.002523398259654641, -0.005701498128473759, -0.001344770542345941, -0.0076392837800085545, 0.0016877488233149052, 0.002153277862817049, 0.004382224753499031, 0.029635947197675705, 0.0010577216744422913, -0.017134103924036026, 0.03466300293803215, -0.0377950444817543, 0.009304002858698368, -0.0020299043972045183, 0.0016861037584021688, 0.0116661936044693, -0.027030300348997116, 0.019068600609898567, -0.003743972862139344, 0.0009072060929611325, 0.020160866901278496, -0.022292759269475937, -0.018213210627436638, -0.0008348270202986896, -0.03537363559007645, -0.008547312580049038, 0.0001505156105849892, 0.027688292786478996, 0.009481661021709442, 0.013298013247549534, 0.021884804591536522, -0.001983845140784979, 0.004885588772594929, -0.01434422004967928, 0.009396121837198734, -0.009751437231898308, -0.024095656350255013, -0.030214980244636536, 0.015778642147779465, 0.0135677894577384, 0.02274019457399845, -0.02130577154457569, 0.0003978793683927506, -0.005727818235754967, -0.0008463418926112354, -0.008106458000838757, 0.02918851375579834, 0.02192428521811962, -0.021713726222515106, 0.005553450435400009, -0.004066389054059982, -0.021634768694639206, 0.007790622301399708, -0.016752470284700394, -0.02391142025589943, 0.015647042542696, 0.02363506332039833, 0.0027602752670645714, -0.00748136593028903, 0.009929095394909382, 0.017831575125455856, 0.016291875392198563, 0.011547754518687725, 0.031530965119600296, -0.008132778108119965, -0.004194697365164757, -0.03482092171907425, 0.007474786136299372, -0.01140957698225975, 0.008080138824880123, -0.01594971865415573, 0.010488388128578663, -0.015331207774579525, 0.007066830992698669, 0.004895458463579416, 0.017686817795038223, 0.038716234266757965, -0.013008496724069118, 0.002098993631079793, 0.015804961323738098, 0.011554335243999958, 0.015633882954716682, -0.002228946890681982, 0.021911123767495155, 0.004530272912234068, -0.0003910938394255936, 0.0381108820438385, -0.0023457405623048544, -0.008665750734508038, 0.006954972632229328, -0.01005411334335804, -0.017528899013996124, -0.012718980200588703, -0.027925169095396996, 0.0006584029761143029, 0.00852099247276783, 0.006757575087249279, 0.02670130506157875, 0.009113185107707977, 0.011547754518687725, 0.04963889718055725, -0.02496420592069626, 0.00045689300168305635, -0.009422441944479942, 0.006770735140889883, 0.005731108132749796, -0.01863432675600052, 0.01584444008767605, 0.005115885753184557, -0.0002874601341318339, 0.019976628944277763, 0.021029416471719742, -0.010258090682327747, 0.0018456667894497514, 0.033320702612400055, -0.0028013999108225107, -0.0113898366689682, -0.007941960357129574, -0.029214832931756973, 0.008297275751829147, 0.02267439477145672, -0.009192144498229027, -0.002047999296337366, 0.004158507566899061, 0.032741669565439224, -0.03376813605427742, 0.004668451379984617, -0.03971638157963753, -0.016252396628260612, 0.03550523519515991, 0.02052934281527996, -0.014975891448557377, -0.013205894269049168, -0.010494967922568321, 0.005158655345439911, 0.018213210627436638, 0.0189764816313982, 0.04240098595619202, 0.0058627063408494, 0.008882888592779636, -0.014081022702157497, 0.009402701631188393, -0.04013749584555626, -0.008290695957839489, 0.004309845622628927, 0.004276946187019348, 0.020503021776676178, -0.00848151370882988, -0.019187038764357567, -0.00742214685305953, 0.03550523519515991, -0.002844169270247221, 0.018463248386979103, 0.04037437215447426, 0.020397743210196495, -0.014607416465878487, -0.003806482069194317, 0.02934643067419529, -0.02285863272845745, -0.010619986802339554, -0.005402111914008856, 0.0012041248846799135, -0.0021878224797546864, 0.0015059785218909383, 0.005688338540494442, -0.0068233744241297245, -0.0019706853199750185, -0.03271535038948059, -0.025648517534136772, 0.018186891451478004, 0.004342745523899794, 0.01660771109163761, 0.028056766837835312, -0.01676562987267971, 0.03376813605427742, 0.013870465569198132, -0.009455340914428234, -0.013712547719478607, -0.009014486335217953, 0.029872825369238853, 0.005211294628679752, -0.02437201328575611, -0.021213652566075325, -0.6232497692108154, 0.003579474985599518, -0.008810508996248245, -0.02992546372115612, -0.013765187002718449, 0.019700272008776665, 0.015475965104997158, 0.004247336648404598, -0.011120060458779335, -0.03626850247383118, -0.013126934878528118, -0.006004174705594778, 0.019160719588398933, 0.004174957517534494, -0.02860948070883751, -0.027030300348997116, 0.0025974223390221596, 0.005300123244524002, -0.013778346590697765, 0.046112060546875, -0.014133661985397339, 0.019542355090379715, -0.013659908436238766, 0.004809919744729996, -0.012100468389689922, -0.006928652990609407, -0.011903070844709873, -0.00981723703444004, -0.008159097284078598, -0.008744710125029087, -0.007441886700689793, -0.0021318932995200157, 0.01766049861907959, -0.004323005676269531, 0.0385846346616745, -0.009271103888750076, -0.0024460842832922935, 0.007099730893969536, 0.015318047255277634, 0.02134525217115879, 0.012001769617199898, -0.006116033066064119, 0.02018718607723713, -0.015765482559800148, 0.01115954015403986, 0.012547902762889862, 0.040269095450639725, -0.0267407838255167, -0.006649006623774767, -0.03453140705823898, -0.015344367362558842, -0.013205894269049168, -0.01991082914173603, 0.005089566111564636, -0.002819494577124715, 0.019516034051775932, 0.012541322037577629, -0.000829892058391124, 0.002332580741494894, -0.009902775287628174, -0.00040507616358809173, -0.011402996256947517, 0.009580359794199467, -0.045664627104997635, -0.015225928276777267, -0.007303708232939243, -0.05100752040743828, -0.0072313291020691395, 0.023306068032979965, -0.015054850839078426, -0.002771790139377117, 0.016278715804219246, -0.01688406802713871, -0.010580507107079029, 0.015291728079319, 0.022174321115016937, 0.010902922600507736, -0.006731255445629358, 0.016818268224596977, 0.025332681834697723, -0.026846062391996384, -0.010027794167399406, -0.028504202142357826, 0.005079695954918861, 0.016818268224596977, -0.006116033066064119, -0.013975744135677814, -0.023529784753918648, 0.010600246489048004, -0.003908470738679171, 0.01459425687789917, 0.0053659225814044476, -0.01389678567647934, -0.005997594445943832, 0.009409281425178051, 0.02114785462617874, -0.010212032124400139, -0.020832018926739693, -0.018094772472977638, -0.020002948120236397, -0.011534594930708408, 0.013172994367778301, -0.007349767722189426, 0.0028556841425597668, 0.019700272008776665, 0.0072444891557097435, 0.006040364038199186, -0.004293396137654781, 0.04208515211939812, -0.021134695038199425, -0.0023753501009196043, -0.027925169095396996, 0.001717358361929655, -0.00865917094051838, -0.02359558269381523, -0.02554323896765709, -0.0032784438226372004, -0.0038459617644548416, 0.009113185107707977, -0.015581244602799416, 0.01769997738301754, -0.008547312580049038, -0.006902333348989487, -0.02379298023879528, -0.018581686541438103, -0.009251363575458527, 0.0034610365983098745, -0.007323448080569506, 0.008238056674599648, -0.010652885772287846, -0.012765039689838886, 0.025990674272179604, 0.04608574137091637, -0.0009853426599875093, 0.029083235189318657, -0.0027207958046346903, 0.030715053901076317, 0.006359490100294352, 0.0023605453316122293, -0.038453035056591034, -0.01971343159675598, -0.03537363559007645, 0.01831848919391632, -0.028162045404314995, 0.007205009460449219, -0.012843998149037361, 0.0011514854850247502, 0.0193712767213583, -0.024872086942195892, 0.012574221938848495, -0.00025270995683968067, -0.001290486310608685, -0.005431721918284893, 0.013317752629518509, 0.005800196900963783, 0.009001326747238636, -0.014252101071178913, -0.004777019843459129, -0.022950751706957817, -0.006954972632229328, -0.009126345627009869, 0.029162192717194557, -0.013804666697978973, -0.03158360347151756, -0.017792096361517906, 0.005467911250889301, 0.0226612351834774, 0.013278272934257984, -0.004382224753499031, -0.03171520307660103, 0.012159687466919422, 0.00020171559299342334, -0.005194844678044319, 0.033162783831357956, -0.02538532018661499, 0.0093698026612401, 0.0008677265723235905, 0.00046511791879311204, 0.002605647314339876, -0.006362779997289181, 0.0003668303834274411, 0.005553450435400009, -0.0020710290409624577, -0.034452445805072784, 0.017950015142560005, 0.02992546372115612, 0.013436190783977509, -0.0008327707764692605, -0.006668746005743742, 0.026911862194538116, 0.01812109164893627, -0.0011942549608647823, 0.012153107672929764, 0.007527425419539213, -0.03321542218327522, 0.054007962346076965, -0.00028581515653058887, 0.01797633431851864, -0.01317957416176796, 0.014752174727618694, 0.044927675276994705, 0.020016107708215714, 0.020252985879778862, -0.010777904652059078, 0.006681906059384346, -0.01471269503235817, 0.0033689176198095083, -0.012014929205179214, 0.04945465922355652, 0.014436339028179646, 0.007139210123568773, -0.016989346593618393, -0.00865917094051838, -0.009093445725739002, -0.02088465727865696, 0.005852836649864912, -0.02134525217115879, -0.008534152992069721, 0.012409724295139313, 0.023108670487999916, -0.015594404190778732, 0.008856568485498428, 0.007593224756419659, -0.010600246489048004, -0.02876739762723446, 0.02363506332039833, -0.0019246258307248354, 0.021068895235657692, -0.024898407980799675, -0.0010108398273587227, -0.00018598548194859177, 0.022805992513895035, -0.004408544395118952, -0.019594993442296982, 0.03116248920559883, 0.014725854620337486, 0.01656823232769966, -0.008935527876019478, 0.02837260253727436, 0.009053966030478477, 0.005494230892509222, 0.04879666492342949, 0.03497884050011635, -0.020832018926739693, 0.03155728429555893, 0.009343482553958893, -0.008139357902109623, 0.052349820733070374, -0.0032109995372593403, 0.006454898975789547, 0.009902775287628174, 0.018529046326875687, -0.05263933911919594, 0.01140957698225975, 0.024832608178257942, 0.000808507320471108, 0.0025678128004074097, 0.011501695029437542, 0.005826517008244991, 0.007343187928199768, 0.021555809304118156, 0.006915492936968803, -0.0002679260214790702, 0.019147560000419617, 0.04692796990275383, -0.00709315063431859, -0.014252101071178913, 0.0015619078185409307, -0.0030695314053446054, -0.011060841381549835, -0.0012090598465874791, -0.008810508996248245, 0.020858338102698326, 0.009363221935927868, 0.026951340958476067, -0.005533710587769747, 0.0269776601344347, -0.0053527625277638435, 0.0313730463385582, 0.003510385984554887, -0.02514844387769699, -0.026885543018579483, 0.02620123140513897, 0.018647486343979836, -0.021134695038199425, -0.008876308798789978, 0.00032591153285466135, 0.004158507566899061, -0.009139505214989185, 0.014541617594659328, -0.023898258805274963, -0.03155728429555893, 0.007889321073889732, 0.013403291814029217, 0.005231034476310015, 0.0021302481181919575, 0.002717505907639861, -0.00823147688060999, -0.05213926360011101, -0.009514559991657734, 0.02464837022125721, -0.031004570424556732, 0.0013488830300047994, -0.011376677080988884, 0.022832313552498817, 0.014159982092678547, -0.005490940995514393, -0.00342155690304935, 0.016634030267596245, 0.007455046288669109, 0.024266734719276428, -0.016081318259239197, 0.008948687463998795, -0.004872428718954325, 0.004428284242749214, 0.010619986802339554, -0.009830396622419357, 0.014041543938219547, 0.017963174730539322, -0.0010346920462325215, -0.03066241554915905, -0.0031188807915896177, -0.011047680862247944, -0.0026878961361944675, -0.0029757677111774683, 0.053744763135910034, -0.0078037818893790245, 0.01929231733083725, -0.015146969817578793, -0.024858927354216576, -0.03513675928115845, -0.02795148827135563, -0.003579474985599518, 0.02631966955959797, 0.005431721918284893, -0.01712094433605671, 0.02056882157921791, 0.015068010427057743, 0.01439685933291912, 0.027030300348997116, 0.031109848991036415, -0.016212916001677513, 0.0381898395717144, -0.030399218201637268, -0.019147560000419617, -0.0022223670966923237, 0.0022486867383122444, 0.04863874986767769, 0.018963322043418884, -0.022213801741600037, 0.02216116152703762, 0.013909945264458656, 0.02731981687247753, -0.03158360347151756, 0.006303560920059681, 0.011370097286999226, -0.008553892374038696, 0.03279430791735649, 0.0033491780050098896, -0.005533710587769747, 0.014883773401379585, 0.005300123244524002, 0.007218169514089823, 0.012383404187858105, 0.026846062391996384, -0.007027351763099432, 0.0007357170106843114, 0.006517407950013876, -0.003589344909414649, -0.02887267805635929, -0.00261058215983212, 0.0008245458593592048, -0.016199756413698196, -0.027188219130039215, 0.01630503498017788, -0.0033574027474969625, -0.008580212481319904, -0.010613407008349895, 0.013278272934257984, 0.0093698026612401, -0.00016285295714624226, 0.021516328677535057, 0.014423178508877754, -0.00910002551972866, -0.02402985841035843, -0.01889752224087715, 0.026490747928619385, -0.02204272337257862, -0.02064778096973896, -0.027082940563559532, -0.032978545874357224, -0.00538566242903471, -0.01373886689543724, 0.016278715804219246, -0.001323385862633586, -0.021292611956596375, 0.0019887799862772226, 0.001835796982049942, 0.019818710163235664, 0.017634177580475807, 0.021884804591536522, -0.0096066789701581, 0.014449498616158962, 0.02064778096973896, -0.022095361724495888, -0.015739161521196365, -0.0025546529795974493, -0.005592929664999247, 0.006445028819143772, 0.020542502403259277, -0.013113775290548801, -0.00700761191546917, -0.001992069883272052, 0.013317752629518509, -0.024200936779379845, -0.014896932989358902, 0.015107490122318268, 0.007744562812149525, 0.02068725973367691, 0.03024129942059517, 0.012429463677108288, 0.014331059530377388, -0.013594109565019608, -0.018147412687540054, 0.011429316364228725, -0.011014781892299652, -0.013659908436238766, -0.005329733248800039, 0.01052128802984953, -0.003401817288249731, -0.011376677080988884, 0.0018094772240146995, 0.01654191128909588, -0.0012287995778024197, -0.009988314472138882, -0.031267765909433365, 0.013390131294727325, -0.0024033146910369396, -0.02731981687247753, 0.01804213412106037, -0.02064778096973896, 0.0027997547294944525, -0.0014434693148359656, 0.0018538916483521461, 0.019384436309337616, -0.023424506187438965, 0.01871328428387642, 0.027109259739518166, 0.01769997738301754, 0.024135136976838112, -0.0064022596925497055, -0.02803044766187668, -0.004852688871324062, 0.00013889794354327023, -0.00452040322124958, 0.01971343159675598, -0.01471269503235817, -0.023200787603855133, -0.02006874792277813, -0.007632703986018896, -0.020660940557718277, 0.005082986317574978, -0.029004275798797607, -0.004197987262159586, 0.006688485853374004, 0.00465858168900013, -0.0009705378324724734, 0.014896932989358902, -0.02080569788813591, -0.020542502403259277, 0.002951093018054962, 0.013205894269049168, -0.01956867426633835, 0.027688292786478996, 0.0023802851792424917, 0.016081318259239197, 0.005036926828324795, -0.01300191693007946, -0.006129193119704723, -0.02267439477145672, -0.014778493903577328, -0.027161898091435432, 0.024043017998337746, 0.0135677894577384, 0.016081318259239197, 0.00319783971644938, 0.027530374005436897, -0.01579180173575878, -0.0003215934557374567, -0.0013242083368822932, -0.003117235843092203, 0.005435011815279722, -0.020700419321656227, 0.020160866901278496, 0.008053818717598915, 0.01863432675600052, 0.00037752275238744915, -0.03350494056940079, -0.010685785673558712, 0.002905033528804779, -0.01889752224087715, -0.023345546796917915, -0.006260791327804327, -0.0016663640271872282, -0.01781841553747654, -0.0022848763037472963, -0.009929095394909382, -0.0024000247940421104, -0.0534815676510334, -0.013541470281779766, 0.017068305984139442, 0.010422589257359505, 0.019108079373836517, 0.006349620409309864, 0.027609333395957947, -0.01119901891797781, 0.028583161532878876, 0.0061949919909238815, 0.013409871608018875, 0.01808161288499832, 0.005293543450534344, -0.04600678011775017, -0.04153243824839592, 0.011830691248178482, 0.011027941480278969, 0.016594551503658295, 0.017515739426016808, -0.015883920714259148, -0.01704198494553566, -0.02887267805635929, -0.011705673299729824, 0.020516181364655495, -0.01281109917908907, 0.03508412092924118, -0.024056177586317062, -0.03832143917679787, 0.01668667048215866, -0.016634030267596245, 0.0010939112398773432, 0.02554323896765709, -0.005129045341163874, 0.020871497690677643, -1.1418469512136653e-05, -0.01325195375829935, 0.012008349411189556, -0.018094772472977638, 0.030030742287635803, -0.011350356973707676, 0.021437371149659157, -0.0008274245774373412, -0.009922515600919724, 0.008856568485498428, -0.0021944025065749884, -0.017752617597579956, -0.02146369032561779, 0.00867233145982027, 0.0309782512485981, -0.02984650433063507, -0.03605794534087181, 0.030214980244636536, -0.0047178007662296295, -0.04266418516635895, 0.0013727352488785982, 0.04816499352455139, 0.0040269093587994576, 0.030820332467556, -0.010679205879569054, 0.0047145108692348, -0.016041837632656097, -0.0054086921736598015, -0.003674883861094713, -0.004003879614174366, -0.02359558269381523, -0.008942107670009136, -0.0069747124798595905, 0.03150464594364166, -0.016699830070137978, 0.021568968892097473, 0.00658978708088398, -0.04097972437739372, -0.006000884808599949, 0.0006065861089155078, -0.03439980745315552, -0.007014191709458828, 0.012580801732838154, 0.022148001939058304, 0.0039940099231898785, 0.01684458740055561, 0.008086718618869781, 0.0188580434769392, -0.01660771109163761, -0.0002854039194062352, -4.086745684617199e-05, 0.022148001939058304, -0.023766661062836647, -0.018647486343979836, 0.013317752629518509, 0.0039808498695492744, 0.008053818717598915, 0.013909945264458656, 0.0021417629905045033, 0.00022515654563903809, -0.004467763938009739, -0.010297570377588272, 0.0021861775312572718, 0.024556251242756844, -0.023240268230438232, -0.006731255445629358, -0.01325195375829935, 0.006701645907014608, -0.015344367362558842, -0.006856273859739304, 0.030399218201637268, 0.014502137899398804, -0.012087307870388031, -0.007994599640369415, 0.006152222864329815, 0.018423767760396004, 0.0005124110612086952, 0.030346577987074852, 0.011889910325407982, 0.012218906544148922, 0.017765777185559273, 0.004730960354208946, -0.007770882453769445, 0.0057738772593438625, -0.004796759691089392, 0.016120797023177147, -0.012995337136089802, -0.006352910306304693, 0.029320111498236656, -0.02628018893301487, -0.011810951866209507, -0.013528309762477875, 0.006652296520769596, 0.011047680862247944, -0.014502137899398804, 0.014107342809438705, 0.006296980660408735, -0.0013069360284134746, -0.0012616991298273206, 0.01572600193321705, -0.01917387917637825, -0.003395237261429429, 0.01077132485806942, -0.006168672349303961, 0.009396121837198734, -0.022832313552498817, 3.883693352690898e-05, 0.00336233782581985, 0.006145642604678869, -0.005010607186704874, -0.055481862276792526, -0.01418630126863718, 0.03516307845711708, 0.0385056771337986, -0.012758459895849228, -0.010935822501778603, -0.012699240818619728, 0.006296980660408735, -0.010705525055527687, 0.0005383194657042623, 0.003859121585264802, 0.006566757336258888, 0.0015668427804484963, -0.0018703414825722575, -0.001199189922772348, 0.004569752607494593, 0.007158949971199036, 0.011541174724698067, -0.007303708232939243, -0.01708146557211876, -0.014673215337097645, -0.002084188861772418, -0.019121238961815834, -0.0013850725954398513, 0.0027750800363719463, -0.013416451402008533, -0.024898407980799675, -0.006454898975789547, -0.04455919936299324, -0.005494230892509222, -0.03824247792363167, 0.037979282438755035, 0.01275188010185957, -0.012232066132128239, 0.018186891451478004, 0.026332829147577286, -0.010916083119809628, 0.024240415543317795, -0.01719990372657776, 0.025043165311217308, 0.019042281433939934, 0.014554777182638645, 0.01100162137299776, -0.0012205747189000249, -0.036005306988954544, -0.014002064242959023, -0.015133810229599476, 0.005122465547174215, 0.028741078451275826, 0.03971638157963753, -0.03261006996035576, 0.0035367056261748075, 0.008145937696099281, -0.00202332460321486, 0.03289958834648132, -0.005714658182114363, 0.0075471652671694756, -0.033399660140275955, 0.006458188872784376, 0.016989346593618393, 0.008165677078068256, 0.001911466009914875, -0.015318047255277634, 0.005606089718639851, 0.0020430642180144787, -0.006185122299939394, -0.029741225764155388, -0.021016255021095276, 0.008836829103529453, -0.028425242751836777, 0.0009409281774424016, 0.01955551467835903, -0.024832608178257942, 0.011060841381549835, 0.010225191712379456, 0.014370539225637913, -0.0010897987522184849, 0.008007759228348732, 0.0027125708293169737, 0.009659318253397942, 0.005323152989149094, -0.0460331030189991, 0.018384288996458054, -0.011179279536008835, 0.0013571078889071941, -0.0036814636550843716, 0.014541617594659328, -0.021161014214158058, -0.010363370180130005, -0.018463248386979103, 0.02655654586851597, 0.04074284806847572, -0.03171520307660103, 0.0013217409141361713, -0.004421704448759556, 0.007086570840328932, 0.022792832925915718, -0.0014969311887398362, 0.002635256852954626, -0.02984650433063507, 0.019726591184735298, 0.021055735647678375, -2.6255413104081526e-05, 0.016673510894179344, 0.004905328154563904, -0.0038755713030695915, 0.01579180173575878, -0.008165677078068256, 0.1751837134361267, -0.016357675194740295, 0.0010289346100762486, 0.02177952602505684, -0.005053376313298941, 0.009692218154668808, -0.00834333524107933, 0.008369654417037964, -0.026490747928619385, -0.0028458142187446356, -0.03453140705823898, 0.015633882954716682, -0.04066389054059982, -0.007376087363809347, 0.0033080533612519503, -0.01941075548529625, -0.04903354495763779, -0.017871055752038956, -0.010856863111257553, -0.0006296158535405993, -0.008047238923609257, -0.011903070844709873, -0.010791064240038395, -0.005372502375394106, 0.022108521312475204, 0.006296980660408735, -0.003477486316114664, -0.0007069298881106079, 0.03705809265375137, -0.00044167693704366684, -0.0033541128505021334, -0.00022495092707686126, -0.0014500492252409458, -0.003007022198289633, -0.005615959409624338, 0.007566905114799738, 0.008448613807559013, 0.0008056286023929715, 0.018305329605937004, 0.0038854412268847227, 0.006323300767689943, -0.019279157742857933, 0.015318047255277634, -0.04471711814403534, -0.0028770689386874437, 0.03647906333208084, -0.0029889275319874287, -0.016818268224596977, -0.002317775972187519, 0.01696302741765976, -0.044032808393239975, 0.017726296558976173, 0.005326442886143923, 0.01945023611187935, 0.006829954218119383, -9.751642937771976e-05, 0.002743825549259782, -0.004747410304844379, 0.002635256852954626, 0.0023605453316122293, -0.01024493109434843, 0.01298217661678791, -0.009784337133169174, 0.009264523163437843, -0.03179416060447693, 3.665219628601335e-05, -0.004227596800774336, 0.008718390017747879, 0.015173288993537426, -0.026095952838659286, -0.005513970740139484, -0.02578011527657509, -0.029372751712799072, 0.027504054829478264, -0.023411346599459648, -0.0058298069052398205, 0.013074295595288277, 0.023727182298898697, 0.012528162449598312, 0.03508412092924118, 0.025043165311217308, -0.015804961323738098, -0.016594551503658295, -0.00446447404101491, 0.0008142647566273808, -0.03321542218327522, 0.019516034051775932, 0.0015068011125549674, 0.006497668568044901, -0.016081318259239197, 0.0006834889063611627, 0.005441591609269381, -0.0192528385668993, 0.010916083119809628, -0.0002827308198902756, 0.01660771109163761, -0.005359342787414789, 0.00789590086787939, -0.006737835239619017, 0.01955551467835903, -0.01414682250469923, 0.08180153369903564, -0.0026155172381550074, -0.01418630126863718, -0.002362190280109644, -0.006797054782509804, 0.006579917389899492, 0.02122681401669979, 0.003553155343979597, -0.004615812096744776, 0.023082349449396133, -0.019279157742857933, 0.005885736085474491, -0.019660793244838715, 0.016212916001677513, 0.0024789839517325163, 0.0018489568028599024, -0.0038262219168245792, 0.009468501433730125, -0.0040269093587994576, 0.009363221935927868, -0.03311014547944069, -0.015673363581299782, 0.014817973598837852, 0.010837123729288578, -0.00789590086787939, 0.009705377742648125, -0.007053671404719353, -0.012712400406599045, -0.0304255373775959, -0.004365775268524885, 0.0008940462721511722, 0.02721453830599785, -0.010791064240038395, -0.01113979984074831, 0.025161603465676308, 0.023082349449396133, -0.0007682053255848587, -0.011804372072219849, 0.011455636471509933, 0.0008438744116574526, 0.023266587406396866, 0.006922073196619749, -0.018331648781895638, 0.011060841381549835, -0.009409281425178051, 0.02853052131831646, 0.0004885588423348963, -0.021884804591536522, -0.017950015142560005, -0.01342961098998785, -0.037821363657712936, -0.012396563775837421, -0.010823964141309261, 0.036347463726997375, -0.006046943832188845, -0.0007686165627092123, -0.038953110575675964, 0.02120049297809601, -0.02510896511375904, -0.02771461196243763, -0.033057503402233124, 0.05011264979839325, -0.0093698026612401, 0.005885736085474491, -0.009343482553958893, -0.1645505726337433, 0.011613554321229458, -0.020634621381759644, 0.022411199286580086, 0.008803929202258587, -0.0001505156105849892, 0.0024510191287845373, 0.0010988462017849088, -0.0006189234554767609, -0.019581833854317665, 0.013271693140268326, -0.033557578921318054, -0.013791507109999657, -0.003107365919277072, -0.006862853653728962, 0.002001939807087183, -0.04437496140599251, 0.005477780941873789, 0.0029000984504818916, 0.020345104858279228, 0.020753059536218643, -0.021016255021095276, 0.009738277643918991, -0.0072313291020691395, 0.007790622301399708, 0.024227255955338478, -0.025530079379677773, 0.005619249306619167, -0.013501990586519241, -0.00910002551972866, 0.015370686538517475, 0.013594109565019608, 0.013212474063038826, 0.0021302481181919575, 0.020621459931135178, -0.006168672349303961, -0.006316720508038998, 0.009146085008978844, -0.007487945724278688, 0.022884951904416084, 0.0010256445966660976, 0.013166414573788643, -0.019726591184735298, 0.010718685574829578, 0.005155364982783794, 0.014528457075357437, 0.023806141689419746, -0.013659908436238766, 0.011100320145487785, -0.018923841416835785, -0.008494673296809196, -0.007251068949699402, 0.026188071817159653, -0.02262175641953945, 0.022805992513895035, 0.02414829656481743, 0.004948097746819258, 0.004767150152474642, -0.0018835013033822179, -0.013291432522237301, 0.00585941644385457, -0.0062706610187888145, 0.010547607205808163, -0.01094898208975792, 0.0037275231443345547, -0.0003403050941415131, -0.007961699739098549, -0.021884804591536522, -0.023003390058875084, 0.014791654422879219, -0.001184385153464973, -0.0012468943605199456, -0.008047238923609257, -0.019081760197877884, 0.038795191794633865, -0.011508275754749775, -0.011731992475688457, 0.0031336855608969927, 0.017370982095599174, -0.0028523942455649376, 0.0034511666744947433, 0.024358853697776794, -0.020397743210196495, -0.020095067098736763, -0.0071128904819488525, -0.004503953270614147, 0.01019229181110859, 0.003665013937279582, 0.03545259311795235, -0.013870465569198132, 0.015239088796079159, -0.03532099723815918, -0.008975007571280003, -0.017252543941140175, -0.00583309680223465, 0.010718685574829578, -0.009396121837198734, -0.008553892374038696, 0.008448613807559013, 0.005961405113339424, 0.021871645003557205, -0.02359558269381523, -0.008692070841789246, 0.00037649463047273457, 0.012929537333548069, 0.021805845201015472, -0.029478030279278755, 0.010369949974119663, 0.052928853780031204, -0.01050154771655798, -0.01933179795742035, 0.011922810226678848, 0.018489567562937737, 0.01696302741765976, -0.007731402758508921, 0.0034544565714895725, -0.022884951904416084, -0.03621586412191391, -0.02002926915884018, -0.008106458000838757, 0.03958478197455406, -0.033478617668151855, -0.020252985879778862, -0.0011564204469323158, -0.03292590752243996, -0.021832166239619255, -0.09411913901567459, -0.003931500483304262, 0.009981734678149223, 0.017476260662078857, 0.008975007571280003, 0.0001089798824978061, -0.027609333395957947, 0.030872972682118416, 0.019147560000419617, 0.02262175641953945, -0.04824395477771759, -0.020134547725319862, -0.00892894808202982, -0.02755669318139553, 0.03287326544523239, 0.02763565257191658, 0.003132040612399578, -0.003214289667084813, -0.0012921312591060996, 0.020910976454615593, -0.019687112420797348, -0.023661382496356964, 0.011231918819248676, -0.003102431073784828, -0.037979282438755035, -0.014646896161139011, -0.033057503402233124, 0.012436043471097946, 0.0008743065409362316, -0.009468501433730125, -0.008494673296809196, -0.0056784688495099545, 0.004346035420894623, -0.007494525983929634, -0.0025908425450325012, 0.0041025783866643906, -0.0191344004124403, -0.02367454208433628, 0.02445097267627716, -0.03653170168399811, -0.004306555725634098, -0.0015734226908534765, 0.0014590966748073697, -0.04992841184139252, 0.009422441944479942, -0.017410460859537125, -0.011797791346907616, -0.0005432544276118279, -0.01626555621623993, -0.024661529809236526, 0.007277388591319323, -0.008119617588818073, -0.010975302197039127, -0.0005325620295479894, 0.019897669553756714, 0.017713136970996857, -0.011574074625968933, 0.003898601047694683, -0.019344957545399666, -0.03253111243247986, -0.008639431558549404, 0.015344367362558842, -0.044111765921115875, 0.01209388766437769, 0.005142205394804478, -0.005175104830414057, -0.0036979136057198048, 0.016778789460659027, 0.036005306988954544, 0.006876013707369566, 0.00686943344771862, 0.010001474060118198, -0.0049316477961838245, 0.001335723209194839, -0.01719990372657776, -0.008744710125029087, -0.045401427894830704, -0.00365843391045928, 0.011685932986438274, -0.0033853675704449415, -0.029399070888757706, -0.021911123767495155, -0.01758153922855854, -0.019305476918816566, 0.006829954218119383, 0.033478617668151855, -0.01746310107409954, -0.006685195956379175, 0.012607121840119362, -0.054007962346076965, 0.029820185154676437, 0.016528751701116562, -0.01369938813149929, -0.018055293709039688, 0.013975744135677814, -0.013830985873937607, -0.002880358835682273, -0.003661724040284753, -0.0094290217384696, 0.023740341886878014, 0.0016729439375922084, -0.007856421172618866, -0.07643231749534607, 0.017647339031100273, -0.0027964648324996233, -0.0193712767213583, 0.004161797929555178, -0.01325195375829935, 0.021095214411616325, -0.019463395699858665, -0.008738130331039429, 0.01835796982049942, -0.017568379640579224, 0.050323206931352615, -0.011067421175539494, -0.006744415033608675, -0.008593372069299221, -0.017594698816537857, 0.00803407933562994, 0.020700419321656227, 0.01804213412106037, 0.005780457518994808, -0.008975007571280003, 0.00226020161062479, -0.002404959872364998, 0.013087455183267593, -0.012449203990399837, 0.023503463715314865, -0.00981723703444004, 0.02771461196243763, -0.00803407933562994, 0.009198724292218685, 0.014528457075357437, -0.01606815867125988, 0.004757279995828867, 0.025859074667096138, -0.004724380560219288, -0.018226370215415955, 0.005392242223024368, 0.01963447406888008, 0.04219042882323265, 0.004648711532354355, -0.026030153036117554, -0.030030742287635803, 0.02216116152703762, -0.01516012940555811, 0.012995337136089802, -0.016291875392198563, -0.014107342809438705, 0.01734466291964054, 0.010468648746609688, -0.0037341031711548567, 0.011416156776249409, 0.005895605776458979, -0.0057113682851195335, -0.042874742299318314, 0.013962584547698498, -0.008356494829058647, -0.0027849499601870775, 0.028056766837835312, 0.016436632722616196, -0.012903218157589436, 0.05648200958967209, -0.0019065310480073094, 0.016015518456697464, 0.0028935186564922333, -0.0011194084072485566, -0.013054556213319302, -0.037163373082876205, 0.007132630329579115, 0.028977956622838974, -0.05885078012943268, -2.9172681024647318e-05, -0.02263491600751877, -0.023279746994376183, -0.017476260662078857, -0.01209388766437769, 0.011903070844709873, -0.028056766837835312, 0.039453182369470596, -0.011876750737428665, 0.0024214095901697874, 0.001817702199332416, -0.007757722400128841, -0.012179426848888397, 0.015054850839078426, 0.030794013291597366, 0.011297717690467834, 0.005991014651954174, 0.0013595754280686378, -0.0269776601344347, -0.006020624190568924, -0.03174152225255966, 0.003921630792319775, -0.01646295376121998, -0.016949867829680443, 0.0011194084072485566, 0.003146845381706953, 0.0036814636550843716, 0.009494820609688759, 0.012212326750159264, 0.010337050072848797, -0.007330027874559164, 0.03366285562515259, 0.00192627077922225, -0.03368917480111122, -0.009751437231898308, 0.023266587406396866, -0.03563683107495308, -0.03139936551451683, 0.013015076518058777, 0.019700272008776665, -0.0036913335788995028, -0.001099668676033616, -0.005458041559904814, 0.016594551503658295, -0.01496273186057806, 0.003559735370799899, -0.028267323970794678, -0.03300486505031586, -0.04498031362891197, 0.04195355251431465, 0.006573337595909834, 0.028714759275317192, 0.02391142025589943, -0.0013381906319409609, -0.008139357902109623, 0.015712842345237732, 0.013844146393239498, 0.00028088022372685373, 0.006915492936968803, 0.009948834776878357, 0.006451609078794718, 0.021990083158016205, 0.005958115216344595, -0.015633882954716682, -0.007303708232939243, 0.007053671404719353, 0.018002653494477272, 0.0017190034268423915, 0.03640010207891464, 0.12054408341646194, 0.0010133072501048446, -0.010468648746609688, 0.020542502403259277, 0.012087307870388031, 0.0063463300466537476, -0.01052128802984953, -0.016712989658117294, 0.003510385984554887, -0.0016383994370698929, 0.01875276491045952, -0.0016745890025049448, -0.01610763743519783, -0.04071652889251709, 0.0009861651342362165, 0.004809919744729996, -0.03213631734251976, 0.012975596822798252, -0.021279452368617058, -0.016094477847218513, 0.0016540266806259751, -0.01656823232769966, 0.023542944341897964, -0.004826369229704142, -0.0019328506896272302, 0.007928800769150257, 0.01113979984074831, -0.01804213412106037, -0.03382077440619469, 0.004122318234294653, -0.013219053857028484, -0.007994599640369415, -0.02204272337257862, -0.00999489426612854, 0.0034083970822393894, -0.014094183221459389, 0.0003664191463030875, -0.005691628437489271, 0.009810656309127808, 0.02620123140513897, -0.012008349411189556, 0.03408396989107132, -0.0067049358040094376, -0.005346182733774185, 0.001078283996321261, 0.013245373964309692, 0.0018045423785224557, -0.0027158609591424465, -0.04203251004219055], "link": "https://download.itau.com.br/bankline/layout_cobranca_400bytes_cnab_itau.pdf"}