{"titulo": "ClippFarma", "conteudo": "Boa tarde parceiros, tudo bem? Sejam bem-vindos a mais uma live. Boa tarde pessoal, tudo bem com vocês? Tudo certo? Joia. Boa tarde aí para o Alcir, que já chegou aí em cima da hora. Tudo bem com vocês? Vamos aguardar um pouquinho, o pessoal está chegando na live aí, o pessoal está pegando uma água, um café, né? Então vamos lá. Boa tarde para a Bruna, que também está chegando aí nos comentários. Hoje vocês estão percebendo já que tem cara nova aí no pedaço, né? Já vou apresentar ele aqui a pouco. Boa tarde aí para o Félix, mais uma vez aí com nós. Toda semana aí já está de carteirinha aí, toda semana aí com a gente. Figurinha carimbada nas lives já, né? Esse sim. Boa tarde para a Gabriela, Miquelino. Boa tarde para o Paulo, tudo certo? Como é que vocês estão? Tranquilos? Boa tarde aí pessoal da 3S Soluções, Fortaleza Ceará, o outro lado do Brasil, né? Para quem ainda não sabe, a gente está falando de sedes separadas, né? Eu estou falando de Florianópolis e o nosso convidado hoje aqui para a nossa live está falando de onde mesmo? De Concórdia, Santa Catarina também. É isso mesmo. Boa tarde o pessoal aí, boa tarde aí para o Rogério também. Boa tarde para a Milena, que acabou de chegar. Sejam bem-vindos à live. Boa tarde para a Razum. Tudo certo, Clayton? Como é que está? Vamos aguardar o pessoal entrar ali, vamos esperar um pouquinho, né? Então, enquanto isso, só dando uma recapitulada. O nosso treinamento da semana passada foi comigo, então a gente falou um pouco sobre a ordem de serviço, a gente terminou a ordem de serviço, segunda parte. E eu estou vendo aqui no comentário que tem gente até de fora do país aqui na nossa live. Uma novidade aqui. O pessoal acho que da Razum deve estar fora do país. Diretamente do Canadá também participando da nossa live. É um prazer ter vocês aqui conosco. Boa tarde aí para o pessoal do Info Super Prime. Luciano, boa tarde aí, seja bem-vindo. Então, como vocês podem estar vendo hoje, o tema é um pouco recente. Foi soltado nas mídias aí para quem acompanha. Ele é o Clip Pharma. É um módulo novo, um plugin adicional que a gente tem no sistema, voltado para farmácias. E hoje, nada mais, nada menos do que melhor trazer a pessoa que entende muito mais do que eu sobre o Clip Pharma. Então, vou estar apresentando ele aqui agora. Nosso amigo Thiago. Pode se apresentar aí, Thiago. Boa tarde então, galera, novamente. Então, como vocês já me conhecem de outras lives que a gente faz aí, então hoje eu vou estar falando um pouquinho sobre o Clip Pharma. Como a Dina falou, muito bem, pontuou aí. É um assunto recente que a gente teve o lançamento nas semanas anteriores. Então, a gente quer aprofundar um pouquinho mais a parte técnica. Então, o lançamento foi mais uma parte superficial sobre o módulo, algumas explicações básicas. E hoje a gente vai aprofundar um pouquinho mais nas soluções. Mas claro, a gente está orientando os parceiros que têm interesse, tudo mais, a entrar em contato com a gente para conseguir licenças, para estar validando esse processo, para estar validando na prática. Porque a gente sabe que a gente pode falar, falar, falar, mas quando chega na prática é diferente. Então, a gente vai estar apresentando aí um pouquinho mais sobre o módulo. A Dina, será que a gente começa? Espera mais um pouquinho. Então, antes de a gente começar, só lembrando, para quem está toda semana aí, pode estar marcando a gente depois lá no perfil da linha Clip, lá no Instagram. Para quem sempre faz as postagens ali. Posso estar mandando também aqui no chat, aqui para as redes sociais. Pode estar marcando a gente, tá? Muito importante também para entender o engajamento que vocês estão tendo conosco. E no final do nosso treinamento, como de praxe, de sempre, a gente sempre manda um link de avaliação, tá? Muito importante, tanto para mim, quanto para o Thiago, tá? Que a gente consegue estar tendo noção de quais são os conteúdos que vocês estão tendo necessidade de aprender e também como está sendo a nossa performance aqui para trazer um treinamento, um ensinamento de excelência e também de uma forma que vocês conseguem entender de uma forma prática, né? Então, hoje, como havia dito, trouxe o Thiago aqui que ele é uma pessoa que entende muito bem sobre Clip Farma. Então, vocês vão gostar aí. E eu creio que acho que agora já tem um tempinho aqui o pessoal deve estar todo mundo chegado, todo mundo se acomodado. Então, vamos iniciar o nosso treinamento. Vou estar passando a palavra, então, para o Thiago. Ele vai estar apresentando aqui com vocês. Perfeito? Vamos lá? Vamos lá, galera. Então, vamos iniciar aí a conversa. Então, hoje não tem apresentação, nada como o Adnan sempre faz nas lives, né? Então, não vai ter apresentação, nada. Já é direto na tela do sistema, já é direto na prática mesmo. Então, deixa eu adicionar aqui minha tela. Então, basicamente, a gente vai dividir em algumas etapas essa conversa, né? Então, quero dividir sobre a etapa do estoque para mostrar como que funciona o cadastro mesmo dos medicamentos, a partir das compras. E depois a gente vai para o módulo da venda, né? Na NFC e também para o módulo do ClipFarm. Iniciando pela parte do estoque, né? Então, iniciando aí com o cadastro de produtos. A primeira mudança que a gente tem aqui, né? As primeiras configurações e visualizações que você pode ter é a questão aqui dos registros, né? Das colunas específicas do ClipFarm. Então, é a questão do registro do Ministério da Saúde e da lista Anvisa. Então, nessa tela aqui, nesse grid, você consegue acompanhar e saber fazer os filtros, enfim, das informações que você precisa. Mas para cadastrar um produto, que ele é um medicamento que é controlado, basicamente, para você abrir o cadastro dele, é só abrir como um cadastro comum de um produto aqui. E depois disso, você já consegue vincular as informações dele aqui. Então, você consegue colocar a descrição, enfim. O cadastro do produto, do medicamento controlado, ele é bem semelhante, no caso, é igual a um cadastro de um produto comum que a gente já tinha dentro da solução. O que muda mesmo é que aqui no cadastro, na aba de campos, controles adicionais, tem a opção de farmácia. E aí, com isso, você vai ter os campos de não controlado e medicamento controlado. Então, nesse caso, eu tenho um medicamento que não é um medicamento controlado, porque a gente sabe que tem medicamentos que são mais comuns, que não tem um controle da Anvisa e tudo mais. Então, basicamente, é só você deixar essa opção aqui de não controlado e manter o cadastro como um produto comum. Mas, já se você tiver um medicamento que é mais controlado, enfim, que são os controles específicos da Anvisa, que precisa daquela questão do SNGPC, que eu já vou explicar para vocês melhor o que é esse documento, enfim. Então, você tem que ativar essa opção aqui de medicamento controlado e marcar aqui qual é a faixa, no caso, qual é o grupo daquele medicamento. Então, todo medicamento controlado, ele tem uma classificação específica. Então, a gente tem vários tipos aqui. Tem exemplo do tipo A1, que é dos entorpecentes. Tem aqui os psicotrópicos, enfim. Então, cada medicamento específico, ele se encaixa em uma categoria específica de medicamentos. Então, é muito importante preencher isso da forma correta, porque a solução, depois eu vou mostrar para vocês também, mas a solução, ela possui um controle específico. Ele possui algumas validações específicas em cima desse tipo específico de medicamento. Então, é muito importante que o cliente preencha de forma correta. É clientes, enfim, que já tem experiência com farmácia e tudo mais, é mais comum, e essas informações de como o medicamento se enquadra, e tudo mais, isso o cliente consegue encontrar também em alguns portais e tudo mais específicos de medicamentos. Então, é mais tranquilo também para o cliente conseguir cadastrar essas informações da forma correta. Então, eu vou só selecionar um tipo aqui, e a outra informação que o cliente tem que preencher é o registro do Ministério da Saúde. Esse registro do Ministério da Saúde, ele é basicamente o código desse medicamento lá na Anvisa. Então, ele é o código desse medicamento lá no Ministério da Saúde, na Anvisa. Então, o produto tem uma descrição específica, ele tem um controle específico, e para a Anvisa identificar essas informações, para ele identificar esses pontos aqui, ele precisa preencher, no caso, essa informação, que é o código do produto direto lá na Anvisa. Eu vou pegar um produto aqui que eu já tenho cadastrado, só para vocês entenderem mais ou menos como é o cadastro dele. Então, basicamente, ele vai ficar dessa forma aqui. A partir do momento que você marcar que o medicamento é controlado, você ativa uma série de validações dentro da solução. Então, tem algumas validações que a gente faz, que a gente fez aí na construção do projeto, para que a solução... para que o cadastro do produto fique correto desde o início, para que depois, quando o cliente vai gerar os documentos e tudo mais, ele não tenha que sofrer fazendo várias alterações. Então, a gente já faz algumas validações logo no cadastro do produto para que não ocorra essas questões. Talvez o cliente está emitindo uma venda e tal, com alguma informação incorreta e tudo mais. Então, por isso que a gente já faz algumas validações. Uma das validações que a gente faz é que o produto, quando ele for controlado, obrigatoriamente, ele já tem que ter o cadastro de lotes. Então, obrigatoriamente, quando você tentar que você estiver cadastrando um produto e ele não está com...\na questão de lote marcado, o controle de lote marcado, ativo, então ele não vai deixar você gravar o cadastro desse produto. Então é muito importante lembrar desse detalhe e até a solução ela vai já te orientar aqui que ele tem que ter o controle por lote e ela já orienta que tem que ser do tipo manual. Então o que acontece? Por que o produto tem que ter o controle de lote? Porque quando você gera o produto controlado, o medicamento controlado, quando você vai gerar o SNGPC, as informações que saem lá no SNGPC, é uma sigla, é complicado de falar, mas quando você gera os documentos que vão para este órgão e tudo mais, ele gera o registro do Ministério da Saúde e já sai registrado o número do lote. Então não sai código de base do produto, não sai descrição do produto, não sai nenhuma dessas informações. É só o código mesmo lá no Visa e o lote que você efetua a movimentação. Então uma entrada, uma saída, quando você vai gerar o inventário, ele vai gerar as informações dele, mas ele vai listar pelo lote. Então digamos assim, o principal controle da Anvisa são essas duas informações, o lote e o registro do Ministério da Saúde, que é o código dele. Então por isso que ele tem que ter esse controle de lote. Então eu vou marcar aqui a opção de lote e aí com isso eu já consigo selecionar aqui o tipo. Se eu selecionar do tipo automático, a solução não vai deixar gravar também. Por quê? Porque ela tem que ser do tipo manual. Por que tem que ser do tipo manual? Isso a gente já tinha esses controles, enfim. Porque quando você coloca que ele é do tipo manual e você vai emitir uma venda, ele vai te pedir qual é o lote que você está vendendo. Então eu posso vender medicamentos de lotes diferentes e a solução precisa ter essa informação de qual lote eu estou emitindo naquela venda para ele conseguir linkar com a movimentação correta. Então por isso que quando você marca a opção de lote e o medicamento for controlado, automaticamente ele tem que ser do tipo manual. Então é basicamente esses os controles. E um outro controle também é a questão aqui da unidade de medida. Então isso é um controle que o pessoal da Anvisa mesmo pede para gerar ali no SNGPC. O medicamento controlado, ele tem algumas unidades de medidas que são aceitas. Então deixa eu pegar aqui e cadastrar um novo produto. Porque a solução já apresenta aqui quais são esses produtos. Qual é o tipo que ele aceita. Então deixa eu só selecionar aqui as informações e preencher informações fictícias. Vou marcar aqui a questão do lote. E vou colocar aqui o lote que eu quero. Então deixa eu só gravar aqui. Opa, faltam só as informações aqui de CST. E aqui também vou colocar um desse. Então automaticamente, quando eu tentar gravar o cadastro do produto e ele não está com a unidade de medida correta, que seria a caixa e frasco, então eu não consigo também gravar. Por quê? Porque essas são as duas únicas unidades de medidas que são aceitas no SNGPC. Então por isso que a gente já fez essa validação também. Então a gente, com base na documentação do SNGPC e tudo mais, a gente encontrou essas informações e já foi feita essa validação. Então ele só vai conseguir gravar um produto que é controlado, que é um medicamento controlado, quando o tipo da unidade de medida for caixa ou frasco. Então a questão aqui da caixa, a gente já tinha o cadastro padrão no sistema. Ele já vinha por padrão cadastrado. E aí a gente adicionou também a questão do frasco. Então por padrão ele já vai ter essa questão aqui do frasco. O cliente não precisa cadastrar isso manual. Então é um outro processo que a gente fez. Então basicamente, efetuando esses processos, ele vai gravar o produto. Então aqui ele já gravou o meu produto e armazenou com as informações corretas. Mas eu sei que pode surgir dúvidas também referente à nota de compra. Eu até vi que alguém, aqui ó, eu já vi a mensagem do Félix aqui, que ele questionou sobre as informações no momento da nota de compra. Então se ele já traz essa classificação da lista da Anvisa. Sim, ele já traz essas informações no momento que você importa a nota. Então tem uma tag específica, que são umas tags do XML, que é a tag med, que até a gente já gera isso na venda há um tempo. Então quando possuir essa tag med, ele já vai retornar também essas informações. Tem uma opção que eu marco lá no momento da nota de compra, que eu vou até mostrar agora aqui para vocês. Então eu vou pegar um XML de exemplo aqui, tá? Então pegar esse XML. Só não liguem para os produtos que possuem aqui, tá? É só um XML de exemplo, então tem itens aleatórios aqui dentro, tá? Mas basicamente, então aqui eu tenho uma compra normal. Vamos simular que esse primeiro produto que tem aqui, ele é um medicamento controlado, tá? Então quando ele se tratar de um medicamento controlado, eu tenho essa coluna aqui, que é a coluna do medicamento CTRL, que é a abreviação ali. Então eu posso vir nessa coluna e marcar ela como sim. Que a partir do momento que eu clicar para fazer o cadastro, já vou simular isso para vocês também, mas que eu marcar esse item para efetuar o cadastro, ele já vai abrir a tela do estoque para você finalizar o cadastro desse produto, tá? Então quando são produtos de outros tipos, um produto comum, que já era o padrão do sistema, que é aquela importação normal, e você clicava para cadastrar, ele já cadastrava o produto automaticamente, e aí você tinha que acessar o estoque e fazer a alteração. Então qualquer alteração que você precisava fazer no produto, você tinha que ir lá no estoque. Mas já com essa questão do medicamento controlado, tem algumas informações mais sensíveis, alguns dados mais específicos. Então quando você marcar essa coluna como S, que você está informando para o sistema que é um medicamento controlado, automaticamente ele já vai abrir a tela do estoque para você efetuar o cadastro, tá? Eu vou até desvincular aqui e vou cadastrar esse segundo produto também. Deixa eu só alterar aqui e colocar como S também. Perfeito. Então fiz o processo. E aquela questão lá do Ministério da Saúde, como eu tinha iniciado o assunto e não tinha concluído ainda, então se você marcar essa opção aqui, ele vai procurar lá no XML que você está importando essa questão aqui do registro do Ministério da Saúde e ele já atualiza no cadastro do item do estoque, tá? Então se você está cadastrando um novo produto, ele simplesmente vai pegar esse código e vai gravar lá no cadastro desse novo produto. Se você estiver importando um item que já está cadastrado e você deseja atualizar talvez o código porque teve alguma atualização, enfim, ou porque precisa fazer esse processo, é só você marcar essa opção que ela vale tanto para produtos novos quanto para os produtos que você já tinha cadastrado no estoque. Então marcando essa opção aqui, ele já vai atualizar também. Então eu vou clicar aqui para cadastrar todos. E aí com isso, vocês podem ver que aquele meu produto que eu acabei de cadastrar, ele já vai habilitar aqui as telas do estoque. Então eu posso preencher aqui a tributação, vou colocar aqui, claro que a quantidade o sistema mesmo já alimenta, no momento que você importa, tá? E aí aqui eu já tenho acesso às informações do meu produto. Então ele já vem aqui com o medicamento controlado, porque na tela anterior eu sinalizei que era um medicamento controlado. E aqui eu consigo selecionar as informações dele. Então, deixa eu só clicar aqui, e aí ele já finaliza. E aí no meu caso aqui, eu já tinha o item cadastrado com o código de base, mas aí ele já faz o cadastro das informações. Então se eu tiver mais de um produto, então eu tenho cinco produtos que são medicamentos controlados, o sistema, ele vai passar uma lista, e você finalizando o cadastro do primeiro produto, ele já faz o processo para os demais produtos. Então dúvida que pode surgir também, essa não vi, se tinha no comentário, enfim. Mas a questão de lotes, então o sistema ele traz as informações dos lotes também, que como é importante para a questão ali de medicamentos controlados, sim, o sistema já traz essa parte de lotes, na verdade isso não foi feito nem aqui no Clip Farma, isso já era um comportamento que tinha padrão no sistema antes. Então eu consigo trazer essa informação, já conseguia antes, então a gente só manteve o mesmo comportamento. Então basicamente eu consigo vir aqui e vincular as informações. Deixa eu só alterar isso aqui, porque eu já tenho o código de base dele, então ele vai dar problema aqui se eu tentar importar. Então basicamente clicando em importar, ele já traz as informações, já traz a unidade medida, tudo certinho nesse momento da compra. Então aquela questão do lote, como eu falei para vocês, ele já vai vincular aqui e já dá a entrada correta, tanto no lote quanto na quantidade dos produtos. Basicamente, então essa é a principal mudança, que eu mencionei aqui para vocês que eu mostrei, essa é a principal mudança que você tem no momento de importar nota. Então se você vai efetuar um lançamento manual e tudo mais, então o sistema já vai trazer essa informação para vocês, se eu for lançar o item de forma manual. Deixa eu só pegar aqui um exemplo desse produto número 1. Então se eu for lançar aqui o produto, é pouco comum que nessa questão de farmácia mesmo, já efetuar o lançamento manual. A maioria das vezes já vai vir através do XML e tudo mais, porque tem que registrar essa questão aqui da compra. Então deixa eu só... Selecionei a opção errada aqui. Deixa eu só colocar aqui. Então vocês já podem ver que ele já traz aqui as informações do lançamento e mantém aquela questão aqui do lote. Então é importante lembrar desse detalhe.\nBasicamente é isso, então mostrei como cadastrar, mostrei como importar agora, e aí chega para a etapa da venda, que é onde você emite o documento que você vai estar vendendo o produto para consumidor final. Então, basicamente, de mudanças que tem, a gente fez algumas alterações aqui dentro da tela da NFC, então, onde você vai efetuar os lançamentos. Então, eu vou abrir uma nova venda. O processo de abertura, o processo de sincronização e tudo mais é exatamente igual como era anteriormente, o processo de lançamento. Vai ter alteração no final da venda, que ele vai abrir uma tela um pouquinho diferente. Deixa só ele atualizar aqui. Enquanto ele vai atualizando, deixa eu pegar aqui alguns códigos de produtos. Então, eu vou lançar o produto 1, o produto 25 e o produto 16. 1, 25 e 16. Então, deixa eu só... Opa. O que eu esqueci de preencher aqui? Meu Deus. Só um segundinho, galera. Deixa eu colocar aqui que eu troquei a base de computador. Então, eu vou colocar o produto número 1. Então, vocês podem ver que tem aqui a questão dos lotes. Então, como o lote está marcado de forma manual, ele vai habilitar essa janela aqui. Vou colocar aqui. Aí, eu vou colocar o produto 25. Né? Então, deixa eu colocar aqui a quantidade 1 também. E aí, eu vou colocar... Meu Deus, a memória não está andando em dia, gente. E é o 28. Então, deixa eu só colocar aqui o produto 28. Então, pode ver que ele já habilitou aqui. E aqui, eu vou colocar dois produtos diferentes, só para a gente ter essas informações, né? Então, basicamente, fiz a venda, né? Informei os produtos, fiz o lançamento deles. Agora, eu vou para a etapa de finalização. Eu vou pular essa etapa do cliente, porque é obrigatório ter o vínculo de um cliente, informar os dados do cliente. Mas eu vou pular aqui só para vocês verem que ele não vai permitir continuar com a venda até que não seja preenchido as informações do cliente. E aqui tem um ponto importante que é legal vocês lembrarem quando vocês estiverem fazendo uma implantação no cliente, está dando um treinamento, algo nesse sentido, que não é obrigatório ter um cliente cadastrado. Eu não preciso vincular um cliente que esteja cadastrado. Basta informar esses três campos, que é o campo do nome, o campo do CPF e também o campo do RG. Esse campo do RG, eu consigo… Ele não tinha, no caso, esse campo não estava presente nessa tela. Então, para a questão do ClipFarm, ele vai estar presente para a gente não obrigar a ter um cliente cadastrado. Se a gente não tivesse esse campo nessa tela, eu teria que cadastrar o cliente para vincular as informações. Então, eu vou colocar aqui os dados e vou clicar em OK. Automaticamente, clicando em OK, ele já vai abrir essa tela. Essa tela é para quê? Essa tela é para você preencher os dados dos medicamentos controlados. Então, quando a venda possuir um medicamento controlado, ele sempre vai abrir essa tela na finalização da venda. Então, automaticamente, ele vai abrir essa janela na finalização da venda. Então, se eu tenho um produto controlado e um produto que não é controlado, que não é medicamento controlado, então, aqui ele só vai listar os produtos que são medicamentos controlados. Os demais, ele não vai listar aqui. Então, esse é um controle específico para medicamento controlado. Mas é obrigatório o preenchimento dessas informações nesse momento? Não, não são obrigatórios. Tanto que eu tenho aqui a opção de preencher depois. Porque o que acontece? Em maioria das vezes, ou em todas as vezes que você recebe uma receita de um medicamento controlado, você sempre recebe duas vias. Isso falando como consumidor final. Eu sempre vou receber duas vias da receita. E é comum que quando você vai até a farmácia, tudo mais, eles coletem essa receita. Eles ficam com essa receita para eles e preenchem algumas informações. E eles podem preencher essas informações depois. Eu não preciso preencher no momento da venda. Então, por isso que essa tela não é obrigatória o preenchimento dela agora. Então, eu posso pular essa etapa e preencher essas informações depois, no caso. Então, eu vou só preencher um exemplo aqui para vocês verem, mas nessa mesma venda, eu vou preencher para um produto e não vou preencher para outro para vocês entenderem como que é o comportamento. Então, aqui, a primeira informação que eu preciso vincular é o tipo do medicamento. Então, é o tipo, no caso, da receita. E cada tipo de medicamento, cada tipo de receita, no caso, cada medicamento controlado, se encaixa em um tipo de receita específico. Então, vocês podem ver que eu tenho aqui a notificação amarela e aqui embaixo eu tenho um produto que está na cor amarela. Então, significa que esse medicamento controlado aqui embaixo, ele só pode ser vinculado a esse tipo de receita. Da mesma forma, temos outros produtos aqui embaixo, que é a questão aqui que eles estão em branco. Então, eu consigo só vincular ou a notificação branca ou a receita branca, no caso. Então, eu tenho dois tipos de receitas brancas aqui. Então, por isso, é importante que aqui no momento do cadastro do produto, agora vocês vão lembrar daquilo que eu falei lá no início, por isso que é importante você marcar aqui qual é o tipo do medicamento de forma correta, porque de acordo com essa classificação específica, eu vou conseguir preencher essas informações aqui. Eu vou tentar pegar esse medicamento e tentar vincular essa receita. Vocês podem ver que ele não vai deixar adicionar. Por quê? Porque o tipo estaria incorreto. Então, essa é uma validação que a gente tem, que a gente fez essa validação para não ter problemas no lançamento. Mas então, eu vou colocar aqui o número da receita, vou estar preenchendo ela, vou colocar aqui a data da prescrição. Essas informações vêm tudo na receita mesmo, já vêm prontos esses dados. Tem aqui o tipo de medicamento, humano ou veterinário, então eu posso escolher qual é o tipo dele aqui. O número do documento que eu estou gerando, então ele já grava essa informação, já grava qual é o comprador, que é basicamente o cliente que eu informei lá na tela de cliente. Por padrão, ele vai selecionar já a carteira de identidade, que é o documento mais comum que a gente tem em mãos, enfim. Então, eu vou selecionar aqui. Ele já vai preencher o RG, que é aquilo que eu selecionei na tela anterior também, e aí eu tenho que selecionar só qual é o órgão expeditor aqui do documento. Então, eu vou selecionar qualquer informação aqui. E aqui embaixo, eu preciso preencher os dados do paciente, porque às vezes eu posso ter um comprador e paciente diferente. Às vezes o paciente é o Adnan, mas quem está efetando a compra sou eu. Então, é o Thiago que está comprando os medicamentos que vão ser destinados para o Adnan. Então, eu preciso ter essas duas informações. Então, eu vou colocar aqui o nome do Adnan, vou colocar aqui a idade, e eu não lembro a idade do Adnan, mas eu vou chutar uma idade aqui. Então, eu vou colocar essa informação. Aí eu tenho aqui a idade, em anos ou em meses. Então, eu posso escolher essa informação aqui também. O sexo, masculino e feminino. E aí a gente tem a questão aqui do CID. Então, o CID não é obrigatório o preenchimento dele. Então, tem momentos específicos, em receitas específicas que não são destacadas as informações do CID. Então, eu não preciso preencher, ele não é um campo obrigatório. Então, eu posso vincular essa informação. E aqui embaixo eu vou ter o prescritor. Basicamente, o prescritor foi quem prescreveu aquela receita. Então, é o médico, o dentista, enfim. Então, eu posso ter essas pessoas aí para ter esses dados. Então, eu vou selecionar aqui o prescritor. Para cadastrar o prescritor, eu posso clicar nessa opção aqui e ele já vai abrir a tela de cadastro deste prescritor. Então, eu vou ter aqui as informações. Deixa eu só selecionar novamente. E aqui embaixo chega aquela questão para mim vincular o medicamento à receita em específico. Então, eu vou selecionar aqui do tipo amarelo. Só reforçando, se eu tentar vincular do tipo da receita que não é, ele não vai deixar vincular. E aí com isso, eu vou gravar essa tela. No momento em que eu gravar, ele vai abrir novamente a tela. Por quê? Porque eu não vinculei todos os medicamentos daquela venda a uma receita em específico. Então, por isso que ele vai voltar e ele vai ficar em looping. Ele vai ficar abrindo essa janela até você vincular todos os produtos. Ah, mas eu não quero preencher essas informações agora, que é aquilo que eu falei para vocês no começo. Então, é só clicar aqui em preencher depois. Ele dá uma confirmação, porque às vezes o cliente clica de forma errada, enfim, que não era para clicar. Então, você pode selecionar sim ou não. E aí com isso, ele vai finalizar a venda. No meu caso, não finalizou, porque eu não estou com certificado e tudo mais. Mas basicamente, ele vai concluir a venda normalmente. Informações no XML e tudo mais, ele não sai as informações do medicamento para venda do consumidor. Está no XML do documento, se mantém o mesmo XML. Não destaca essas informações. E agora, então, a gente vai para o módulo novo. Como a Dina comentou, a ideia é tudo o que a gente fez, todos os controles que eu apresentei até agora para vocês, eles têm um norte, que é basicamente esse módulo novo do Clip Farma. E basicamente, o norte principal dessa evolução, desse projeto, é a geração do SNGPC. Então, o sistema foi todo construído para gerar essa questão do SNGPC. Então, basicamente, o módulo novo do Clip Farma, quando o cliente tiver o plugin ativo, ele vai estar disponível aqui em módulos adicionais ou na pasta de instalação da solução. Opa, deixa eu só pegar aqui.\nEntão, na pasta de instalação, ele vai ter aqui o atalho do Clip Pharma, tá? Então, o cliente só vai conseguir acessar ele a partir do momento que ele tiver o plugin ativo. Caso ele não tenha o plugin, ele vai apresentar uma rejeição, vai apresentar uma mensagem que você não consegue acessar ele. Então, basicamente, acessando o módulo... Deixa eu só acessar aqui só para vocês terem essa informação. Vou colocar aqui as informações da senha e ele já vai abrir esse módulo. Esse módulo tem quatro outros módulos dentro dele, os módulos principais, e tem a opção de configuração. Vou passar um pouquinho, vou explicar um pouquinho para vocês sobre essa questão aqui dos módulos. Então, o primeiro módulo, ele vai carregar todo medicamento que está vinculado a uma venda. Então, todo medicamento que eu vincular a ele a uma venda, no caso a uma NFC, ele vai listar aqui. Então, eu vou conseguir acompanhar. Se ela estiver na cor verde, é porque aquele medicamento específico já foi vinculado a uma receita. Então, você pode ver aqui que já tem receita lançada e já mostra as informações aqui da receita no grid. Então, eu consigo acompanhar bem certinho essas informações. Produtos que estão em vermelho é porque ele ainda não foi vinculado a nenhuma receita. Então, eu tenho que vincular esse medicamento a uma receita. E se eu não vincular nesse momento, pode ficar tranquilo que ele vai dar uma rejeição quando você for tentar gerar o SNGPC. Então, se ele não estiver vinculado a uma receita, ele não deixa você gerar o SNGPC por meio da solução. Então, basicamente, para você preencher os dados, é só você dar dois cliques e ele já vai mostrar aqui as informações. Então, deixa eu só pegar esse outro produto. Então, eu vou ter aqui as informações. Então, eu vou preencher aqui informações aleatórias dos dados aqui, só para a gente vincular. Então, agora eu vou pegar aqui e vou vincular os medicamentos. Então, eu vinculei três medicamentos aqui nas informações. Automaticamente, ele já vai mostrar dessa forma. Então, por quê? Porque eu já vinculei uma receita naquele medicamento. Então, eu já tenho os dados certinhos aqui do medicamento. Outras informações que a gente tem aqui em cima. Então, tem a opção para imprimir, tem a questão aqui dos médicos prescritores. Eu posso cadastrar eles por essa tela aqui também. E a gente tem outros dois relatórios aqui dentro, que é a questão de lotes e validades. Então, esse era um relatório que a gente já tinha dentro do sistema. Então, a gente só reaproveitou, digamos assim, nessa questão aqui do ClipFarm. Então, é basicamente para você acompanhar aqui a questão das validades dos produtos. Então, você tem esses dados certinhos aqui. E o outro é para você acompanhar as saídas de medicamentos. Então, quando tiver um medicamento controlado, saída de medicamento controlado, ele vai listar aqui todas as saídas. Então, ele mostra o produto, o número do lote, enfim, e qual foi a data da saída e qual foi o documento que gerou a saída. Uma dúvida que pode surgir. Ah, mas eu utilizei um medicamento controlado em uma venda gerencial. Eu consigo. Ele não vai abrir a tela da receita. Na venda gerencial, o comportamento é exatamente igual a uma venda comum de produto. O que vai alterar é que aqui ele vai listar de uma forma diferente. Ele não vai mostrar aqui o modelo como 65. Ele vai mostrar como GR. Só que assim, se eu tentar emitir uma... No caso, emitir a venda gerencial, estou com ela disponível aqui. E aí eu quero gerar o SNGPC. Ele não vai deixar você gerar até que você não transformar aquela venda num documento 65 e você preencher os dados da receita. Então, ele tem todo um controle específico até porque a gente sabe que a venda gerencial é uma etapa da venda. Ela ainda não é um documento fiscal. Então, por isso que você tem que ter esse processo de converter essa venda num documento gerencial. As outras funções daqui eu não vou ficar detalhando para vocês porque são funções que a gente já encontra dentro do Clip. Então, a parte de excluir um lançamento. Enfim, que você, nesse caso aqui, não vai estar conseguindo excluir. A parte de impressão. No caso, exportar as informações do grid. Então, você consegue estar fazendo por aqui. A parte de busca, enfim. Então, são os comportamentos padrões que a gente já tem dentro do Clip. O segundo módulo é o módulo de entradas de medicamentos. Então, aqui ele vai listar todas as compras que possuem um medicamento controlado vinculado àquela compra. Então, quando você colocar naquela telinha em específico, que eu mostrei para vocês da importação do XML, ou quando você já tiver um produto vinculado, que já estava cadastrado e você comprar aquele produto, ele vai listar aqui todas as compras de medicamentos controlados. Esse módulo em específico é somente para visualização. Então, eu não consigo alterar os dados, os lançamentos e tudo mais por aqui. Se eu precisar fazer alguma alteração, eu tenho que acessar a nota de compra e efetuar a alteração. Ele é somente para você ter essa separação das compras comuns, das compras específicas que você tem dos produtos e de medicamentos controlados. Então, ele serve só para você ter um filtro para acompanhar as informações, enfim, por meio dessa tela. Já o terceiro módulo, ele é um módulo que tem ações. E esse módulo aqui é em específico para ajustes de estoque. Então, quando você trata de medicamento controlado e tudo mais, tem alguns ajustes que você pode fazer nessa questão do estoque. Que é a questão, um produto venceu, passou a data de validade dele na minha empresa e tudo mais, e eu preciso da saída desse produto. Então, você consegue vir aqui e selecionar esses ajustes. É importante que você selecione a informação correta, porque essas informações constam no SNGPC. Então, qualquer movimentação que eu fizer por meio dessa tela, ela vai constar lá no SNGPC. Então, é importante que esteja marcado da forma correta. Então, eu vou selecionar aqui, vou colocar o meu produto e aqui embaixo ele vai listar todos os lotes que eu possuo desse produto. Então, eu vou colocar aqui a quantidade dele e vou colocar a quantidade de saída, que é uma unidade. Então, feito isso, o sistema já abaixa o estoque, ele já faz todo o processo ali e aí você consegue ter essa informação. E também, como essas informações que eu estou mostrando aqui, elas vão para o SNGPC, então eu consigo acompanhar se aquela movimentação específica já foi para o SNGPC ou não. Então, eu consigo acompanhar essas informações aqui. O quarto módulo é basicamente o módulo para você acompanhar todas as gerações que você fez de arquivo SNGPC. Então, eu gerei o arquivo de inventário, que é o arquivo que vai ter todos os produtos controlados dentro dele. Então, é nessa tela que vai mostrar qual foi a data que você gerou esse arquivo. Se eu estiver lançando uma... Eu gerei o SNGPC de movimento, que vai constar todas as movimentações dos documentos. Então, ele vai listar aqui também. Então, você consegue acompanhar por meio dessa tela todos os documentos do SNGPC que você gerou. Então, eu já vou gerar um arquivo aqui de exemplo só para vocês terem acesso a essa informação. E é claro, estou desde o começo falando SNGPC, SNGPC e tudo mais. Então, basicamente, o que é esse SNGPC? É um órgão que controla, basicamente, a questão dos medicamentos controlados. Então, é o órgão específico, junto com a Anvisa, que controla a questão de medicamentos controlados. E o SNGPC, basicamente, ele é um arquivo XML que você encaminha com duas informações. Então, tem duas modalidades do SNGPC. Tem o SNGPC de inventário, como eu falei para vocês, como o nome dele mesmo já explica, você vai gerar um inventário dos medicamentos controlados que você tem no estoque, e também o de movimentos. Então, o de movimentos, toda movimentação que você fizer de medicamento controlado, desde venda, compra, o ajuste ali do estoque e tudo mais, então, ele vai constar nesse relatório aqui, no caso, nesse XML. Eu vou tentar gerar um de inventário aqui. E vamos lá. Então, basicamente, tentei gerar aqui o de inventário. Ele vai trazer uma data, porque ele só registra uma data em específica, não é um período em específico, não são movimentações. Então, não é um período, é uma data em específico. Então, você vai marcar aqui as informações. No meu caso, os meus produtos estão com inconsistências. Então, no meu caso aqui, o meu produto número 1, ele tem seis unidades no estoque, mas ele só tem três nos lotes. Então, as quantidades não estão corretas. Então, para isso, eu tenho que fazer o ajuste desse produto. Então, eu esqueci de lançar uma nota de compra, esqueci de transmitir uma venda. Então, às vezes, eu emiti a NFC, mas eu não transmiti ela ainda. Então, ele não vai dar abaixo e tudo mais. Então, não ficaria correto. Então, ele tem que bater nessas quantidades. Então, eu vou só pegar aqui, ele tem que ficar certinho essa questão aqui das quantidades. Então, eu vou vir aqui na questão. Deixa eu só confirmar. Então, eu tenho três unidades aqui disponíveis, e aqui eu só tenho seis. Então, eu vou ajustar manual, só para a gente conseguir gerar o arquivo aqui. Então, vamos lá. Vou gerar aqui a questão do inventário. Então, o item 16 aqui, então, ele está com o valor negativo. Então, vamos lá também. Então, tem todos os controles específicos aqui. Deixa eu só pegar este outro produto. Deixa eu ver aqui. Então, esse item está com menos um aqui.\naqui, talvez por algum motivo, deixa eu colocar aqui, 25 unidades. Lembrando, eu só vou conseguir colocar, deixa eu colocar as informações já, 53, e aqui eu tenho que tirar aqui, agora vou ficar certo, isso aí. Eu só vou conseguir fazer essas alterações manuais até eu não gerar esse arquivo do inventário uma vez, tá? Então aqui, vamos simular que o meu cenário, que eu estou agora, é de um cliente que está migrando de uma solução, enfim, ainda está fazendo o ajuste de estoque, tá? Porque a partir do momento que eu gerar o inventário, eu não consigo mais alterar as quantidades de forma manual, tá? Então eu não consigo alterar a quantidade dos lotes de forma manual. Então deixa eu só remover esses dois produtos aqui, só porque eram os dois produtos de teste, então eles não vão estar certos. Agora eu vou, novamente, tentar gerar o inventário aqui. Meu Deus, tá, aqui é o 25, então, e o 28 também vai dar errado, porque eu não transmiti a nota, tá? Então, vamos lá. O 25, deveria ter usado menos produtos nos exemplos. Deixa eu só pegar aqui, deixa eu colocar 1 unidade, e pegar aqui também o 28, e efetuar o ajuste. Então aqui tem 12, e aqui, deixa eu colocar 12 unidades, tá? Deixa eu só ver, acho que agora vai dar certo. Isso aí, perfeito. Então, dessa forma, eu girei o arquivo aqui do inventário, né? Então ele salva numa pasta padrão, né? Então tem a pasta, a pasta do SNGPC, lá no, na minha instalação, né? Então automaticamente ele já mostra aqui os dados, né? Então ele vai mostrar que eu girei nessa data em específico, o meu inventário. Da mesma forma, eu faço a questão ali da movimentação, tá? Então eu também vou vir aqui, e ele vai gerar as informações. No meu caso em específico, como eu girei o inventário agora, eu já registrei que eu tinha essas quantidades hoje. Então todas as vendas que eu tinha feito, ela já considerou no inventário. Então eu não vou conseguir gerar as vendas a partir, com a data de hoje, tá? Então se eu tentar gerar aqui, vocês podem ver que o sistema vai dar uma mensagem, que os movimentos de hoje, eles só podem ser gerados no dia de amanhã, né? Então eles podem ser gerados amanhã, um dia posterior às movimentações, tá? Então por isso que tem que ter esse controle específico. Então eu só vou conseguir gerar com datas anteriores, digamos assim, né? Então por isso que eu não vou conseguir gerar agora, mas eu tenho um exemplo do sngpc de movimento, então já vou mostrar para vocês. Então basicamente, fazendo esse processo, eu vou ter os dois arquivos aqui na pasta. Então vou pegar aqui o sngpc, e aí aqui dentro eu vou ter os dois arquivos xml, tá? Então eu tenho aqui o xml de movimento e o xml de inventário. Basicamente a estrutura do xml de inventário, ela segue este padrão aqui. Deixa eu só aumentar um pouquinho. Então ele tem aqui as informações do cnpj do emissor, o cpf do transmissor, enfim, a data que foi gerada, né? E aqui embaixo ele vai abrir o corpo ali da questão do xml. Então ele vai ter o corpo, vai ter as informações do medicamento, ele vai dar aqui, no caso que seria uma entrada de medicamento, a entrada dele, e vai ter aqui as informações do inventário, tá? Então ele se repete para todos os medicamentos controlados. Então a partir do momento que você tem o medicamento controlado e você marca para gerar o sngpc, ele vai gerar nessa estrutura aqui a questão do inventário, tá? E a questão do movimento, ele vai, deixa eu pegar aqui que abriu na outra tela aqui. Então o movimento, ele basicamente vai mostrar um pouquinho diferente as movimentações. Então ele vai ter aqui, no meu caso é uma entrada de medicamento, né? Então ele vai ter aqui a nota fiscal de entrada, as informações dela, e qual é o produto que eu estou, que eu dei a entrada, né? Qual é o medicamento controlado que foi feito a entrada. Então vocês podem ver que aqui não sai descrição, como eu falei para vocês, não sai na base, nada. As informações principais são a classe terapêutica, né? Que é conforme o enquadramento ali do produto, o registro no Ministério da Saúde, né? Que é o código específico da Anvisa, o número do lote que eu dei a entrada, a quantidade que foi feita a entrada, né? E aí a unidade de medida do medicamento, né? Então cada unidade de medida, ela tem um código específico lá na Anvisa, tá? E aí aqui você coloca qual foi a data do recebimento do medicamento. Então aqui embaixo ele tem as outras informações, e aqui também ele vai ter aquela movimentação da perca, no caso, né? Dos medicamentos. Então ele tem um motivo em específico. Esses códigos aqui, eles são todos tabelados, tá? Então essa questão aqui da classe terapêutica, do motivo aqui, enfim, é tudo tabelado, então você encontra essas informações para saber se elas estão corretas, enfim. Então você tem aqui, e também você coloca aqui embaixo as informações do medicamento, né? Qual foi a data da saída. Da mesma forma, se eu emitir uma venda, né? Ele vai gerar no mesmo padrão aqui da questão da entrada, tá? Então ele gera basicamente dessa forma esse XML. Tá, mas até aqui a gente mostrou como é fácil para gerar esse arquivo, e aí talvez surgir a dúvida, ah, mas aonde que eu tenho que registrar essas informações? Eu encontrei um manual, um manual que a gente usou como base para mostrar aqui para vocês. Então o próprio SNMPC, ele possui um portal, né? Que é o portal lá da Anvisa, onde você registra essas movimentações. Então a partir do momento que você gera o XML, você tem que carregar, no caso, tem que mostrar para a Anvisa, né? Que foi gerado esse documento, que está tudo correto com ele. Então para isso, você precisa acessar esse portal aqui. Eu não vou conseguir demonstrar na prática, porque você só consegue efeito ao cadastro se você for uma farmácia mesmo, né? Se você for, faz a venda de medicamentos controlados e tudo mais, tem uma série de cadastros que você tem que estar fazendo, tá? Mas a partir do momento que o cliente faz esse cadastro, ele tem acesso a esse portal. E nesse portal, ele vai ter aqui a opção de transmissão de arquivos, e aí com isso ele vai colocar o e-mail e a senha do responsável, né? Que vai gerar essa transmissão dos arquivos, e também vai carregar o arquivo, seja ele tanto de inventário quanto de movimento, tá? Então ele vai conseguir basicamente gerar. A partir do momento que ele clicar em transferir, ele já vai pegar esse arquivo XML que você anexou e já vai enviar, já vai dar a transmissão dele lá para a Anvisa, tá? Então ele já faz esse processo aqui. Ah, se caso tenha alguma informação faltante, tudo mais, no arquivo XML, ele vai mostrar também na tela qual é o campo que tá faltando e tudo mais. Mas como a gente já fez bastante amarrações dentro do sistema, então você não consegue enviar, digamos assim, um campo que era para ir em branco, que no caso era para ir preenchido, você não consegue gerar o arquivo XML se ele não tiver preenchido dentro do sistema. Então como a gente fez essas amarrações, dificilmente vai dar erro no momento que você for transferir, né? Então é por isso que a gente fez essa série de amarrações dentro da solução. Mas basicamente aqui você vai transmitir esse documento, tá? O documento de movimentações, ele tem uma particularidade, que ele tem que ser gerado no máximo sete dias. Então se eu gerar o arquivo hoje, daqui sete dias eu tenho que enviar esse arquivo até, no caso assim, no prazo máximo de sete dias eu tenho que enviar esse arquivo novamente. Então tem farmácias que adotam toda sexta-feira ou a cada três dias, a cada cinco dias, enfim, né? Então vai muito de acordo com o que a farmácia tem adotado como padrão, mas ele tem que ser enviado no prazo máximo de sete dias, tá? Então isso pode, se ele não enviar, pode gerar alguma atuação, algo nesse sentido para a questão ali da Anvisa, tá? Então basicamente são essas informações principais. Outro detalhe, o nosso tempo já está esgotando, mas é só para finalizar aqui a outra informação que a gente tem também. Esse caso, a gente sabe que é muito comum nessa questão de farmácia e tudo mais, os fiscais da Anvisa, os fiscais ali, eles irem até o estabelecimento para fazer ouvidoria, no caso, né, para fazer algumas fiscalizações. E nesses casos, em maioria dos casos, eles pedem esses arquivos, eles não pedem em formato XML, porque no XML ele tem que abrir arquivo por arquivo e analisar as informações, né? Então ele tem que pegar um XML, analisar, depois pegar outro XML e analisar. E aí com isso eles acabam solicitando esses relatórios em forma de PDF mesmo, em forma de um relatório mesmo, né, em PDF para conseguir acompanhar as informações. Então, para isso, a gente adicionou também o relatório do inventário, né, como um relatório em PDF, né, que ele vai ter basicamente as informações aqui dentro. Então ele vai ter aqui os dados das informações e também tem aqui a questão dos relatórios de movimento. Então eu coloco o filtro que eu quero, então às vezes o fiscal vai pedir a movimentação do ano todo, né? Então, se caso você precisar gerar do ano todo, não faria sentido você pegar todos os arquivos de cada sete dias, né? Imagina a quantidade de informações que você teria que passar para o fiscal. Então você pode vincular aqui as informações e aí selecionando o período, ele vai mostrar todas as movimentações, as entradas de medicamentos, venda de medicamentos, transferência e as outras saídas aqui também, tá? Então é uma forma de facilitar.\npara aí para o cliente também que passa por essas auditorias, tá? Basicamente, pessoal, assim, funções principais, dados principais ali do Clip Pharma, informações específicas, é basicamente isso, tá? O módulo, ele está sendo, só relembrando, tá? Ele está sendo construído, então a gente está ouvindo sugestões de vocês também, tá? Aproveitando esse momento para explicar isso, tá? Então deixem as sugestões de vocês lá no ZMapp, a gente marca conversas também para entender as melhores funcionalidades, enfim, aquilo que a gente pode estar implementando. Então, eu acredito que é isso. Acho que já posso trazer de volta aí a presença do Adnan para a gente ver algumas perguntas, enfim, se o Adnan também quiser complementar algo, fica à vontade, Adnan. Então, pessoal, é isso, né? Essa hoje foi a nossa live um pouco sobre o Clip Pharma. Tem um momento agora para perguntas, então ali eu vi do Alcir, ele comentou sobre não basta apenas só emitir uma nota de perda, de baixa ou produto vencido, ou vai precisar fazer todo esse processo que nem se mostrou ali antes? Então, quando for uma nota de transferência, ele já faz esse processo automático. Então, quando você marca o motivo lá, que é um motivo 99, ele já faz esse processo automático. Nos outros casos, quando é uma nota de perda, de baixa e tudo mais, por enquanto ele ainda não tem esse vínculo. Então você, sim, tem que emitir a nota e você ter que vir aqui registrar essas informações. Então, por enquanto, é manual, tá? Então é uma boa sugestão, Alcir, fica à vontade para ele lá no ZMF cadastrar isso, porque realmente ele tem que vincular essas informações de forma manual por enquanto, tá? Perfeito. Bom, pessoal, mandem as dúvidas de vocês aqui embaixo no chat, tá? Aproveitando também para estar agradecendo o Thiago hoje pelo treinamento. Se você gostou desse treinamento, deixa um joinha aqui. Também, se vocês quiserem postar nas redes sociais, pode estar marcando o nosso perfil do Instagram, que é o clipe.zucat. Então é clipe com dois P, .zucat. O zucat está aqui no meu cantinho aqui, se vocês souberem como é escrever. Então pode marcar o perfil nosso lá para a gente poder estar recompartilhando e também tendo um engajamento melhor também com vocês. A gente consegue entender também qual é a importância desse conteúdo que a gente acaba trazendo aqui para vocês. Então, se alguém realmente tiver alguma pergunta, pode estar mandando, lembrando também que a gente tem o link, tá? Da nossa avaliação, para ter nosso feedback. A gente tem um formulário que acabamos de enviar aqui no chat e também temos o canal do ZMapp, né? Que é onde você pode estar, então, encaminhando essas sugestões de melhorias na questão desse sistema. O outro, o Forms, que a gente tem ali nos comentários, seria referente, então, ao nosso feedback, nossa questão como treinamento, tá? E lembrando, passando aqui para lembrar, que amanhã, quinta-feira, nove horas da manhã, tem o produto em foco. Então, para quem quiser participar, está sendo convidado agora. E a gente vai falar algumas novidades ali também sobre o sistema, alguns outros detalhezinhos que tiveram ali também amanhã. Perfeito? Certo, pelo que eu vi aqui, não tem mais dúvidas, né? O pessoal já respondeu também aí no chat, né? O time estava ligado e já conseguiu tirar a maioria das dúvidas, né? Então, como a Dina falou, amanhã a gente tem o produto em foco. Eu vou estar de novo aí com vocês, né? Espero que não enjoem da minha presença, né? Mas amanhã a gente vai estar aí às nove horas da manhã para, como a Dina falou, para falar sobre as principais novidades, né? Claro, a gente não consegue destacar todas as últimas novidades, né? Mas as principais, enfim, que vai gerar mais impacto aí para os clientes. Pelo que eu estou vendo, não tem mais nenhuma dúvida. É isso aí. Então, semana que vem também, mesmo horário, mesmo local, duas horas da tarde. Então, valeu, pessoal. Bom trabalho para vocês e bom final de semana aí. Valeu, galera. Tamo junto. Abraço. Até mais. Tchau, tchau.", "embedding": [-0.00023855574545450509, 0.005089188925921917, 0.0030728105921298265, -0.025511359795928, -0.012965003959834576, 0.02159961685538292, 0.007581452839076519, -0.013364027254283428, -0.0025429592933505774, -0.007529121823608875, 0.014796588569879532, -0.010237250477075577, -0.02026517689228058, -0.005569980014115572, 0.009641985408961773, -0.007038518786430359, 0.0276045985519886, -0.010754019021987915, 0.020199762657284737, -0.013710720464587212, 0.01514982245862484, 0.018289681524038315, -0.0016116310143843293, 0.009380330331623554, -0.013501396402716637, -0.002399049000814557, -0.006557727698236704, -0.01747855171561241, 0.007705738767981529, -0.01221274584531784, -0.0020376380998641253, 0.008510327897965908, 0.000627563102170825, -4.257642558513908e-06, -0.029567010700702667, -0.013710720464587212, 0.01518907118588686, -0.002274762839078903, 0.017936447635293007, -0.011748308315873146, 0.014718092046678066, 0.002982866717502475, 0.0213379617780447, -0.005713890306651592, 0.005363926757127047, -0.014391022734344006, 0.0016271668719127774, -0.013148161582648754, -0.01640576682984829, 0.015175987966358662, 0.0016230784822255373, 0.02141645923256874, -0.03304702043533325, -0.00405892264097929, -0.0051251668483018875, -0.006112914066761732, 0.006770322099328041, 0.028049413114786148, 0.008994389325380325, -0.008634613826870918, -0.010701688006520271, -0.01460034679621458, -0.030901450663805008, 0.008274838328361511, 0.005350844003260136, -0.00203109672293067, 0.003983696922659874, 0.002387601649388671, -0.0062633659690618515, 0.007202052976936102, 0.0034374920651316643, 0.013566809706389904, 0.008183258585631847, -0.006789946462959051, 0.050996553152799606, -0.011833345517516136, -0.005305054597556591, -0.00017120002303272486, 0.006479231175035238, 0.007234759628772736, 0.025812262669205666, -0.017687875777482986, -0.025040380656719208, 0.012206204235553741, 0.021952850744128227, 0.0069076912477612495, 0.01624877378344536, 0.035951390862464905, -0.004507006611675024, -0.01146702840924263, 0.0030172087717801332, 0.021965933963656425, 0.04005937650799751, 0.012461317703127861, 0.004032757133245468, 0.002870027907192707, -0.0005151332006789744, 0.006076936610043049, 0.0008953505894169211, -0.001916622626595199, -0.019480211660265923, 0.001496339333243668, -0.0026934107299894094, -0.012023045681416988, -0.01699448935687542, 0.0033459127880632877, -0.00824213121086359, 0.004490653518587351, 0.016955241560935974, -0.001892092521302402, -0.009903640486299992, 0.045135483145713806, -0.0011848063440993428, -0.013449065387248993, 0.005072835832834244, 0.022057512775063515, 0.012572521343827248, -0.03147709369659424, 0.006083477754145861, -0.002348353387787938, -0.014744257554411888, 0.017714040353894234, -0.0007097391062416136, -0.0006402370054274797, 0.019035398960113525, 0.0008683674386702478, -0.009792436845600605, -0.011336201801896095, -0.024647897109389305, -0.01641884818673134, 0.018289681524038315, -0.003427680116146803, -0.006999270524829626, 0.010034468024969101, -0.02536744810640812, 0.03411980718374252, -0.028520390391349792, 0.0005282159545458853, -0.029096031561493874, -0.021782776340842247, 0.013880795799195766, 0.02820640616118908, -0.0018855511443689466, -0.016091780737042427, -0.02425541542470455, 0.015777794644236565, 0.027892420068383217, -0.0051382496021687984, 0.0004460399504750967, 0.008961682207882404, 0.02651873044669628, -0.001880645053461194, 0.004925654735416174, -0.002335270633921027, 0.0024072257801890373, 0.007620701100677252, 0.004451405256986618, 0.012794927693903446, -0.008215965703129768, -0.0013033688301220536, 0.01217349711805582, 0.0017857950879260898, -0.0026508918963372707, -0.005190580151975155, 0.010139130055904388, 0.0401902012526989, 0.0029730545356869698, -0.01166981179267168, 0.010466198436915874, 3.526209547999315e-05, -0.011624021455645561, 0.028991369530558586, -0.027735427021980286, 0.0017907011788338423, -0.00324452156201005, 0.010773642919957638, -0.0025576772168278694, 0.010073715820908546, -0.032942358404397964, -0.024660980328917503, 0.007895438931882381, -0.016942158341407776, 0.021481873467564583, 0.020723072811961174, -0.02259390614926815, 0.019794197753071785, 0.025799179449677467, -0.006940397899597883, -0.0209062322974205, -0.014613430015742779, 0.019977357238531113, 0.0110941706225276, -0.023405035957694054, -0.02361436001956463, -0.6359262466430664, -0.002672151429578662, 0.019977357238531113, -0.02369285747408867, 0.013540644198656082, 0.0037089590914547443, 0.015097491443157196, 0.027264447882771492, -0.04191712662577629, -0.018355095759034157, -0.02721211686730385, 0.02242382988333702, 0.001944423420354724, -0.0004901942447759211, -0.03409364074468613, -0.008686944842338562, 0.02836339734494686, -0.0007130097947083414, 0.0017972425557672977, 0.026139331981539726, -0.01632726937532425, -0.003918283153325319, -0.004994339309632778, 0.02150803804397583, 0.010211084969341755, -0.008229048922657967, -0.0009926535421982408, -0.008176717907190323, -0.025746848434209824, 0.0001666006282903254, -0.043984200805425644, 0.010937177576124668, 6.8160607042955235e-06, -0.011159583926200867, 0.053953252732753754, -0.032000403851270676, 0.01029612310230732, 0.008843937888741493, 0.014626512303948402, 0.02352278120815754, -0.013180868700146675, 0.004392532631754875, 0.023666691035032272, -0.028598887845873833, -0.0034963644575327635, -0.00023896456696093082, 0.021547285839915276, -0.01607869751751423, -0.01473117433488369, -0.01070822961628437, 0.011951090767979622, -0.024831056594848633, -0.03029964491724968, -0.01766170933842659, -0.006377839948982, 0.0016500615747645497, 0.028808211907744408, -0.002737564966082573, 0.015934787690639496, -0.005550356116145849, 0.019218556582927704, 0.01125116366893053, -0.001554394024424255, -0.032262057065963745, -0.023418119177222252, 0.003565048798918724, -0.016968324780464172, -0.003800538368523121, 0.0063516744412481785, 0.0036402747500687838, 0.0013254459481686354, -0.0009566759690642357, -0.02494880184531212, -0.016798248514533043, 0.007274007890373468, 0.030901450663805008, 0.020866982638835907, 0.008523410186171532, 0.009798978455364704, 0.017857952043414116, 0.0052003925666213036, 0.011061463505029678, -0.010211084969341755, -0.011264245957136154, 0.004052381496876478, 0.0037547487299889326, -0.022397665306925774, -0.010400785133242607, -0.007509497459977865, 0.005118625238537788, 0.0023663421161472797, 0.015306815505027771, 0.007888897322118282, -0.008935516700148582, 0.021822024136781693, 0.012376279570162296, -0.010642815381288528, 0.01259214524179697, -0.011460487730801105, -0.00904017873108387, 0.006073665805160999, -0.0035061766393482685, -0.0032134500797837973, -0.002189724938943982, 0.028755880892276764, 0.02484413981437683, 0.006704908329993486, 0.011565149761736393, 0.021233299747109413, -0.03741665929555893, 0.015960952267050743, -0.0029010993894189596, -0.015843208879232407, -0.015803959220647812, 0.0009133393759839237, -0.02870354987680912, -0.00924296211451292, 0.011689435690641403, -0.002624726388603449, -0.006796487607061863, 0.028389563784003258, -0.0025936549063771963, 0.012958462350070477, -0.0008642790489830077, 0.0074571664445102215, 0.002385966246947646, -0.00650866748765111, 0.0060540419071912766, -0.002402319572865963, -0.020147431641817093, 0.00771882152184844, -0.006495584733784199, 0.019388632848858833, -0.021285630762577057, 0.038201626390218735, -0.025079628452658653, 0.022306086495518684, 0.009766271337866783, 0.014626512303948402, -0.013233199715614319, -0.019611040130257607, -0.038123127073049545, 0.01624877378344536, -0.008189800195395947, -0.009314917027950287, -0.045397136360406876, -0.023705940693616867, 0.011139960028231144, -0.035951390862464905, -0.0015952775720506907, -0.002214255044236779, -0.011022215709090233, 0.005481671541929245, 0.03330867737531662, 0.009014013223350048, 0.009439202956855297, -0.027735427021980286, -0.028651218861341476, -0.03095378167927265, -0.02326112613081932, -0.0025756661780178547, 0.02375827170908451, -0.001982036279514432, -0.017216896638274193, -0.016759000718593597, -0.008392582647502422, -0.015934787690639496, 0.02377135306596756, -0.001211789553053677, -0.029069866985082626, -0.0009664880344644189, -0.021691197529435158, -0.008471079170703888, 0.00433038966730237, 0.004111253656446934, 0.00039800172089599073, 0.001447279006242752, 0.021808940917253494, 0.016863662749528885, -0.007005811668932438, -0.024242332205176353, -0.013959292322397232, 0.001503698411397636, -0.004919113125652075, 0.01733464188873768, 0.002636173740029335, -0.009766271337866783, 0.009727023541927338, -0.007313256151974201, 0.033334843814373016, 0.008968223817646503, 0.00904017873108387, -0.004680353216826916, 0.01774020679295063, -0.009478450752794743, 0.012500566430389881, 0.012827634811401367, 0.01982036419212818, -0.014888167381286621, 0.01505824364721775, 0.019480211660265923, 0.02101089432835579, 0.009955971501767635, -0.0035323421470820904, 0.003921553958207369, -0.021023975685238838, -0.00244647404178977, -0.028258737176656723, 0.03707651048898697, 0.025655269622802734, 0.009687774814665318, -0.01876066066324711, -0.012350114062428474, -0.011401615105569363, 0.00971394032239914, 0.02192668616771698, -0.021272549405694008, 0.0050924597308039665, -0.007901979610323906, 0.02502729743719101, -0.009053261950612068, 0.02076232060790062, 0.0083729587495327, -0.009929805994033813, -0.04563262686133385, 0.010989508591592312, 0.023967595770955086, 0.033099353313446045, -0.002958336379379034, -0.014430271461606026, -0.005069565027952194, 0.01597403548657894, 0.02369285747408867, 0.009426119737327099, 0.019270887598395348, -0.01355372741818428, 0.009655068628489971, -0.016615090891718864, 0.04176013171672821, -0.00025470476248301566, -0.007404835429042578, 0.023967595770955086, 0.0401902012526989, -0.010027926415205002, 0.02619166113436222, 0.00962890312075615, -0.009982137009501457, 0.018119607120752335, -0.005030316766351461, -0.0005666465149261057, -9.643416706239805e-05, -0.0036304625682532787, -0.019388632848858833, -0.02183510735630989, 0.03328251093626022, -0.02954084612429142, -0.022057512775063515, 0.0092037133872509, 0.0008618260617367923, 0.013180868700146675, -0.009007472544908524, 0.04202178865671158, -0.015764711424708366, -0.005929755512624979, 0.007045059930533171, 0.004559337627142668, -0.00581855233758688, -0.02619166113436222, 0.010897929780185223, 0.0010793267283588648, -0.0001646586460992694, -0.008732734248042107, 0.016013283282518387, 0.01406395435333252, 0.006803029216825962, -0.010773642919957638, -0.010917553678154945, -0.002997584640979767, 0.00870002806186676, -0.0023663421161472797, -0.009916722774505615, -0.0434870570898056, 0.02369285747408867, 0.02459556609392166, -0.029253024607896805, 0.005802198778837919, -0.024464739486575127, -0.004127607215195894, -0.012546355836093426, 0.01876066066324711, 0.002933806274086237, -0.009465368464589119, -0.0023581653367727995, 0.0019019045867025852, 0.006400734651833773, -0.007849648594856262, 0.015594636090099812, 0.015555387362837791, -0.022293003275990486, 0.011460487730801105, 0.003944448661059141, -0.030090320855379105, 0.005406445823609829, -0.02076232060790062, 0.009668150916695595, 0.012422069907188416, -0.02568143419921398, -0.007967393845319748, 0.0033393714111298323, -0.0008626437047496438, -0.0054980251006782055, 0.009210254997015, -0.01983344554901123, -0.029671672731637955, -0.0026672452222555876, 0.02091931365430355, -0.009236420504748821, -0.0054653179831802845, 0.016288021579384804, -0.03555890917778015, -0.02318263053894043, -0.0027032229118049145, 0.0029239943251013756, -0.009831685572862625, 0.042152613401412964, 0.027918584644794464, 0.00541952857747674, 0.043905701488256454, 0.006014793645590544, 0.01624877378344536, -0.004497194662690163, -0.00999521929770708, 0.02736910991370678, 0.00662968261167407, -0.017308475449681282, -0.00039186919457279146, 0.02344428561627865, 0.010485822334885597, 0.01393312681466341, 0.01707298681139946, 0.03605605289340019, -0.008176717907190323, 0.025328200310468674, 0.0017269228119403124, 0.012081918306648731, 0.002722847042605281, 0.02076232060790062, 0.01607869751751423, 0.035114094614982605, -0.008202883414924145, 0.008451455272734165, 0.02335270494222641, 0.02484413981437683, -0.003082622541114688, -0.006397463846951723, -0.006410546600818634, -0.0025184289552271366, 0.012788386084139347, 0.012395904399454594, -0.0029027347918599844, -0.00433038966730237, 0.023248042911291122, 0.011048381216824055, 0.015921704471111298, 0.023208795115351677, 0.02268548496067524, 0.008883185684680939, -0.020631494000554085, 0.0015781065449118614, -0.004922383930534124, -0.011068005114793777, -0.011532442644238472, -0.008601906709372997, -0.02335270494222641, 0.035035599023103714, 0.006462877616286278, -0.0036533575039356947, -0.008503786288201809, 0.0040425690822303295, 0.0110876290127635, 0.024988049641251564, -0.014783505350351334, -0.0007890532724559307, -7.282388833118603e-05, -0.01566004939377308, -0.004444863647222519, 0.008654237724840641, -0.011283870786428452, -0.02367977425456047, 0.0016974866157397628, -0.014469519257545471, -0.0036958763375878334, -0.014469519257545471, 0.014430271461606026, -0.03231438994407654, -0.012788386084139347, 0.011911842040717602, 0.001170088304206729, 0.02744760550558567, 0.015267567709088326, 0.00987747497856617, -0.0021717362105846405, 0.00917100626975298, 0.005412986967712641, -0.00092887511709705, -0.014508767984807491, 0.005625581834465265, -0.012356655672192574, 0.001466085435822606, -0.010034468024969101, 0.006750698201358318, 0.011336201801896095, -0.029854832217097282, 0.024739477783441544, -0.012278159148991108, 0.017125317826867104, 0.0267934687435627, 0.005877424497157335, -0.0008830855367705226, 0.020631494000554085, 0.009164465591311455, 0.0010106422705575824, 0.017177648842334747, -0.01641884818673134, -0.0009787530871108174, -0.03037814237177372, -0.022384582087397575, -0.016876745969057083, -0.0046999771147966385, -0.006178327836096287, -0.028389563784003258, 0.0001270457578357309, -0.023666691035032272, -0.00717588746920228, 0.0041177948005497456, -0.0064890431240201, 0.015934787690639496, -0.007143180351704359, 0.0011970715131610632, 0.018211185932159424, -0.006547915283590555, 0.04136765003204346, 0.013841548003256321, -0.01750471629202366, 0.029567010700702667, 0.0015494880499318242, 0.030744457617402077, 0.01435177493840456, 0.00041619493276812136, 0.020552998408675194, -0.025341283529996872, -0.019375549629330635, -0.011414698325097561, 0.010230708867311478, 0.02434699423611164, 0.02326112613081932, -0.025328200310468674, -0.008765441365540028, -0.00786273181438446, -0.030508968979120255, -0.011656728573143482, 0.013337861746549606, -0.008353334851562977, -0.0063058845698833466, -0.02659722790122032, 0.0015781065449118614, 0.008902810513973236, 0.001328716636635363, -0.018093440681695938, -0.034590788185596466, 0.0018839157419279218, -0.0052559939213097095, -0.0033393714111298323, 0.029907163232564926, -0.0024644627701491117, 0.007980476133525372, 0.00024243968073278666, -0.021861271932721138, -0.010610109195113182, -0.019218556582927704, -0.01806727610528469, -0.0288867074996233, 0.010283039882779121, 0.023287292569875717, 0.02770926058292389, -0.00527234748005867, -0.000896985933650285, 0.012677183374762535, 0.0027048583142459393, 0.01649734564125538, -0.020775403827428818, -0.00460185669362545, -0.011002590879797935, 0.010518529452383518, 0.0007960034417919815, 0.010754019021987915, 0.0076403249986469746, -0.0067245326936244965, -0.012814551591873169, -0.0007285455358214676, -0.015764711424708366, -0.020291343331336975, -0.005520919803529978, -0.013736885972321033, -0.027185950428247452, 0.001867562299594283, -0.015293732285499573, -0.000699109339620918, -0.020814651623368263, 0.0016018189489841461, 0.020212845876812935, 0.01490125060081482, 0.020356755703687668, -0.003417867934331298, 0.009249502792954445, -0.027421440929174423, 0.013462147675454617, 0.007888897322118282, -0.009262586012482643, -0.013920044526457787, 0.014979747124016285, -0.028572721406817436, -0.014037788845598698, 0.008098221383988857, 0.012879965826869011, 0.02251541055738926, 0.0036075678654015064, 0.0028046141378581524, -0.003365536918863654, -0.000385327817639336, 0.003941177856177092, -0.003007396822795272, -0.0015568470116704702, 0.007947769947350025, -0.0360037237405777, -0.012323948554694653, -0.0028405918274074793, -0.011009132489562035, -0.01815885491669178, -0.001769441762007773, 0.013475230894982815, 0.012088458985090256, -0.0004431780835147947, -0.014822754077613354, -0.0046868943609297276, -0.0005261717597022653, 0.020474500954151154, -0.007659948896616697, 0.02721211686730385, 0.027970915660262108, 0.005589604377746582, 0.0008634614059701562, 0.0009525876375846565, 0.004964902997016907, -0.005677912849932909, 0.007391752675175667, 0.02076232060790062, -0.02670188993215561, -0.016274938359856606, 0.03453845530748367, -0.005874154157936573, -0.019454047083854675, -0.02445165626704693, 0.040216367691755295, 0.008346793241798878, 0.003771102288737893, -0.024072255939245224, -0.002873298479244113, -0.014077037572860718, 0.0036206506192684174, -0.007313256151974201, -0.004559337627142668, -0.02920069359242916, -0.0052559939213097095, -0.025459028780460358, 0.017530882731080055, -0.017125317826867104, 0.019951190799474716, 0.027316778898239136, 0.00041844352381303906, 0.007705738767981529, 0.020147431641817093, -0.019859611988067627, 0.001132475445047021, -0.0015208694385364652, -0.003143130335956812, -0.018721412867307663, 0.0034963644575327635, 0.043382395058870316, 0.0376783162355423, -0.00385941076092422, 0.009537323378026485, -0.0029877726919949055, 0.02358819544315338, 0.002287845592945814, 0.0017220167210325599, 0.0032576043158769608, -0.002287845592945814, -0.00030724017415195704, 0.003761290106922388, 0.0032625102903693914, 0.0030613630078732967, -0.009288751520216465, -0.01632726937532425, 0.006112914066761732, 0.01564696617424488, -0.01640576682984829, -0.0045560672879219055, -0.0073197977617383, -0.016549676656723022, 0.0044154273346066475, -0.020121267065405846, 0.02074923925101757, 0.00891589280217886, -0.026230910792946815, -0.03898658975958824, -0.0010736030526459217, -0.006770322099328041, -0.02057916298508644, -0.008575741201639175, -0.004052381496876478, -0.009125216864049435, 0.006181598640978336, 0.013723802752792835, -0.013187410309910774, -0.0005122713628225029, -0.008170176297426224, 0.013906961306929588, 0.0005556079559028149, -0.03139859437942505, 0.011133418418467045, -0.02132488042116165, -0.03215739503502846, 0.007856190204620361, 0.013161244802176952, 0.010119506157934666, -0.027630764991044998, 0.000953405280597508, 0.0351664274930954, 0.0138022992759943, -0.007365587167441845, -0.011290411464869976, -0.0368148535490036, 0.005013963207602501, -0.020435253158211708, 0.005877424497157335, 0.019532542675733566, -0.018564419820904732, 0.01159785594791174, -0.002078521531075239, -0.011905301362276077, 0.012108083814382553, -0.03524492308497429, -0.0035944851115345955, 0.007090849336236715, 0.01932321861386299, -0.007391752675175667, -0.00278171943500638, -0.0148620018735528, 0.000819715962279588, -0.03388431668281555, 0.006279719062149525, -0.0007498050108551979, -0.018682165071368217, 0.012081918306648731, 0.011938007548451424, -0.007202052976936102, 0.004085088148713112, -0.01067552249878645, -0.03252371400594711, -0.02175660990178585, -0.025485193356871605, -0.037285830825567245, -0.017779454588890076, -0.0259430892765522, 0.015162905678153038, 0.006273177918046713, -0.027552267536520958, -0.018878405913710594, -3.752985548999277e-06, -0.02352278120815754, 0.010178377851843834, -0.013023875653743744, 0.016680503264069557, -0.004834075458347797, -0.020147431641817093, -0.012821093201637268, 0.05813973397016525, -0.001094862469471991, 0.001756359008140862, -0.016785165295004845, 0.03139859437942505, -0.025302035734057426, -0.012906131334602833, 0.02828490175306797, -0.004771932493895292, -0.0518600158393383, -0.010492363944649696, 0.006250283215194941, -0.01817193813621998, 0.010263415984809399, 0.019781114533543587, -0.03584672883152962, 0.0024824514985084534, 0.0014816212933510542, 0.003143130335956812, 0.03307318687438965, 0.016026366502046585, 0.022567741572856903, -0.026741137728095055, 0.0011046745348721743, 0.02593000791966915, 0.023483533412218094, -0.0027670012786984444, 0.01066898088902235, 0.01013258844614029, -0.018145771697163582, 0.00991018209606409, 0.00305318646132946, -0.010806350037455559, -0.0006459606811404228, -0.010629733093082905, 0.03626537695527077, 0.020814651623368263, -0.007790776435285807, 0.011748308315873146, 0.011591315269470215, 0.0023499885573983192, 0.00445467559620738, 0.009177547879517078, -0.010734395124018192, 0.015712380409240723, 0.003614109242334962, -0.013167786411941051, 0.017020655795931816, -0.027421440929174423, -0.003007396822795272, -0.0031529422849416733, -0.018682165071368217, -0.022894809022545815, -0.01572546362876892, -0.03707651048898697, 0.020396005362272263, 0.039117418229579926, -0.011610939167439938, -0.00025593125610612333, -0.006593705154955387, -0.01722997985780239, 0.018368178978562355, -0.010518529452383518, 0.02434699423611164, -0.016798248514533043, 0.0032461569644510746, 0.02201826497912407, -0.0021357587538659573, -0.0035356127191334963, 0.005949379876255989, 0.010354995727539062, -0.00908596906810999, 0.015856290236115456, 0.23737338185310364, -0.00811784528195858, -0.0017383701633661985, 0.04026870056986809, 0.027238281443715096, 0.027552267536520958, 0.022214505821466446, 0.006430170964449644, 0.006848818622529507, 0.016458097845315933, 0.008438372984528542, -0.007378669921308756, -0.030404306948184967, -0.008379500359296799, 0.018629834055900574, -0.006475960370153189, -0.03589906170964241, -0.03964072838425636, -0.012932296842336655, -0.024333911016583443, 0.0018871864303946495, -0.009151382371783257, -0.005458776839077473, -0.005906860809773207, 0.03171258047223091, 0.025799179449677467, -0.0020376380998641253, -0.0023565299343317747, 0.03791380301117897, -0.006161974277347326, -0.006682013627141714, -0.01435177493840456, 0.012441693805158138, 0.021939769387245178, -0.013154703192412853, -0.004507006611675024, 0.01268372405320406, -0.006449794862419367, 0.005380280315876007, 0.024909552186727524, 0.02124638296663761, 0.018263516947627068, -0.017857952043414116, -0.023300373926758766, 0.018394343554973602, 0.013449065387248993, -0.017347725108265877, -0.021913602948188782, -0.014391022734344006, 0.008104762993752956, -0.04207411780953407, -0.003082622541114688, 0.009766271337866783, 0.033779654651880264, 0.009975595399737358, 0.014404105953872204, -0.012350114062428474, 0.0003074445703532547, -0.0138022992759943, 0.009118675254285336, 0.0019215286010876298, 0.010276499204337597, -0.001503698411397636, 0.03132009878754616, -0.03540191799402237, 0.002114499220624566, -0.009314917027950287, -0.013946210034191608, 0.01431252621114254, -0.03152942284941673, 0.0005952650681138039, 0.0001975699415197596, -0.00065945228561759, 0.020814651623368263, -0.01641884818673134, -0.0259430892765522, 0.014247112907469273, 0.0238498505204916, 0.029593177139759064, 0.03087528608739376, -0.012585603632032871, 0.009413037449121475, 0.0013622412225231528, 0.008883185684680939, -0.016850579530000687, -0.02836339734494686, 0.032680705189704895, -0.0032003673259168863, -0.0192578062415123, -0.01573854684829712, -0.013815382495522499, 0.008301003836095333, -0.010446574538946152, 0.0068749841302633286, -0.014521850273013115, 0.0009517699363641441, -0.00852995179593563, 0.021900519728660583, -0.014783505350351334, 0.0011684529017657042, -0.021651947870850563, 0.029253024607896805, 0.01747855171561241, 0.013488313183188438, -0.019192392006516457, 0.017962614074349403, 0.01958487369120121, 0.02636173740029335, 0.009851309470832348, -0.005115354433655739, 0.0016745917964726686, -0.009216796606779099, 0.01016529556363821, -0.008274838328361511, 0.0021880895365029573, 0.00812438689172268, 0.03608221933245659, -0.011558608151972294, 0.003141494933515787, -0.009681234136223793, 0.0063516744412481785, -0.025328200310468674, -0.031764913350343704, 0.009112134575843811, 0.015202153474092484, -0.011826804839074612, -0.012088458985090256, -0.0032984879799187183, -0.008130928501486778, -0.01940171606838703, 0.017007572576403618, -0.007509497459977865, 0.021442623808979988, -0.02242382988333702, -0.016104863956570625, -0.005298512987792492, 0.007149721961468458, -0.0213379617780447, -0.010145671665668488, 0.0039673433639109135, -0.011192291043698788, 0.028389563784003258, -0.0032118146773427725, -0.01032883021980524, 0.017203813418745995, -0.031110774725675583, 0.009844767861068249, -0.02627015858888626, -0.0028275090735405684, 0.003970614168792963, -0.016588924452662468, -0.0006418723496608436, -0.0035356127191334963, -0.024569401517510414, 0.038541775196790695, 0.007254383992403746, -0.019519461318850517, -0.009347623214125633, 0.03739049285650253, 0.0036664402578026056, -0.021063225343823433, -0.02093239687383175, 0.05044707655906677, -0.020945480093359947, -0.011316576972603798, -0.009936347603797913, -0.16515661776065826, 0.03391048312187195, 0.009570030495524406, -0.0057694921270012856, 0.020958563312888145, -0.013527561910450459, 0.013854630291461945, 0.029410017654299736, -0.021468790248036385, -0.015463808551430702, 0.012677183374762535, 0.0026165496092289686, -0.016183359548449516, -0.016628172248601913, -0.005239640828222036, 0.006626411806792021, -0.04484765976667404, -0.006168515887111425, 0.044978488236665726, 0.03220972791314125, 0.033596497029066086, -0.015463808551430702, 0.009236420504748821, -0.012611769139766693, 0.007784235291182995, -0.010564318858087063, 0.00798701774328947, 0.02553752437233925, -0.008510327897965908, -0.0008871738682501018, -0.01032883021980524, -0.015764711424708366, 0.013867713510990143, 0.01151281874626875, 0.026073917746543884, -0.003043374279513955, 0.013285530731081963, -0.02309104986488819, -0.012199662625789642, 0.0288867074996233, 0.011983797885477543, 0.002610008232295513, 0.005746596958488226, 0.0021962663158774376, -0.006999270524829626, 0.005812010727822781, 0.026309406384825706, 8.176717528840527e-05, 0.006116184871643782, -0.00824867282062769, 0.01514982245862484, -0.019035398960113525, 0.010335370898246765, -0.0025200643576681614, 0.009857851080596447, 0.031241603195667267, -0.013161244802176952, 0.022580822929739952, 0.006073665805160999, 0.002672151429578662, -0.002549500670284033, -0.0119314668700099, -0.0246871467679739, 0.008333710953593254, 0.018263516947627068, 0.016968324780464172, -0.03950989991426468, 0.003663169452920556, -0.02451707050204277, -0.004559337627142668, -0.021900519728660583, -0.001782524399459362, -0.008013183251023293, -0.010086799040436745, 0.009197171777486801, -0.01698140799999237, -0.019349385052919388, 0.0018839157419279218, 0.015215236693620682, 0.015175987966358662, 0.021560369059443474, -0.005641935393214226, -0.0238498505204916, -0.0246740635484457, -0.026675723493099213, -0.0003352454223204404, 0.016889827325940132, 0.008961682207882404, 0.010283039882779121, 0.00962890312075615, 0.018812991678714752, -0.022214505821466446, 0.008830854669213295, -0.024543235078454018, 0.009014013223350048, 0.014757339842617512, -0.013658389449119568, 0.01032883021980524, 0.010819433256983757, -0.00962890312075615, 0.002013107994571328, -0.005265806335955858, -0.029567010700702667, 0.02627015858888626, -0.0008978035766631365, -0.004219186492264271, -0.0066231414675712585, -0.0016402495093643665, 0.026649558916687965, -0.012088458985090256, -0.004768661689013243, 0.03472161293029785, 0.025746848434209824, 0.020212845876812935, 0.00019624122069217265, 0.013030417263507843, -0.005396633874624968, -0.046077437698841095, 0.01042040903121233, -0.0167459174990654, 0.05730243772268295, -0.027316778898239136, 0.012755679897964, 0.02361436001956463, -0.03990238159894943, 0.0013090925058349967, -0.10832515358924866, -0.018695246428251266, 0.015097491443157196, -0.008176717907190323, 0.0019247992895543575, 0.00949153397232294, 0.006551186088472605, 0.0072478423826396465, -0.01656275987625122, 0.0006684466497972608, -0.021795859560370445, -0.02200518175959587, -0.004942008294165134, 0.007123556453734636, 0.021220218390226364, -0.0020441794767975807, 0.008686944842338562, -0.016850579530000687, -0.014456436969339848, -0.0005049123428761959, -0.03922208026051521, 0.014574181288480759, 0.009229878894984722, -0.009046720340847969, -0.017687875777482986, -0.036605529487133026, -0.02243691310286522, 0.010400785133242607, -0.008229048922657967, 0.007188970223069191, -0.0021504766773432493, -0.018865322694182396, 0.024294663220643997, 0.00474903779104352, 0.009766271337866783, -0.008261755108833313, -0.022999471053481102, -0.012879965826869011, 0.004016403574496508, -0.04421968758106232, 0.01857750304043293, -0.0012616675812751055, -0.006044229492545128, -0.010852139443159103, 0.020487584173679352, 0.0061554331332445145, -0.00636148639023304, 0.023077968508005142, -0.013449065387248993, -0.01898306794464588, -0.01351447869092226, -0.028572721406817436, -0.03529725596308708, -0.013540644198656082, 0.032942358404397964, 0.00445467559620738, -0.0015167811652645469, -0.011205374263226986, -0.0163141880184412, -0.02460864931344986, -0.0018773743649944663, 0.02132488042116165, -0.037285830825567245, -0.005373738706111908, -0.004758849740028381, 0.003005761420354247, -0.00249880482442677, 0.010858681052923203, 0.034930936992168427, 0.008562658913433552, -0.0023123756982386112, 0.0069207740016281605, -0.012631393037736416, -0.00999521929770708, -0.03799230232834816, -0.0016337082488462329, -0.01137544959783554, -0.02042216993868351, 0.018721412867307663, -0.016693586483597755, -0.014521850273013115, -0.01564696617424488, -0.019624123349785805, -0.010989508591592312, 0.004814451560378075, 0.017282310873270035, -0.0034538456238806248, 0.006093290168792009, 0.012624852359294891, -0.06044229865074158, 0.0029910432640463114, 0.003758019534870982, 0.006704908329993486, 0.007359046023339033, 0.00027126260101795197, 0.013043500483036041, 0.007790776435285807, -0.004824263509362936, 0.01716456562280655, 0.05390092357993126, 0.0019738597329705954, -0.03147709369659424, -0.07012353092432022, 0.008261755108833313, 0.011460487730801105, 0.0008430195739492774, 0.000819715962279588, -0.025236621499061584, 0.014757339842617512, -0.004268246702849865, 0.0014816212933510542, -0.010943719185888767, -0.034773945808410645, 0.009262586012482643, 0.006057312246412039, 0.0010981331579387188, -0.03835861757397652, -0.023391954600811005, 0.033858153969049454, 0.019283970817923546, 0.021795859560370445, -0.005772762466222048, -0.008758899755775928, 0.011068005114793777, -0.011264245957136154, 0.018106523901224136, -0.00824867282062769, 0.02445165626704693, -0.011185749433934689, 0.011440863832831383, -0.006698367185890675, 0.007332880515605211, 0.00365989888086915, -0.01607869751751423, -0.005615769885480404, 0.029671672731637955, 0.0007232306525111198, -0.01418169867247343, 0.03071829304099083, 0.025406697764992714, 0.010184919461607933, 0.02400684356689453, -0.03239288553595543, -0.03283769637346268, 0.007666490506380796, -0.020539915189146996, -0.00783002469688654, -0.023248042911291122, -0.04034719616174698, -0.0014309255639091134, 0.03472161293029785, -0.004307494964450598, -0.0027735426556319, 0.003082622541114688, -0.012775303795933723, -0.03642237186431885, 0.011074546724557877, 0.0002577710256446153, 0.0029763253405690193, 0.01740005612373352, -0.002148841507732868, -0.04225727543234825, 0.04793519154191017, -0.01732155866920948, 0.006475960370153189, -0.00621757609769702, 0.0038397866301238537, -0.007424459792673588, -0.016261857002973557, 0.0019722243305295706, 0.023889098316431046, -0.04050418734550476, -0.023810602724552155, -0.005249452777206898, -0.007620701100677252, 0.0074767908081412315, 0.0008119480917230248, 0.016549676656723022, -0.008621531538665295, -0.008817772381007671, -0.01950637809932232, 0.04141998291015625, 0.01326590683311224, 0.026257075369358063, -0.0002463236160110682, 0.010224168188869953, 0.01272297278046608, 0.015293732285499573, 0.002945253625512123, 0.008621531538665295, -0.023208795115351677, 0.015751628205180168, -0.0451878122985363, 0.0068749841302633286, 0.010269957594573498, 0.012507107108831406, -0.003846328007057309, -0.0015004277229309082, 0.00717588746920228, -0.0069076912477612495, 0.014914332889020443, -0.005841447040438652, 0.0119249252602458, 0.020487584173679352, 0.0051382496021687984, -0.03550658002495766, -0.024307746440172195, 0.008078597486019135, -0.013579892925918102, -0.04152464121580124, 0.02350969798862934, 0.0005134978564456105, 0.0033230180852115154, -0.01857750304043293, 0.01698140799999237, 0.016693586483597755, -0.03780914098024368, 0.012219286523759365, -0.011610939167439938, -0.02209676243364811, -0.036370038986206055, 0.03783530741930008, -0.006018063984811306, 0.007136639207601547, 0.03521875664591789, -0.0015478526474907994, 0.009465368464589119, 0.024203084409236908, -0.017962614074349403, -0.02721211686730385, 0.03315168246626854, 0.0028782046865671873, 0.0011373814195394516, -0.016301104798913002, -0.014338691718876362, -0.01774020679295063, -0.017975695431232452, 0.0034538456238806248, 0.0023041991516947746, 0.008261755108833313, -0.0076534077525138855, 0.12705965340137482, -0.005684453994035721, 0.002050720853731036, 0.015032078139483929, 0.00879160687327385, 0.026309406384825706, -0.0011422875104472041, 0.012042669579386711, -0.021782776340842247, 0.01597403548657894, 0.029750170186161995, 0.0022682214621454477, 0.00044685762259177864, -0.022397665306925774, -0.03440762683749199, 0.014521850273013115, -0.014888167381286621, 0.03296852484345436, -0.024490904062986374, 0.005184039007872343, 0.005844717845320702, -0.031241603195667267, -0.0009051626548171043, -0.004068734589964151, 0.00904017873108387, -0.004003320820629597, 0.019558709114789963, 0.005141519941389561, -0.02770926058292389, -0.04278058558702469, 0.010950259864330292, -0.00022506415552925318, -0.02912219800055027, -0.013893879018723965, 0.01032883021980524, -0.006554456893354654, -0.017766371369361877, 0.01705990359187126, -0.011538984254002571, 0.030692126601934433, 0.02076232060790062, 0.009687774814665318, -0.04458600655198097, -0.02661030925810337, 0.004932195879518986, -0.008078597486019135, -0.010989508591592312, -0.018682165071368217, -0.019977357238531113], "link": "https://www.youtube.com/watch?v=pgZ9Bm8kadw&ab_channel=LinhaClipp 7CZucchetti"}